<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">

<?php 
    require_once 'init.php';
    is_user(1);
?>

<title>故事之三：历史，让社会远离蝴蝶的翅膀</title>
</head>
<body>
    
<!-- 页眉 begin -->
<iframe name="content" src="./header.php" height="65px" width="100%" scrolling="auto" frameborder="0"></iframe>
<!-- 页眉 end -->

<h1>故事之三：历史，让社会远离蝴蝶的翅膀</h1>


公元前210年夏，灿烂千阳，长城前线上郡军中，太子扶苏收到一封皇帝诏书，是赐死诏书。<br/><br/>
 
阳光照在扶苏额头上，亮亮的。他看完诏书，皱了皱眉头，稍加思索，拱手和使者说：“请稍候片刻。”然后就转身进里屋了。<br/><br/>
 
坐定，调息。稍候片刻，扶苏打开“历史样本”网站，点击“皇帝杀太子”标签，发现自三皇五帝起，此类事件共计8起，细看始末，太子兴兵谋反事败者5，
因母后被废受牵连者3。扶苏仔细推敲，我今虽在军中，然离皇宫及父皇车撵数千里，兴兵谋反事不至有疑；母后离世多年，后宫无事，也不至有事。
莫非今日要诞生皇帝杀太子的一种新形态：无厘头？<br/><br/>
 
太阳底下无新事，就没有其它可能性了吗？<br/><br/>
 
玉玺已经验过了，不会有假；丞相副署也检查过了，也没有问题。父皇雄才大略，乾坤独断，只要还活着，绝不会让国玺离身，不可能是矫诏。<br/><br/>
 
等等，刚才想到什么了？...<br/><br/>
 
扶苏再点击“皇帝”标签，心算了下历代帝王的年龄，不过四十有三。父皇今年五十有一，春秋鼎盛，身如虎狼，或许不至于。。。<br/><br/>

不过父皇今在沙丘，这沙丘可不是什么好地方啊。<br/><br/>
 
到底出了什么事呢？<br/><br/>
 
扶苏继续推敲。<br/><br/>
 
我今天手握秦兵精锐过半，麾下精兵三十五万，秦朝首席大将蒙恬辅佐，北击匈奴七百里，胡人畏惧不敢南下，筑长城万余里，永绝匈奴卧榻之祸。
此等重任，此等大功，一书至而自绝于军前，岂不谬哉？今日人死军溃，国门大开，如果强敌来袭，岂不一溃千里？<br/><br/>
 
而今中原空虚。黔首赵佗领秦军十五万（注：史记说是五十万，这个太夸大了），深入不毛，与南越僵持不下。此子非秦人，久掌大军，必生异心。
而天下初定，六国余族虎视眈眈、一日不敢忘复国之谋，士人游移四顾、心怀叵测之心，黔首苦秦久矣。当今之世，正是遍地干柴只等火种啊。
此等大祸，难道父皇不知道？<br/><br/>
 
扶苏再点“临阵杀大将”标签，此事古今有三，均军溃国灭君亡而已。尤其有趣的是，其中有一条点评，一署名“雄霸天下”的人痛斥“竖子不足于谋”，
点评时间是秦王政二十三年，正是王戬率举国之兵灭楚的时候。父皇錙銖必較，每因小事杀人，何人敢用“雄霸天下”这样忤逆的名字呢。
要不要查下“他”的IP？太子有自己的细作团队，有人专精于此，要查这个如探囊取物。但扶苏犹豫了一下，如果真是那个人，风险就太大了，不值得。
拿不到确证，扶苏有点遗憾。但他有种感觉，点评之人就是父皇本人。<br/><br/>
 
秦王政二十三年认清的事，秦王政三十七年可能会改。但是扶苏感觉收集到的信息已经足够了，至少足够说服自己。<br/><br/>
 
此事必有蹊跷。扶苏下定决心，站起来走出门外，布置一切。<br/><br/>
 
。。。。。<br/><br/><br/>

秦始皇十四年，太子扶苏于咸阳登基，号秦二世。蒙恬为右丞相，蒙武为大将军。减并刑法，轻徭薄赋。<br/><br/>
秦二世元年，以谋逆、矫诏、离间父子等七大罪诛左丞相李斯、中书令赵高，屠其三族，逐其余党。赐死胡亥。朝堂法家为之一空。<br/><br/>
秦二世二年，刊行诸子百家书。诏各郡县兴教办学。孔孟之学风行天下。<br/><br/>
秦二世三年，赵佗平南越，军锋至外洋。其地置十二郡。加之北击匈奴置地七郡，天下计七十三郡。事务繁复，故仿效古制，在郡至上置州。
天下计十五州。国之繁盛，上古未有。<br/><br/>
秦二世四年，颁大秦律。<br/><br/>
秦二世五年，诏诸子百家、独尊儒术。<br/><br/>

</body>
</html>