<?php
// created by duangan, 2016-01-10 -->
// support die deal function.    -->

$die_big = array
(
    "武器",
    "军事制度",
    "战法",
    "骑兵",
    "骑马民族",
    "战争",
    "非正常死亡",
    "其它",
);

// 关键事件数组
$die = array
(
    array
    (
        // 武器
        array("刀剑"),
        array("枪"),
        array("弓"),
        array("枪"),
        array("炮"),
        array("坦克", "super", "multe-key", "装甲车", "战车"),
        array("导弹", "super", "multe-key", "反导"),
        array("飞机", "super", "multe-key", "战斗机", "轰炸机", "歼击机", "预警机", "客机", 
            "直升机", "大飞机", "舰载机", "战机"),
        array("军舰", "super", "multe-key", "铁甲舰", "炮艇", "巡洋舰", "炮舰", "潜艇", "军舰", 
            "护卫舰", "鱼雷艇", "战船", "战列舰", "登陆舰", "鱼雷", "深水炸弹"),
        array("驱逐舰", "super", "multe-key", "垂直发射"),
        array("航空母舰", "super", "multe-key", "航母"),
        array("生化武器", "normal", "multe-key", "生物武器", "化学武器", "毒气", "大规模杀伤性武器"),
        array("核武器", "super", "multe-key", "核武", "原子弹", "氢弹", "中子弹", "大规模杀伤性武器", 
            "核子武器", "核能", "核动力"),
    ),
    array
    (
        // 军事制度
        array("国防", "normal", "multe-key", "军事合作", "武器禁运", "军事合作", "军费", "军事禁运",  
            "军事设施", "军事能力", "军事转型", "军事装备", "军事热线", "军事审判", "军事协议",
            "军事一体化", "军事现代化", "军事组织", "军事学说", "战争史", "部队", "情报", "军购", 
            "武器计划", "武器制造", "军事准则", "军事援助", "军援", "军事外交"),
        array("征兵", "normal", "multe-key", "兵制", "征兵", "募兵", "世兵", "军屯", "团练", "蕃兵", 
            "边军", "府兵", "义从", "禁兵", "卫所", "八旗", "绿营", "藩镇", "从军", "徵兵", 
            "志愿兵", "义务兵", "兵役", "动员令", "佣兵", "战时动员", "预备役", "现役"),
        array("军制", "super", "multe-key", "都督", "节度使", "镇守使", "经略使", "采访使", "防御使", 
            "太尉", "大都督府", "五军都督府", "都指挥使", "大将军", "骠骑将军", "车骑将军", "卫将军",  
            "前后左右将军", "上柱国", "枢密院", "都指挥司", "校尉", "执金吾", "虎贲中郎将", "羽林中郎将",
            "都尉", "观军容使", "折冲府", "千户", "百户", "总兵", "参将", "游击", "都司", "守备", 
            "牛录", "甲喇", "固山", "都统", "虎符", "观军容使", "监军", "总督", "指挥部", "指挥官", "司令官", 
            "军委", "军事委员会", "国防部", "参谋长", "军事家", "军事会谈", "军事会晤", "军事组织", "司令部", 
            "将军", "元帅", "大将", "上将", "中将", "少将", "准将", "大校", "上校", "中校", "少校", "大尉",
            "上尉", "中尉", "少尉", "上士", "中士", "下士", "列兵", "志愿兵", "士官", 
            "军区", "战区", "总参", "总政", "总装", "军事顾问", "武官"),
        array("总体战"),
        array("训练", "super", "multe-key", "军事演习", "军训", "阅兵", "军演", "空军基地", 
            "海军基地", "兵棋推演", "实战演习"),
        array("后勤", "super", "multe-key", "军事基地", "军基地", "军用物资", "军事供给", "军事货物"),
        
        array("陆军"),
        array("海军"),
        array("空军"),
    ),
    array
    (
        // 战法
        array("机动性"),
        array("兵力组合"),
        array("战场部署"),
        array("攻城守城"),
        array("战略"),
    ),
    array
    (
        // 骑兵
        array("马匹"),
        array("马具"),
        array("骑兵战法"),
        array("以步制骑"),
    ),
    array
    (
        // 骑马民族
        array("骑马民族"),
        // 骑马民族早期：史前至汉武帝时期的匈奴
        array("骑马民族早期", "normal", "tag-time", "骑马民族", "-6000", "-87"),
        // 骑马民族中期：匈奴之后、蒙古之前
        array("骑马民族中期", "normal", "tag-time", "骑马民族", "-87", "1162"),
        // 骑马民族晚期：蒙古至满洲
        array("骑马民族晚期", "normal", "tag-time", "骑马民族", "1163", "1911"),
        
        array("丝绸之路", "super", "multe-key", "丝路"),
    ),
    array
    (
        // 战争
        // "战争" 有几个关键字, 需要手动整理: 伐/击/大败/灭.
        array("战争", "super", "multe-key", "战役", "大战", "内战", "之战", "之役", "攻", "军事行动",
            "侵略", "入侵", "先发制人", "军事占领", "军事化", "军事冲突", "维和", 
            "海盗", "军事打击", "枪战", "炮战", "军事手段", "军事危机", "军事干预", "禁飞区", 
            "军事手段", "撤军"),

        array("第一次世界大战", "super", "key-time", "战争", "一战", "1914", "1918"),
        array("第二次世界大战", "super", "key-time", "战争", "二战", "抗战", "抗日战争", "纳粹", 
            "法西斯", "希特勒", "墨索里尼", "1931", "1945"),
        array("抗美援朝", "super"),
                
        // 政治冲突
        // "国内冲突" 有几个关键字, 需要手动整理: 革命/杀.
        array("国内冲突", "normal", "multe-key", "冲突", "事变", "起事", "之变", "之乱", "危机", 
                "政变", "兵变", "民变", "篡弑", "阴谋", "造反", "叛乱", "骚动", "抗争", "纠纷"),
        array("哗变", "normal", "multe-key", "营啸", "炸营", "兵谏", "兵变"),
    ),
    array
    (
        array("非正常死亡", "super", "multe-key", "意外死亡"),
        
        // 屠杀
        array("屠杀", "super", "multe-key", "种族灭绝"),
        array("恐怖主义", "super", "multe-key", "恐怖分子", "拉登", "扎卡维", "基地组织", "盖达组织", 
            "穆斯林兄弟会", "穆兄会", "ISIS", "伊斯兰国", "达伊沙", "巴格达迪", "东突", "圣战", "极端势力",
            "极端组织", "原教旨"),
        array("大清洗", "super", "multe-key", "斯大林", "苏联肃反运动", "大整肃", "大恐怖时期"),
        array("纳粹大屠杀", "super", "multe-key", "集中营", "奥斯维辛", "毒气室", "死亡火车", "灭绝营"),
        array("南京大屠杀"),
        array("红色高棉"),
        array("九一一事件"),
        array("卢旺达种族大屠杀"),
        
        // 非正常死亡
        array("地震"),
        array("水灾"),
        array("火灾"),
        array("空难"),
        array("矿难"),
        array("交通事故"),
        array("病疫", "normal", "multe-key", "瘟疫", "疫疠", "时疫", "非典", "鼠疫", "天花", 
            "埃博拉病毒", "疟疾", "艾滋病", "癌", "肺结核", "心脑血管", "狂犬病", "流感", "登革热"),
        array("欧洲黑死病"),
        array("自杀", "normal", "multe-key", "自尽", "自缢", "自裁"),
        array("谋杀"),
        array("死刑"),
        
        // 饥荒
        array("饥荒", "super", "multe-key", "饥荒", "人相食"),
        array("乌克兰大饥荒"),
        array("爱尔兰大饥荒"),
        
    ),
    array
    (
        // other
    )
);

?>