<?php
// created by duangan, 2015-5-4 -->
// support topic deal function.    -->

// 主题 big
$topic_big = array(
    "历史",
    "科学技术",
    "人文社会",
    "宗教",
    "西方思想",
    "中国思想",
    "经济",
    "IT行业",
    "艺术体育",
    "其它"
);

// 主题 tag vip struct.
$topic = array
(
    array
    (
        // 历史
        array("历史学", "super", "multe-key", "历史学", "历史研究", "史学"),
        array("分子遗传学", "super", "multe-key", "分子遗传学", "基因", "克隆"),
        array("语言学", "super", "multe-key", "语言学", "汉藏语系", "印欧语系", "阿尔泰语系", "闪含语系", 
                "达罗毗荼语系", "高加索语系", "乌拉尔语系"),
        array("地理", "super", "multe-key", "地理", "地球科学", "地质学", "气候学"),
        array("交通", "super", "multe-key", "交通", "国道", "直道", "水路", "航线", "高速公路",
            "海路", "海运", "河运", "运河", "大道", "驿站", "驿马", "火车", "铁路", "高速铁路", "高铁", 
            "地铁", "地下铁", "轻轨", "公交", "公共交通", "铁轨", "轨道交通", "机场", "飞机", "空运", 
            "客机", "货机", "镖局", "快递", "邮政"),
        array("地质年代"),
    ),
    array
    (
        // 科学技术
        array("科学", "super"),
        array("发明创造", "super"),
        array("天文学", "super", "multe-key", "航天", "太阳", "月球", "恒星", "行星", "卫星", "火星", 
                "月食", "日食", "黑洞", "星图", "历法", "水星", "土星", "水星", "天王星", "海王星", 
                "冥王星", "彗星", "星云", "银河", "星系", "宇宙", "陨石", "航天飞机", "宇宙飞船", 
                "空间站", "望远镜", "NASA", "天文学"),
        array("物理学", "super"),
        array("航空"),
        array("生物学", "super", "multe-key", "生物学", "植物学", "动物学", "生物化学"),
        array("生态学", "super", "multe-key", "生态学", "环境保护", "环保"),
        array("化学"),
        array("数学", "normal", "multe-key", "数学", "代数", "几何", "逻辑学", "数论", "拓扑", 
            "微积分", "方程", "概率论", "统计学"),
        array("医学"),
        array("诺贝尔奖", "super"),
    ),
    array
    (
        // 人文社会
        array("社会", "super"),
        array("人口", "super"),
        array("教育", "super"),
        array("伦理学"),
        array("心理学"),
    ),
    array
    (
        // 宗教
        array("宗教", "super", "multe-key", "宗教", "耆那教", "拜火教", "祆教", "摩尼教", "景教"),
        array("基督教", "super", "multe-key", "耶稣会", "多明我会", "共济会", "圣公会", "方济各会", "循道公会",
                "循道会", "教宗", "教皇", "布道会", "浸信会", "圣经会", "公理会", "长老会", "归正会", "卫理公会", 
                "殉道", "巴色会", "联合路德会", "圣经", "新约", "旧约", "基督", "耶稣", "福音", "基督教", "新教",
                "东正教", "天主教", "修女", "修士", "传教士", "受洗", "基督教", "浸礼会"),
        array("东正教"),
        array("犹太教"),
        array("伊斯兰教", "super", "multe-key", "伊斯兰教", "古兰经", "斋月", "穆斯林", "什叶派", "逊尼派"),
        array("佛教"),
        array("道教"),
        array("印度教"),
        array("萨满教"),
    ),
    array
    (    
        // 西方思想
        array("古希腊哲学", "super", "multe-key", "希腊哲学", "普罗泰戈拉", "德谟克利特", "芝诺", "苏格拉底", 
            "柏拉图", "亚里士多德", "伊壁鸠鲁", "泰勒斯", "米利都学派", "古希腊哲学"),
        array("经院哲学"),
        array("康德哲学", "super", "multe-key", "康德"),
        array("经验主义"),
        array("存在主义"),
        array("后现代哲学"),
        array("文艺复兴"),
        array("启蒙运动"),
        array("马克思主义", "normal", "multe-key", "马克思主义", "马列主义", "马克思", "恩格斯", 
            "列宁", "斯大林"),
    ),
    array
    (
        // 中国思想
        array("中国思想家", "super", "key-time", "阴阳家", "杂家", "纵横家", "邹衍", 
                "张仪", "苏秦", "吕不韦", "吕氏春秋", "淮南子", "许行", "孙武", "司马穣苴", "孙膑", 
                "吴起", "尉缭", "魏无忌", "白起", "司马法", "-500", "200"),
        array("文字狱", "super", "multe-key", "文字狱", "焚书", "坑儒", "禁书"),
        array("儒家", "super", "multe-key", "儒家", "孔子", "孟子", "四书五经", "论语", "尚书", "中庸", 
                "周易", "荀子", "董仲舒", "程颐", "朱熹", "陆九渊", "王阳明", "朱程理学", "心学"),
        array("道家", "super", "multe-key", "道家", "老子", "庄子", "列子", "道德经", "慎到", "杨朱"),
        array("法家", "super", "key-time", "法家", "管子", "韩非子", "商鞅", "商君书", "李斯", "吴起", 
                "-500", "200"),
        array("墨家", "super", "multe-key", "墨家", "墨子"),
        array("名家", "super", "multe-key", "名家", "邓析", "公孙龙", "惠子", "惠施", "杨子"),
    ),
    array
    (
        // 经济
        array("经济", "super"),
        array("经济危机", "super", "multe-key", "经济危机", "金融危机", "股灾"),
        array("农业"),
        array("工业"),
        array("金融业"),
        array("能源", "super", "multe-key", "能源", "石油", "煤", "天然气", "太阳能", "核电", "可再生能源", 
            "油页岩", "水电", "火电", "风电", "碳排放", "温室效应"),
    ),
    array
    (
        // IT行业
        array("IT行业", "super", "multe-key", "微软", "Microsoft", "盖茨", "Windows", "IBM", "Inter", 
            "高通", "qualcomm", "博通", "Broadcom", "三星"),
        array("IT技术", "super", "multe-key", "IT技术", "Linux", "区块链", "比特币", "SQL", 
            "搜索引擎", "维基", "敏捷", "设计模式", "算法", "PageRank", "量子计算", "芯片", "CPU"),
            
        array("人工智能",  "super", "multe-key", "人工智能", "深度学习", "神经网络", "机器学习" , 
            "大数据", "数据挖掘", "AlphaGo", "云计算", "模式识别", "统计建模", "数据挖掘", 
            "知识发现", "预测分析", "数据科学", "自适应系统", "自组织系统"),
        array("机器人", "super", "multe-key", "机器人", "无人驾驶", "自动驾驶", "无人机", "大疆", 
            "波士顿动力", "无人车", "新能源"),
        
        array("马斯克", "super", "multe-key", "马斯克", "特斯拉", "Tesla", "SpaceX", "SolarCity"),
        // "拉里·佩奇", "谢尔盖·布林", "埃里克·施密特"
        array("Google", "super", "multe-key", "Google", "谷歌", "Alphabet", "android", 
            "安卓", "GMail", "YouTube", "GReader", "Chrome"),
        array("苹果", "super", "multe-key", "苹果", "apple", "mac", "ios", "IPhone", "乔布斯"),
        
        array("手机行业", "super", "multe-key", "手机", "诺基亚", "努比亚", "魅族", "乐视", 
            "酷派", "联想手机", "360", "OPPO", "vivo", "Galaxy", "诺基亚", "摩托罗拉", "Nexus",
            "Pixel"),
        array("华为", "normal", "multe-key", "华为公司", "08机", "任正非"),
        array("小米", "normal", "multe-key", "小米", "雷军"),
        array("锤子手机", "normal", "multe-key", "锤子", "罗永浩"),
        
        array("运营商", "normal", "multe-key", "运营商", "移动", "联通", "电信"),
        array("电子商务", "super", "multe-key", "电子商务", "电商", "阿里巴巴", "马云", "阿里云", 
            "蚂蚁金服", "支付宝", "淘宝", "京东", "当当", "一号店", "菜鸟", "顺丰", "网易严选", 
            "亚马逊", "Amazon", "美团", "饿了么"),
        array("社交", "super", "multe-key", "社交", "腾讯", "QQ", "微信", "马化腾", "陌陌", "微博", 
            "Facebook", "扎克伯格", "Twitter", "知乎", "豆瓣"),
        array("游戏", "super", "multe-key", "游戏", "王者荣耀", "RPG", "即时战略", "地下城与勇士", 
            "生化危机", "神秘岛", "穿越火线", "星际争霸", "VR战警", "命令与征服", "刺客信条", "风色幻想", 
            "模拟人生", "劲乐团", "魔兽世界", "暗黑破坏神", "dota", "疯狂的小鸟", "水果忍者"),
        array("广告", "super", "multe-key", "广告", "Google", "百度", "门户网站", "Admob", 
            "AdWords", "新浪", "搜狐", "网易", "丁磊", "今日头条"),
        array("共享经济", "super", "multe-key", "共享经济", "分享经济", "uber", "滴滴", "ofo", 
            "摩拜单车", "共享单车", "Airbnb", "共享充电宝", "共享自行车"),
    ),
    array
    (
        // 艺术文化体育
        array("文学", "super", "multe-key", "文学", "诗", "诗歌", "散文", "剧本", "童话", "寓言",
            "象征主义", "现实主义", "浪漫主义", "自然主义", "乐府", "格律", "歌谣", "话本", "骈文", 
            "对仗", "平仄"),
        array("小说"),
        array("音乐", "super", "multe-key", "音乐", "民族乐器", "西洋乐器", "钢琴", "竖琴", "提琴", 
            "口琴", "电子琴", "管乐器", "弦乐器", "打击乐器", "锣", "鼓", "钹", "吉他", "琵琶", "笛", 
            "二胡", "编钟", "贝司", "萨克斯", "交响乐", "乐队", "乐团", "民乐", "古筝", "磬", "埙"),
        array("美术"),
        array("雕像"),
        array("电影"),
        array("电视剧"),
        array("书法"),
        array("体育"),
        array("奥运会", "super", "multe-key", "奥运会", "奥林匹克"),
        array("奥斯卡奖", "super", "multe-key", "奥斯卡奖", "小金人"),
    ),
    array
    (
        // other
    )
);

?>