<?php
// created by duangan, 2015-4-27 -->
// support country deal function.    -->

$country_big = array
(
    "史前史",
    "古代文明",
    "中东北非中亚",
    "亚洲",
    "欧洲",
    "北美",
    "其它地区",
    "大城市",
    "湖海河山",
    "其它"
);

// 数组
$country = array
(

    array
    (
        // 史前史
        array("考古", "super", "multe-key", "碳14", "碳十四", "智人", "遗址", "原始人", "金石学",
            "古代人类", "地层", "类型学", "史前", "能人", "直立人", "匠人", "海德堡人", "尼安德特人"),
        
        array("骨器", "super", "multe-key", "兽骨", "象牙器", "木器"),
        array("石器", "super", "multe-key", "石核", "手斧", "砾石", "敲砸器", "砍砸器", "磨制石器", 
            "穿孔", "磨光"),
        array("玉器", "super", "multe-key", "玉璧", "玉琮", "玉琀", "翡翠", "解玉砂琢碾加工", "碾法", 
            "古玉", "和田玉", "昆仑之玉", "岫玉", "蓝田玉", "独山玉", "绿松石", "黄蜡石", "玛瑙",
            "青金石", "孔雀石", "硬玉", "软玉"),
        array("陶器", "super", "multe-key", "黑陶", "白陶", "彩陶", "陶片", "陶雏器", "陶俑", 
            "陶轮", "陶瓷", "唐三彩", "釉", "窑", "瓷", "景德镇"),
        array("青铜器", "super", "multe-key", "青铜", "红铜", "鼎", "铜器"),
        array("铁器", "super", "multe-key", "冶铁"),
        
        array("农业工具", "super", "sigle-key", "石磨", "犁", "斧", "铲", "镰", "锄", "镞", "凿"),
        array("容器", "normal", "sigle-key", "碗", "壶", "钵", "罐"),
        array("鼎"),
        array("轮子", "normal", "sigle-key", "纺轮", "陶轮", "车轮"),
        
        array("小麦", "super", "sigle-key", "大麦", "粟", "黍", "稷"),
        array("稻", "super"),
        array("玉米"),
        array("大豆"),
        array("甘薯"),
        array("棉花", "super"),
        array("丝绸", "super", "sigle-key", "桑", "蚕", "绸缎"),
        array("茶", "super"),
        array("其它作物", "normal", "sigle-key", "油籽", "蔓青", "大芥", "花生", "苜蓿", "豌豆",
            "胡麻", "大麻", "向日葵", "萝卜", "白菜", "芹菜", "韭菜", "蒜", "葱", "胡萝卜", "菜瓜", 
            "莲花菜", "菊芋", "刀豆", "芫荽", "莴笋", "黄花", "辣椒", "黄瓜", "西红柿", "香菜", 
            "梨", "青梅", "苹果", "桃", "杏", "核桃", "李子", "樱桃", "草莓", "沙果", "红枣", 
            "绿肥", "紫云英", "人参", "当归", "金银花", "薄荷", "艾蒿", "橄榄树", "无花果", "葡萄", 
            "青稞", "油菜", "土豆", "高粱", "甘蔗", "绿豆", "芝麻", "马铃薯", "烟草"),
        
        array("猪"),
        array("牛"),
        array("羊"),
        array("狗"),
        array("鸡"),
        array("其它动物", "normal", "sigle-key", "鸭", "鹅", "鸽子", "骆驼", "猫", "兔"),
        array("渔猎", "normal", "sigle-key", "捕鱼", "蚌", "养鱼", "独木舟", "狩猎"),
        
        array("房屋", "super", "sigle-key", "庇护所", "山洞", "木屋", "茅屋", "建筑"),
        array("服装"),
        array("饮食"),
        array("武器"),
        array("堡垒"),
        array("城市"),
        
        array("文字"),
        array("祭祀墓葬", "normal", "sigle-key", "祭祀", "墓葬", "埋葬", "巫师", "祭司", 
            "瓮棺", "石棺", "悬棺", "封土", "火葬", "土葬", "水葬", "天葬", "陪葬品", 
            "墓穴", "墓道"),
        array("婚姻", "normal", "sigle-key", "家庭", "社会分工"),
         
        array("世界遗产名单"),
    ),
    array
    (
        // 古代文明
        array("苏美尔文明", "super", "sigle-key", "苏美尔"),
        array("埃及文明", "super", "key-time", "埃及", "金字塔", "-4500", "642"),
        array("赫梯文明", "normal", "sigle-key", "赫梯"),
        array("巴比伦文明", "super", "sigle-key", "巴比伦"),
        array("腓尼基人", "normal", "sigle-key", "腓尼基"),
        array("爱琴文明", "normal", "multe-key", "克里特文明", "迈锡尼", "米诺斯"),
        array("希腊文明", "super", "key-time", "希腊", "荷马史诗", "雅典", "斯巴达", "马其顿", "-1200", "-146"),
        array("波斯文明", "normal", "key-time", "波斯", "大流士", "伊朗", "塞琉古王朝", "萨珊王朝", 
                "安息王朝", "德黑兰", "-3000", "651"),
        array("罗马文明", "super", "key-time", "伊特鲁里亚文明", "罗马", "罗马帝国", "-2000", "476"),
        array("日耳曼人", "normal", "multe-key", "日耳曼", "汪达尔人", "格庇德人", "哥特人", "勃艮第人", 
               "法兰克人", "盎格鲁人", "撒克逊人", "阿勒曼尼人"),
        array("古印度文明", "normal", "key-time", "印度", "印度河", "恒河", "哈拉帕文化", "摩揭陀", "孔雀王朝",
                "阿育王", "吠陀", "刹帝利", "婆罗门", "印度教", "笈多王朝", "吠陀", "梵", "摩诃婆罗多", 
                "罗摩衍那", "佛陀", "莫卧儿朝", "-2500", "1600"),
        array("班图人文明",  "normal", "multe-key", "班图尼格罗人", "班图语系", "割礼", "伊费王国", 
                "刚果王国", "大津巴布韦", "马拉维文化", "马蓬古布韦文化", "祖鲁王国", "斯瓦希里文明", 
                "加纳帝国", "贝宁文明", "诺克文化"),
        array("印第安文明", "normal", "sigle-key", "玛雅", "印加", "阿兹特克", "美洲原住民", "易洛魁"),
        array("波利尼西亚文明", "normal", "multe-key", "波利尼西亚", "波利尼西亚语", "南岛人"),
        array("奥斯曼帝国"),
        array("神圣罗马帝国"),
        array("拜占庭", "normal", "key-time", "君士坦丁堡", "东罗马", "-667", "1453"),
        array("奥匈帝国"),
    ),
    array
    (
        // 中东北非中亚
        array("犹太人", "super", "multe-key", "希伯来语", "犹太教", "希伯来人", "犹太历", 
                "犹太王国", "以色列王国", "锡安主义", "犹太复国主义运动"),
        array("以色列", "super", "multe-key", "耶路撒冷", "特拉维夫", "海法"),
        
        array("穆斯林国家", "super", "multe-key", "中东", "阿拉伯", "伊斯兰教", "逊尼派", "什叶派", 
            "阿联酋", "阿拉伯联合酋长国", "迪拜", "约旦", "安曼", "阿尔及利亚", "阿尔及尔", 
            "科威特", "黎巴嫩", "贝鲁特", "也门", "萨那", "亚丁", "摩洛哥", "拉巴特", 
            "苏丹", "喀土穆", "朱巴", "南苏丹", "突尼斯"),
        array("土耳其", "super", "multe-key", "伊斯坦布尔", "安卡拉"),
        array("埃及", "super", "key-time", "开罗", "亚历山大", "苏伊士", "651", "2100"),
        array("伊朗", "super", "key-time", "德黑兰", "马什哈德", "伊斯法罕", "642", "2100"),
        array("叙利亚", "normal", "multe-key", "大马士革", "阿勒颇"),
        array("伊拉克", "normal", "key-time", "巴格达", "巴士拉", "纳杰夫", "摩苏尔", "635", "2100"),
        array("沙特阿拉伯", "normal", "multe-key", "沙特", "利雅得", "麦加"),
        array("利比亚", "normal", "multe-key", "的黎波里"),
        array("卡塔尔", "normal", "multe-key", "多哈", "半岛电视台"),
        array("石油天然气", "super", "multe-key", "石油", "天然气"), 
        
        array("巴勒斯坦", "normal", "multe-key", "加沙"),
        array("塞浦路斯", "normal", "multe-key", "尼科西亚"),
        array("阿富汗", "normal", "multe-key", "坎布尔"),
        array("高加索三国", "super", "multe-key", "亚美尼亚", "阿塞拜疆", "格鲁吉亚", 
                "埃里温", "巴库", "第比利斯"),
        array("中亚五斯坦", "super", "multe-key", "哈萨克斯坦", "乌兹别克斯坦", "吉尔吉斯斯坦",
                 "塔吉克斯坦", "土库曼斯坦", "阿斯塔纳", "塔什干", "比什凯克", "杜尚别", "阿什哈巴德"),
        array("库尔德人", "normal", "multe-key", "库尔德", "基尔库克"),       
    ),
    array
    (
        // 亚洲
        array("日本", "super", "multe-key", "东京", "大阪", "京都", "北海道"),
        array("韩国", "super", "multe-key", "汉城", "首尔", "济州"),
        array("朝鲜", "normal", "multe-key", "平壤"),
        array("蒙古", "normal", "key-time", "乌兰巴托", "1911", "2011"),
        
        array("南亚", "super", "multe-key", "孟加拉国", "达卡", "马尔代夫",
            "马累", "尼泊尔", "加德满都", "斯里兰卡", "科伦坡"),
        array("印度", "super", "key-time", "孟买", "加德满都", "新德里", "1600", "2100"),
        array("巴基斯坦", "super", "multe-key", "安卡拉"),
        
        array("东南亚", "super", "multe-key", "东盟", "东南亚联盟", "柬埔寨", 
            "金边", "老挝", "万象", "缅甸", "内比都", "仰光"),
        array("印尼", "normal", "multe-key", "雅加达", "印度尼西亚"),
        array("越南", "normal", "multe-key", "河内"),
        array("马来西亚", "normal", "multe-key", "吉隆坡"),
        array("泰国", "normal", "multe-key", "曼谷"),
        array("新加坡"),
        array("菲律宾", "normal", "multe-key", "马尼拉"),
    ),
    array
    (
        // 欧洲
        array("欧洲",  "super", "multe-key", "欧盟", "欧洲联盟", "欧共体", "欧洲经济共同体", 
            "欧洲共同体", "欧元", "申根", "捷克", "布拉格", "匈牙利", 
            "布达佩斯", "斯洛伐克", "克拉科夫", "保加利亚", "索非亚", "罗马尼亚", 
            "布加勒斯特", "阿尔巴尼亚", "地拉那"),
        array("德国", "super", "multe-key", "德意志", "普鲁士", "条顿", "柏林"),
        array("英国", "super", "multe-key", "英吉利", "伦敦", "利物浦", "大不列颠", "大英帝国"),
        array("法国", "super", "multe-key", "法兰西", "巴黎", "拿破仑", "马赛"),
        array("俄罗斯", "super", "multe-key", "俄国", "莫斯科", "沙皇", "圣彼得堡", "海参崴", "苏联"),
        array("意大利", "normal", "key-time", "罗马", "威尼斯", "佛罗伦萨", "热那亚", "米兰", 
                "476", "2100"),
        array("奥地利", "normal", "multe-key", "维也纳"),
        array("西班牙", "normal", "multe-key", "马德里"),
        array("葡萄牙", "normal", "multe-key", "里斯本"),
        array("波兰", "normal", "multe-key", "华沙"),
        array("瑞士", "normal", "multe-key", "日内瓦"),
        array("希腊", "normal", "multe-key", "雅典"),
        array("爱尔兰", "normal", "multe-key", "都柏林"),
        array("乌克兰", "super", "multe-key", "基辅", "克里米亚"),
        array("底地三国", "normal", "multe-key", "荷兰", "比利时", "卢森堡", "阿姆斯特丹", "布鲁塞尔"),
        array("北欧五国", "normal", "multe-key", "挪威", "瑞典", "芬兰", "丹麦", "冰岛", 
                "斯德哥尔摩", "奥斯陆", "赫尔辛基", "哥本哈根", "雷克雅未克"),
        array("南斯拉夫诸国", "normal", "multe-key", "南斯拉夫", "斯洛文尼亚", "黑山", "塞尔维亚", 
                "克罗地亚", "科索沃", "波黑", "马其顿", "卢布尔雅那", "波德戈里察", "贝尔格莱德", 
                "萨格勒布", "萨拉热窝", "斯科普里"),
        array("波罗的海三国", "normal", "multe-key", "立陶宛", "拉脱维亚", "爱沙尼亚", 
                "维尔纽斯", "里加", "塔林"),
    ),
    array
    (
        // 美洲
        array("美国", "super", "multe-key", "美利坚", "纽约", "华盛顿", "洛杉矶", "芝加哥", "波士顿", 
                "亚特兰大", "休斯顿"),
        array("加拿大", "normal", "multe-key", "多伦多", "温哥华", "魁北克", "渥太华", "爱斯基摩"),
        array("墨西哥"),
        
        // 国际组织
        array("联合国", "super", "multe-key", "联合国宪章", "安理会", "教科文组织", "安全理事会", 
            "常任理事国", "人权理事会", "国际联盟", "联合国家宣言", "世界人权宣言", "经济及社会理事会"),
        array("世界贸易", "super", "multe-key", "世界贸易组织", "世贸", "关贸总协定"),
        array("世界金融", "super", "multe-key", "世界银行", "世行", "亚行", "亚洲开发银行", "布雷顿森林体系", 
                "牙买加货币体系", "IMF", "国际货币基金组织", "特别提款权", "亚洲基础设施投资银行", "亚投行"),
        array("北约", "super", "multe-key", "北大西洋公约", "华沙条约", "华约", 
            "北大西洋合作委员会", "和平伙伴关系"),
        array("上合组织", "super", "multe-key", "上海合作组织", "上海五国", "上海公约"), 
        
        array("国际法", "super", "multe-key", "国际法庭", "国际法院", "国际海洋法法庭", "海牙仲裁法院", 
            "国际公法", "条约", "万民法", "公海"),
        array("人权高于主权", "super", "multe-key", "人权高于主权", "人权"),
        array("TPP", "super", "multe-key", "跨太平洋伙伴关系协定", "TTIP", "跨大西洋贸易和投资伙伴协定"),
    ),
    array
    (
        // 其它地区
        // 南美
        array("南美", "super", "multe-key", "古巴", "哈瓦那", "委内瑞拉", 
            "加拉加斯", "玻利维亚", "拉巴斯", "智利", "圣地亚哥", "哥伦比亚", 
            "圣菲波哥大", "厄瓜多尔", "基多", "巴拉圭", "亚松森", "秘鲁", "利马",
            "乌拉圭", "蒙得维的亚"),
        array("巴西", "super", "multe-key", "里约"),
        array("阿根廷", "normal", "multe-key", "布宜诺斯艾利斯"),
        array("中美洲七国", "super", "multe-key", "危地马拉", "伯利兹", "萨尔瓦多", "洪都拉斯", "尼加拉瓜", 
                "哥斯达黎加", "巴拿马"),

        // 大洋洲
        array("澳大利亚", "super", "multe-key", "堪培拉", "悉尼"),
        array("新西兰", "normal", "multe-key", "惠灵顿"),
        array("太平洋岛国", "normal", "multe-key", "基里巴斯", "塔拉瓦", "图瓦卢", "富纳富提", 
                "马绍尔群岛", "马朱罗", "斐济", "所罗门群岛", "霍尼亚拉", "帕劳", "梅莱凯奥克", 
                "汤加", "努库阿洛法", "瑙鲁", "密克罗尼西亚联邦", "帕利基尔", "萨摩亚", "阿皮亚", 
                "瓦努阿图", "维拉港", "巴布亚新几内亚", "莫尔兹比"),
                
        // 非洲
        array("非洲", "super", "multe-key", "非盟", "非洲联盟", "赞比亚", "卢萨卡", "布隆迪", "布琼布拉", 
                "班吉", "几内亚", "科纳克里", "尼日尔", "尼亚美", "比绍", "博茨瓦纳", "哈博罗内", 
                "加纳", "阿克拉", "布基纳法索", "瓦加杜古", "加蓬", "利伯维尔", "莱索托", "马塞卢", 
                "圣多美", "莫桑比克", "马普托", "吉布提", "马拉维", "利隆圭", 
                "毛里塔尼亚", "努瓦克肖特", "毛里求斯", "路易港", "贝宁", "波多诺伏", "毛里塔尼亚", 
                "努瓦克肖特", "乌干达", "坎帕拉", "纳米比亚", "温得和克", "塞舌尔", "厄立特里亚",
                "布隆迪", "布琼布拉", "卢旺达", "基加利", "马达加斯加", 
                "塔那那利佛", "乍得", "恩贾梅纳", "马里", "巴马科", "刚果", "布拉柴维尔", "金沙萨", 
                "安哥拉", "罗安达", "肯尼亚", "内罗毕", "尼日利亚", "阿布贾", "索马里", "摩加迪沙",
                "津巴布韦", "哈拉雷", "坦桑尼亚", "达累斯萨拉姆", "埃塞俄比亚", "亚的斯亚贝巴"),
        array("南非", "normal", "multe-key", "比勒陀利亚"),
        
    ),
    array
    (
        // 大城市
        array("纽约"),
        array("伦敦"),
        array("巴黎"),
        array("东京"),
        array("芝加哥"),
        array("洛杉矶"),
        array("布鲁塞尔"),
        array("悉尼"),
        array("首尔", "normal", "multe-key", "汉城"),
        array("多伦多"),
        
        array("柏林"),
        array("罗马"),
        array("维也纳"),
        array("莫斯科"),
        array("阿姆斯特丹"),
        array("马德里"),
        array("西雅图"),
        array("波士顿"),
        array("大阪"),
        array("孟买"),
        array("伊斯坦布尔"),
        array("耶路撒冷"),
        array("开罗"),
        array("巴格达"),
    ),
    array
    (
        // 湖海河山
        array("太平洋", "super", "sigle-key", "太平洋"),
        array("大西洋", "super", "sigle-key", "大西洋"),
        array("印度洋", "super", "sigle-key", "印度洋"),
        array("北冰洋"),
        array("南极"),
        
        array("地中海", "super", "multe-key", "爱琴海", "直布罗陀", "达达尼尔海峡", "苏伊士运河", 
                "博斯普鲁斯海峡", "马尔马拉海", "土耳其海峡"),
        array("黑海"),
        array("红海波斯湾", "super", "multe-key", "波斯湾", "红海"),
        array("加勒比海"),
        array("北海"),
        array("波罗的海"),
        array("日本海"),
        
        array("亚马逊河", "super", "multe-key", "亚马孙河", "亚马逊雨林", "热带雨林", "亚马逊丛林"),
        array("尼罗河", "super", "sigle-key", "尼罗河"),
        array("密西西比河", "super", "sigle-key", "密西西比河"),
        array("多瑙河"),
        array("莱茵河"),
        array("伏尔加河"),
        array("两河流域", "super", "multe-key", "幼发拉底河", "底格里斯河", "美索不达米亚"),
        array("里海"),
        array("印度河"),
        array("恒河"),
        array("湄公河"),
        
        array("五大湖区", "super", "multe-key", "五大湖", "苏必利尔湖", "密歇根湖", "休伦湖", 
                "伊利湖", "安大略湖"),
        array("贝加尔湖"),
                
        array("撒哈拉沙漠"),
        array("东非大裂谷"),
        array("落基山脉", "normal", "multe-key", "落基山"),
        array("阿尔卑斯山脉", "normal", "multe-key", "阿尔卑斯山"),
        array("安第斯山脉", "normal", "multe-key", "安第斯山"),
    ),
    array
    (
        // other
    )
);

?>