<?php
// created by duangan, 2015-4-19 -->
// support dynasty deal function.    -->

$dynasty_big = array
(
    "正朔朝代",
    "东周列国",
    "少数民族和地方政权",
    "古代政治",
    "现代政治",
    "中国共产党",
    "大城市",
    "省份",
    "山河湖海",
    "其它"
);

// 朝代数组
$dynasty = array
(
    array
    (
        // 正朔朝代
        array("中国", "super"),
        array("中国年号", "normal"),
        array("全国重点文物保护单位"),
        
        array("夏朝", "normal", "tag-time", "中国", "-2070", "-1600"),
        array("商朝", "normal", "tag-time", "中国", "-1600", "-1046"),
        array("周朝", "super", "tag-time", "中国", "-1046", "-770"),
        array("春秋战国", "super", "tag-time", "中国", "-770", "-221"),
        array("秦朝", "normal", "tag-time", "中国", "-221", "-206"),
        
        array("汉朝", "super", "tag-time", "中国", "-206", "8"),
        // 汉武帝（在位：前141年", "前87年二月）
        array("建元", "hide", "tag-time", "中国", "前140年", "前135年"),
        array("元光", "hide", "tag-time", "中国", "前134年", "前129年"),
        array("元朔", "hide", "tag-time", "中国", "前128年", "前123年"),
        array("元狩", "hide", "tag-time", "中国", "前122年", "前117年"),
        array("元鼎", "hide", "tag-time", "中国", "前116年", "前111年"),
        array("元封", "hide", "tag-time", "中国", "前110年", "前105年"),
        array("太初", "hide", "tag-time", "中国", "前104年", "前101年"),
        array("天汉", "hide", "tag-time", "中国", "前100年", "前97年"),
        array("太始", "hide", "tag-time", "中国", "前96年", "前93年"),
        array("征和", "hide", "tag-time", "中国", "前92年", "前89年"),
        array("后元", "hide", "tag-time", "中国", "前88年", "前87年"),
        // 汉昭帝（在位：前87年", "前74年四月）"
        array("始元", "hide", "tag-time", "中国", "前86年", "前80年七月"),
        array("元凤", "hide", "tag-time", "中国", "前80年八月", "前75年"),
        array("元平", "hide", "tag-time", "中国", "前74年"),
        /// 汉宣帝（在位：前74年", "前49年）"
        array("本始", "hide", "tag-time", "中国", "前73年", "前70年"),
        array("地节", "hide", "tag-time", "中国", "前69年", "前66年"),
        array("元康", "hide", "tag-time", "中国", "前65年", "前61年二月"),
        array("神爵", "hide", "tag-time", "中国", "前61年三月", "前58年"),
        array("五凤", "hide", "tag-time", "中国", "前57年", "前54年"),
        array("甘露", "hide", "tag-time", "中国", "前53年", "前50年"),
        array("黄龙", "hide", "tag-time", "中国", "前49年"),
        // 汉元帝（在位：前48年", "前33年）"
        array("初元", "hide", "tag-time", "中国", "前48年", "前44年"),
        array("永光", "hide", "tag-time", "中国", "前43年", "前39年"),
        array("建昭", "hide", "tag-time", "中国", "前38年", "前34年"),
        array("竟宁", "hide", "tag-time", "中国", "前33年"),
        // 汉成帝（在位：前33年", "前7年）"
        array("建始", "hide", "tag-time", "中国", "前32年", "前28年二月"),
        array("河平", "hide", "tag-time", "中国", "前28年三月", "前25年"),
        array("阳朔", "hide", "tag-time", "中国", "前24年", "前21年"),
        array("鸿嘉", "hide", "tag-time", "中国", "前20年", "前17年"),
        array("永始", "hide", "tag-time", "中国", "前16年", "前13年"),
        array("元延", "hide", "tag-time", "中国", "前12年", "前9年"),
        array("绥和", "hide", "tag-time", "中国", "前8年", "前7年"),
        // 汉哀帝（在位：前7年", "前1年）
        array("建平", "hide", "tag-time", "中国", "前6年", "前3年"),
        array("太初元将", "hide", "tag-time", "中国", "前5年六月", "前5年八月"),
        array("元寿", "hide", "tag-time", "中国", "前2年", "前1年"),
        // 汉平帝（在位：前1年", "5年）
        array("元始", "hide", "tag-time", "中国", "1年", "5年"),
        // 汉少帝（在位：6年", "8年十一月）
        array("居摄", "hide", "tag-time", "中国", "6年", "8年十一月"),
        array("初始", "hide", "tag-time", "中国", "8年十一月", "8年十一月"),
        
        array("新朝", "normal", "tag-time", "中国", "8", "24"),
        // 王莽（在位：9年", "23年）
        array("始建国", "hide", "tag-time", "中国", "9年", "13年"),
        array("天凤", "hide", "tag-time", "中国", "14年", "19年"),
        array("地皇", "hide", "tag-time", "中国", "20年", "23年九月"),
        
        // 汉更始帝（在位：23年二月", "25年九月）
        array("更始", "hide", "tag-time", "中国", "23年二月", "25年九月"),
        
        // 隗嚣
        array("汉复", "hide", "tag-time", "中国", "23年七月", "34年十月"),
        // 公孙述
        array("龙兴", "hide", "tag-time", "中国", "25年四月", "36年十一月"),
        
        array("东汉", "normal", "tag-time", "中国", "24", "220"),
        // 汉光武帝（在位：25年", "57年二月）
        array("建武", "hide", "tag-time", "中国", "25年六月", "56年四月"),
        array("中元", "hide", "tag-time", "中国", "56年四月", "57年"),
        // 汉明帝（在位：57年", "75年）
        array("永平", "hide", "tag-time", "中国", "58年", "75年"),
        // 汉章帝（在位：75年", "88年）
        array("建初", "hide", "tag-time", "中国", "76年", "84年八月"),
        array("元和", "hide", "tag-time", "中国", "84年八月", "87年七月"),
        array("章和", "hide", "tag-time", "中国", "87年七月", "88年"),
        // 汉和帝（在位：88年", "105年）
        array("永元", "hide", "tag-time", "中国", "89年", "105年三月"),
        array("元兴", "hide", "tag-time", "中国", "105年四月", "105年十二月"),
        // 汉殇帝（在位：106年）
        array("延平", "hide", "tag-time", "中国", "106年", "106年"),
        // 汉安帝（在位：106年", "125年）
        array("永初", "hide", "tag-time", "中国", "107年", "113年"),
        array("元初", "hide", "tag-time", "中国", "114年", "120年四月"),
        array("永宁", "hide", "tag-time", "中国", "120年四月", "121年六月"),
        array("建光", "hide", "tag-time", "中国", "121年七月", "122年三月"),
        array("延光", "hide", "tag-time", "中国", "122年三月", "125年"),
        // 汉顺帝（在位：125年", "144年）
        array("永建", "hide", "tag-time", "中国", "126年", "132年三月"),
        array("阳嘉", "hide", "tag-time", "中国", "132年三月", "135年"),
        array("永和", "hide", "tag-time", "中国", "136年", "141年"),
        array("汉安", "hide", "tag-time", "中国", "142年", "144年四月"),
        array("建康", "hide", "tag-time", "中国", "144年四月", "144年十二月"),
        // 汉冲帝（在位：144年", "145年）
        array("永憙", "hide", "tag-time", "中国", "145年", "145年"),
        // 汉质帝（在位：145年", "146年）
        array("本初", "hide", "tag-time", "中国", "146年", "146年"),
        // 汉桓帝（在位：147年", "167年）"
        array("建和", "hide", "tag-time", "中国", "147年", "149年"),
        array("和平", "hide", "tag-time", "中国", "150年"),
        array("元嘉", "hide", "tag-time", "中国", "151年", "153年五月"),
        array("永兴", "hide", "tag-time", "中国", "153年五月", "154年"),
        array("永寿", "hide", "tag-time", "中国", "155年", "158年六月"),
        array("延熹", "hide", "tag-time", "中国", "158年六月", "167年六月"),
        array("永康", "hide", "tag-time", "中国", "167年六月", "167年十二月"),
        // 汉灵帝（在位：168年", "189年）
        array("建宁", "hide", "tag-time", "中国", "168年", "172年五月"),
        array("熹平", "hide", "tag-time", "中国", "172年五月", "178年三月"),
        array("光和", "hide", "tag-time", "中国", "178年三月", "184年"),
        array("中平", "hide", "tag-time", "中国", "184年十二月", "189年三月"),
        // 汉少帝（在位：189年四月", "189年九月）
        array("光熹", "hide", "tag-time", "中国", "189年四月", "189年八月"),
        array("昭宁", "hide", "tag-time", "中国", "189年八月", "189年九月"),
        // 汉献帝（在位：189年", "220年）
        array("永汉", "hide", "tag-time", "中国", "189年九月", "189年十二月"),
        array("中平", "hide", "tag-time", "中国", "189年十二月", "189年十二月"),
        array("初平", "hide", "tag-time", "中国", "190年", "193年"),
        array("兴平", "hide", "tag-time", "中国", "194年", "195年"),
        array("建安", "hide", "tag-time", "中国", "196年", "220年二月"),
        array("延康", "hide", "tag-time", "中国", "220年三月", "220年十月"),
        
        array("三国", "normal", "tag-time", "中国", "220", "280"),
        
        array("曹魏", "hide", "tag-time", "中国", "220年12月10日", "266年2月4日"),
        // 曹丕（在位：220年", "226年）
        array("黄初", "hide", "tag-time", "中国", "220年十月", "226年"),
        // 曹睿（在位：226年", "239年）
        array("太和", "hide", "tag-time", "中国", "227年", "233年一月"),
        array("青龙", "hide", "tag-time", "中国", "233年二月", "237年二月"),
        array("景初", "hide", "tag-time", "中国", "237年三月", "239年"),
        // 曹芳（在位：239年", "254年）
        array("正始", "hide", "tag-time", "中国", "240年", "249年四月"),
        array("嘉平", "hide", "tag-time", "中国", "249年四月", "254年十月"),
        // 曹髦（在位：254年", "260年）
        array("正元", "hide", "tag-time", "中国", "254年十月", "256年五月"),
        array("甘露", "hide", "tag-time", "中国", "256年六月", "260年五月"),
        // 曹奂（在位：260年", "265年）
        array("景元", "hide", "tag-time", "中国", "260年六月", "264年五月"),
        array("咸熙", "hide", "tag-time", "中国", "264年五月", "265年"),
        
        // 公孙渊
        array("绍汉", "hide", "tag-time", "中国", "237年七月", "238年八月"),
        
        array("蜀汉", "hide", "tag-time", "中国", "222年5月23日", "280年5月1日"),
        // 刘备（在位：221年", "223年）
        array("章武", "hide", "tag-time", "中国", "221年四月", "223年四月"),
        // 刘禅（在位：223年", "263年）
        array("建兴", "hide", "tag-time", "中国", "223年五月", "237年"),
        array("延熙", "hide", "tag-time", "中国", "238年", "257年"),
        array("景耀", "hide", "tag-time", "中国", "258年", "263年七月"),
        array("炎兴", "hide", "tag-time", "中国", "263年八月", "263年十一月"),
        
        array("孙吴", "hide", "tag-time", "中国", "222年5月23日", "280年5月1日"),
        // 孙权（在位：229年", "252年）
        array("黄武", "hide", "tag-time", "中国", "222年十月", "229年四月"),
        array("黄龙", "hide", "tag-time", "中国", "229年四月", "231年"),
        array("嘉禾", "hide", "tag-time", "中国", "232年", "238年八月"),
        array("赤乌", "hide", "tag-time", "中国", "238年八月", "251年四月"),
        array("太元", "hide", "tag-time", "中国", "251年五月", "252年一月"),
        array("神凤", "hide", "tag-time", "中国", "252年二月", "252年四月"),
        // 孙亮（在位：252年", "258年）
        array("建兴", "hide", "tag-time", "中国", "252年四月", "253年"),
        array("五凤", "hide", "tag-time", "中国", "254年", "256年十月"),
        array("太平", "hide", "tag-time", "中国", "256年十月", "258年十月"),
        // "孙休（在位：258年", "264年）"
        array("永安", "hide", "tag-time", "中国", "258年十月", "264年六月"),
        // "孙皓（在位：264年", "280年）"
        array("元兴", "hide", "tag-time", "中国", "264年七月", "265年三月"),
        array("甘露", "hide", "tag-time", "中国", "265年四月", "266年七月"),
        array("宝鼎", "hide", "tag-time", "中国", "266年八月", "269年九月"),
        array("建衡", "hide", "tag-time", "中国", "269年十月", "271年"),
        array("凤凰", "hide", "tag-time", "中国", "272年", "274年"),
        array("天册", "hide", "tag-time", "中国", "275年", "276年六月"),
        array("天玺", "hide", "tag-time", "中国", "276年七月", "276年十二月"),
        array("天纪", "hide", "tag-time", "中国", "277年", "280年三月"),
        
        array("西晋", "normal", "tag-time", "中国", "280", "316"),
        // "晋武帝（在位：266年", "290年）"
        array("泰始", "hide", "tag-time", "中国", "265年十二月", "274年"),
        array("咸宁", "hide", "tag-time", "中国", "275年", "280年四月"),
        array("太康", "hide", "tag-time", "中国", "280年四月", "289年"),
        array("太熙", "hide", "tag-time", "中国", "290年一月", "290年四月"),
        // "晋惠帝（在位：290年", "306年）"
        array("永熙", "hide", "tag-time", "中国", "290年四月", "290年十二月"),
        array("永平", "hide", "tag-time", "中国", "291年一月", "291年三月"),
        array("元康", "hide", "tag-time", "中国", "291年三月", "299年"),
        array("永康", "hide", "tag-time", "中国", "300年", "301年四月"),
        array("永宁", "hide", "tag-time", "中国", "301年四月", "302年十一月"),
        array("太安", "hide", "tag-time", "中国", "302年十二月", "303年"),
        array("永安", "hide", "tag-time", "中国", "304年一月", "304年十一月"),
        array("建武", "hide", "tag-time", "中国", "304年七月", "304年十一月"),
        array("永兴", "hide", "tag-time", "中国", "304年十二月", "306年六月"),
        array("光熙", "hide", "tag-time", "中国", "306年六月", "306年十二月"),
        // "晋怀帝（在位：306年", "313年）"
        array("永嘉", "hide", "tag-time", "中国", "307年", "313年四月"),
        // "晋愍帝（在位：313年", "316年）"
        array("建兴", "hide", "tag-time", "中国", "313年四月", "317年三月"),
        
        
        array("东晋", "normal", "tag-time", "中国", "316", "420"),
        // 晋元帝（在位：318年", "322年）"
        array("建武", "hide", "tag-time", "中国", "317年三月", "318年三月"),
        array("大兴", "hide", "tag-time", "中国", "318年三月", "321年"),
        array("永昌", "hide", "tag-time", "中国", "322年", "323年二月"),
        // 晋明帝（在位：322年", "325年）"
        array("太宁", "hide", "tag-time", "中国", "323年三月", "326年一月"),
        // 晋成帝（在位：325年", "342年）"
        array("咸和", "hide", "tag-time", "中国", "326年二月", "334年"),
        array("咸康", "hide", "tag-time", "中国", "335年", "342年"),
        // 晋康帝（在位：342年", "344年）"
        array("建元", "hide", "tag-time", "中国", "343年", "344年"),
        // 晋穆帝（在位：344年", "361年）"
        array("永和", "hide", "tag-time", "中国", "345年", "356年"),
        array("升平", "hide", "tag-time", "中国", "357年", "361年"),
        // 晋哀帝（在位：361年", "365年）"
        array("隆和", "hide", "tag-time", "中国", "362年", "363年二月"),
        array("兴宁", "hide", "tag-time", "中国", "363年二月", "365年"),
        // 晋废帝（在位：365年", "371年）"
        array("太和", "hide", "tag-time", "中国", "366年", "371年十一月"),
        // 晋简文帝（在位：371年", "372年）"
        array("咸安", "hide", "tag-time", "中国", "371年十一月", "372年"),
        // 晋孝武帝（在位：372年", "396年）"
        array("宁康", "hide", "tag-time", "中国", "373年", "375年"),
        array("太元", "hide", "tag-time", "中国", "376年", "396年"),
        // 晋安帝（在位：397年", "418年）"
        array("隆安", "hide", "tag-time", "中国", "397年", "401年"),
        array("元兴", "hide", "tag-time", "中国", "402年", "404年"),
        array("大亨", "hide", "tag-time", "中国", "402年三月", "402年十二月"),
        array("义熙", "hide", "tag-time", "中国", "405年", "418年"),
        // 晋恭帝（在位：419年", "420年）"
        array("元熙", "hide", "tag-time", "中国", "419年", "420年六月"),
        
        
        array("前赵", "hide", "tag-time", "中国", "304", "329"),
        // 刘渊（在位：304年", "310年）"
        array("元熙", "hide", "tag-time", "中国", "304年十月", "308年九月"),
        array("永凤", "hide", "tag-time", "中国", "308年十月", "309年四月"),
        array("河瑞", "hide", "tag-time", "中国", "309年五月", "310年六月"),
        // 刘聪（在位：310年", "318年）"
        array("光兴", "hide", "tag-time", "中国", "310年七月", "311年五月"),
        array("嘉平", "hide", "tag-time", "中国", "311年六月", "315年二月"),
        array("建元", "hide", "tag-time", "中国", "315年三月", "316年十月"),
        array("麟嘉", "hide", "tag-time", "中国", "316年十一月", "318年六月"),
        // 刘粲（在位：318年）"
        array("汉昌", "hide", "tag-time", "中国", "318年七月", "318年九月"),
        // 刘曜（在位：318年", "328年）"
        array("光初", "hide", "tag-time", "中国", "318年十月", "329年八月"),
        
        
        array("成汉", "hide", "tag-time", "中国", "303", "349"),
        // 李特（在位：303年）"
        array("建初", "hide", "tag-time", "中国", "303年", "304年九月"),
        // 李雄（在位：304年", "334年）"
        array("建兴", "hide", "tag-time", "中国", "304年十月", "306年六月"),
        array("晏平", "hide", "tag-time", "中国", "306年六月", "310年"),
        array("玉衡", "hide", "tag-time", "中国", "311年", "334年"),
        // 李期（在位：334年", "338年）"
        array("玉恒", "hide", "tag-time", "中国", "335年", "338年三月"),
        // 李寿（在位：338年", "343年）"
        array("汉兴", "hide", "tag-time", "中国", "338年四月", "343年"),
        //李势（在位：343年", "347年）"
        array("太和", "hide", "tag-time", "中国", "344年", "346年九月"),
        array("嘉宁", "hide", "tag-time", "中国", "346年十月", "347年三月"),
        
        
        array("前凉", "hide", "tag-time", "中国", "320", "376"),
        // 张寔（在位：314年", "320年）使用西晋年号建兴
        // 张茂（在位：320年", "324年）使用西晋年号建兴
        // 张骏（在位：324年", "346年）使用西晋年号建兴
        // 张重华（在位：346年", "353年）使用西晋年号建兴
        // array("建兴", "hide", "tag-time", "中国", "317年", "320年五月"
        // array("建兴", "hide", "tag-time", "中国", "320年六月", "324年四月"
        // array("建兴", "hide", "tag-time", "中国", "324年五月", "346年四月"
        // array("建兴", "hide", "tag-time", "中国", "346年五月", "353年"
        // 张祚（在位：353年", "355年）"
        array("和平", "hide", "tag-time", "中国", "354年", "355年九月"),
        // 张玄靓（在位：355年", "363年）
        // 张天锡（在位：363年", "376年）
        // array("建兴", "hide", "tag-time", "中国", "355年九月", "361年十一月"
        array("升平", "hide", "tag-time", "中国", "361年十二月", "376年八月"),


        array("后赵", "hide", "tag-time", "中国", "319", "351"),
        // 石勒（在位：319年", "333年）"
        array("太和", "hide", "tag-time", "中国", "328年二月", "330年八月"),
        array("建平", "hide", "tag-time", "中国", "330年九月", "333年"),
        // 石弘（在位：333年", "334年）"
        array("延熙", "hide", "tag-time", "中国", "334年", "334年"),
        // 石虎（在位：334年", "349年）"
        array("建武", "hide", "tag-time", "中国", "335年", "348年"),
        array("太宁", "hide", "tag-time", "中国", "349年", "349年"),
        // 石鉴（在位：349年", "350年）"
        array("青龙", "hide", "tag-time", "中国", "350年一月", "350年二月"),
        // 石祗（在位：350年", "351年）"
        array("永宁", "hide", "tag-time", "中国", "350年", "351年"),
        
        
        array("冉魏", "hide", "tag-time", "中国", "350", "352"),
        // 冉闵（在位：350年", "352年）"
        array("永兴", "hide", "tag-time", "中国", "350年二月", "352年四月"),
        
        
        array("前燕", "hide", "tag-time", "中国", "337", "370"),
        // 慕容皝（在位：337年", "348年）
        // 慕容俊（在位：348年", "359年）"
        array("元玺", "hide", "tag-time", "中国", "352年十一月", "357年一月"),
        array("光寿", "hide", "tag-time", "中国", "357年二月", "359年"),
        // 慕容暐（在位：360年", "370年）"
        array("建熙", "hide", "tag-time", "中国", "360年", "370年十一月"),
        
        
        array("前秦", "hide", "tag-time", "中国", "350", "394"),
        // 苻健（在位：351年", "355年）"
        array("皇始", "hide", "tag-time", "中国", "351年", "355年五月"),
        // 苻生（在位：355年", "357年）"
        array("寿光", "hide", "tag-time", "中国", "355年六月", "357年五月"),
        // 苻坚（在位：357年", "385年）"
        array("永兴", "hide", "tag-time", "中国", "357年六月", "359年五月"),
        array("甘露", "hide", "tag-time", "中国", "359年六月", "364年"),
        array("建元", "hide", "tag-time", "中国", "365年", "385年七月"),
        // 苻丕（在位：385年", "386年）"
        array("太安", "hide", "tag-time", "中国", "385年八月", "386年十月"),
        // 苻登（在位：386年", "394年）"
        array("太初", "hide", "tag-time", "中国", "386年十一月", "394年六月"),
        // 苻崇（在位：394年）"
        array("延初", "hide", "tag-time", "中国", "394年七月", "394年十月"),
        
        
        array("后秦", "hide", "tag-time", "中国", "384", "417"),
        // 姚苌（在位：384年", "394年）
        array("白雀", "hide", "tag-time", "中国", "384年四月", "386年四月"),
        array("建初", "hide", "tag-time", "中国", "386年四月", "394年四月"),
        // 姚兴（在位：394年", "416年）
        array("皇初", "hide", "tag-time", "中国", "394年五月", "399年九月"),
        array("弘始", "hide", "tag-time", "中国", "399年九月", "416年一月"),
        // 姚泓（在位：416年", "417年）
        array("永和", "hide", "tag-time", "中国", "416年二月", "417年八月"),
        
        
        array("后燕", "hide", "tag-time", "中国", "384", "409"),
        // 慕容垂（在位：384年", "396年）"
        array("燕元", "hide", "tag-time", "中国", "384年一月", "386年二月"),
        array("建兴", "hide", "tag-time", "中国", "386年二月", "396年四月"),
        // 慕容宝（在位：396年", "398年）"
        array("永康", "hide", "tag-time", "中国", "396年四月", "398年四月"),
        // 慕容盛（在位：398年", "401年）"
        array("建平", "hide", "tag-time", "中国", "398年十月", "398年十二月"),
        array("长乐", "hide", "tag-time", "中国", "399年一月", "401年七月"),
        // 慕容熙（在位：401年", "407年）"
        array("光始", "hide", "tag-time", "中国", "401年八月", "406年十二月"),
        array("建始", "hide", "tag-time", "中国", "407年一月", "407年七月"),
        
        
        array("翟魏", "hide", "tag-time", "中国", "388", "392"),
        // 翟辽
        array("建光", "hide", "tag-time", "中国", "388年二月", "391年十月"),
        array("定鼎", "hide", "tag-time", "中国", "391年十月", "392年六月"),
        
        
        array("西燕", "hide", "tag-time", "中国", "384", "394"),
        // 慕容泓
        array("燕兴", "hide", "tag-time", "中国", "384年四月", "384年十二月"),
        // 慕容冲（在位：385年", "386年）"
        array("更始", "hide", "tag-time", "中国", "385年正月", "386年二月"),
        // 段随（在位：386年）"
        array("昌平", "hide", "tag-time", "中国", "386年二月", "386年三月"),
        // 慕容顗（在位：386年）"
        array("建明", "hide", "tag-time", "中国", "386年三月", "386年三月"),
        // 慕容瑶（在位：386年）"
        array("建平", "hide", "tag-time", "中国", "386年三月", "386年三月"),
        // 慕容忠（在位：386年）"
        array("建武", "hide", "tag-time", "中国", "386年三月", "386年九月"),
        // 慕容永（在位：386年", "394年）"
        array("中兴", "hide", "tag-time", "中国", "386年十月", "394年八月"),
        
        
        array("西秦", "hide", "tag-time", "中国", "385", "431"),
        // 乞伏国仁（在位：385年", "388年）"
        array("建义", "hide", "tag-time", "中国", "385年九月", "388年六月"),
        // 乞伏乾归（在位：388年", "400年；409年", "412年）"
        array("太初", "hide", "tag-time", "中国", "388年六月", "400年七月"),
        array("更始", "hide", "tag-time", "中国", "409年七月", "412年八月"),
        // 乞伏炽磐（在位：412年", "428年）
        array("永康", "hide", "tag-time", "中国", "412年八月", "419年"),
        array("建弘", "hide", "tag-time", "中国", "420年", "428年五月"),
        // 乞伏暮末（在位：428年", "431年）"
        array("永弘", "hide", "tag-time", "中国", "428年五月", "431年一月"),
        
        
        array("后凉", "hide", "tag-time", "中国", "386", "403"),
        // 吕光（在位：386年", "399年）"
        array("太安", "hide", "tag-time", "中国", "386年十月", "389年一月"),
        array("麟嘉", "hide", "tag-time", "中国", "389年二月", "396年六月"),
        array("龙飞", "hide", "tag-time", "中国", "396年六月", "399年"),
        // 吕纂（在位：399年", "401年）"
        array("咸宁", "hide", "tag-time", "中国", "399年十二月", "401年一月"),
        // 吕隆（在位：401年", "403年）"
        array("神鼎", "hide", "tag-time", "中国", "401年二月", "403年八月"),
        
        
        array("南凉", "hide", "tag-time", "中国", "397", "414"),
        // 秃发乌孤（在位：397年", "399年）"
        array("太初", "hide", "tag-time", "中国", "397年", "399年"),
        // 秃发利鹿孤（在位：399年", "402年）"
        array("建和", "hide", "tag-time", "中国", "400年", "402年三月"),
        // 秃发傉檀（在位：402年", "414年）"
        array("弘昌", "hide", "tag-time", "中国", "402年三月", "404年二月"),
        array("嘉平", "hide", "tag-time", "中国", "408年十一月", "414年七月"),
        
        
        array("南燕", "hide", "tag-time", "中国", "384", "394"),
        // 慕容德（在位：398年", "405年）"
        "燕平", "hide", "tag-time", "中国", "398年", "399年"
        "建平", "hide", "tag-time", "中国", "400年", "405年九月"
        // 慕容超（在位：405年", "410年）"
        "太上", "hide", "tag-time", "中国", "405年九月", "410年二月"

        // 西凉
        // 李皓（在位：400年", "417年）"
        "庚子", "hide", "tag-time", "中国", "400年十一月", "404年"
        "建初", "hide", "tag-time", "中国", "405年", "417年二月"
        // 李歆（在位：417年", "420年）"
        "嘉兴", "hide", "tag-time", "中国", "417年二月", "420年七月"
        // 李恂（在位：420年", "421年）"
        "永建", "hide", "tag-time", "中国", "420年十月", "421年三月"
        
        // 夏
        // 赫连勃勃（在位：407年", "425年）"
        "龙升", "hide", "tag-time", "中国", "407年六月", "413年二月"
        "凤翔", "hide", "tag-time", "中国", "413年三月", "418年十月"
        "昌武", "hide", "tag-time", "中国", "418年十一月", "419年正月"
        "真兴", "hide", "tag-time", "中国", "419年二月", "425年七月"
        // 赫连昌（在位：425年", "428年）"
        "承光", "hide", "tag-time", "中国", "425年八月", "428年二月"
        // 赫连定（在位：428年", "431年）"
        "胜光", "hide", "tag-time", "中国", "428年二月", "431年六月"
        
        // 北燕
        // 慕容云（在位：407年", "409年）"
        "正始", "hide", "tag-time", "中国", "407年七月", "409年十月"
        // 冯跋（在位：409年", "430年）"
        "太平", "hide", "tag-time", "中国", "409年十月", "430年"
        // 冯弘（在位：430年", "436年）"
        "太兴", "hide", "tag-time", "中国", "431年", "436年五月"
        
        // 北凉
        // 段业（在位：397年", "399年）"
        "神玺", "hide", "tag-time", "中国", "397年五月", "399年正月"
        "天玺", "hide", "tag-time", "中国", "399年二月", "401年五月"
        // 沮渠蒙逊（在位：401年", "433年）"
        "永安", "hide", "tag-time", "中国", "401年六月", "412年十月"
        "玄始", "hide", "tag-time", "中国", "412年十一月", "428年"
        "承玄", "hide", "tag-time", "中国", "428年六月", "431年"
        "义和", "hide", "tag-time", "中国", "431年六月", "433年四月"
        // 沮渠牧犍（在位：433年", "439年）"
        "承和", "hide", "tag-time", "中国", "433年四月", "439年九月"
        // 沮渠无讳
        "承平", "hide", "tag-time", "中国", "443年", "460年"
        
        array("南北朝", "normal", "tag-time", "中国", "420", "589"),
        // 宋
        // 刘裕（在位：420年", "422年）"
        "永初", "hide", "tag-time", "中国", "420年六月", "422年"
        // 刘义符（在位：422年", "424年）"
        "景平", "hide", "tag-time", "中国", "423年", "424年八月"
        // 刘义隆（在位：424年", "453年）"
        "元嘉", "hide", "tag-time", "中国", "424年八月", "453年"
        // 刘骏（在位：453年", "464年）"
        "孝建", "hide", "tag-time", "中国", "454年", "456年"
        "大明", "hide", "tag-time", "中国", "457年", "464年"
        // 刘子业（在位：464年", "465年）"
        "永光", "hide", "tag-time", "中国", "465年正月", "八月"
        "景和", "hide", "tag-time", "中国", "465年八月", "十一月"
        // 刘彧（在位：465年", "472年）"
        "泰始", "hide", "tag-time", "中国", "465年十二月", "471年"
        "泰豫", "hide", "tag-time", "中国", "472年", "472年"
        // 刘昱（在位：472年", "477年）"
        "元徽", "hide", "tag-time", "中国", "473年", "477年七月"
        // 刘准（在位：477年", "479年）"
        "升明", "hide", "tag-time", "中国", "477年七月", "479年四月"
        
        // 仇和
        "建义", "hide", "tag-time", "中国", "436年三月", "442年闰五月"
        
        // 齐
        // 萧道成（在位：479年", "482年）"
        "建元", "hide", "tag-time", "中国", "479年四月", "482年"
        // 萧赜（在位：482年", "493年）"
        "永明", "hide", "tag-time", "中国", "483年", "493年"
        // 萧昭业（在位：493年", "494年）"
        "隆昌", "hide", "tag-time", "中国", "494年正月", "七月"
        // 萧昭文（在位：494年）"
        "延兴", "hide", "tag-time", "中国", "494年七月", "十月"
        // 萧鸾（在位：494年", "498年）"
        "建武", "hide", "tag-time", "中国", "494年十月", "498年四月"
        "永泰", "hide", "tag-time", "中国", "498年四月", "498年十二月"
        // 萧宝卷（在位：498年", "501年）"
        "永元", "hide", "tag-time", "中国", "499年", "501年三月"
        // 萧宝融（在位：501年", "502年）"
        "中兴", "hide", "tag-time", "中国", "501年三月", "502年三月"
        
        // 梁
        // 萧衍（在位：502年", "549年）"
        "天监", "hide", "tag-time", "中国", "502年四月", "519年"
        "普通", "hide", "tag-time", "中国", "520年", "527年三月"
        "大通", "hide", "tag-time", "中国", "527年三月", "529年九月"
        "中大通", "hide", "tag-time", "中国", "529年十月", "534年"
        "大同", "hide", "tag-time", "中国", "535年", "546年四月"
        "中大同", "hide", "tag-time", "中国", "546年四月", "547年四月"
        "太清", "hide", "tag-time", "中国", "547年四月", "549年"
        // 萧纲（在位：549年", "551年）"
        "大宝", "hide", "tag-time", "中国", "550年", "551年"
        // 萧栋（在位：551年）"
        "天正", "hide", "tag-time", "中国", "551年八月", "十一月"
        // 萧绎（在位：552年", "554年）"
        "承圣", "hide", "tag-time", "中国", "552年十一月", "555年四月"
        // 萧渊明（在位：555年）"
        "天成", "hide", "tag-time", "中国", "555年五月", "十月"
        // 萧方智（在位：555年", "557年）"
        "绍泰", "hide", "tag-time", "中国", "555年十月", "556年八月"
        "太平", "hide", "tag-time", "中国", "556年九月", "557年十月"
        
        // 西梁年号
        // 萧察（在位：555年", "562年）"
        "大定", "hide", "tag-time", "中国", "555年", "562年正月"
        // 萧岿（在位：562年", "585年）"
        "天保", "hide", "tag-time", "中国", "562年二月", "585年"
        // 萧琮（在位：585年", "587年）"
        "广运", "hide", "tag-time", "中国", "586年", "587年九月"
        
        // 陈
        // 陈霸先（在位：557年", "559年）"
        "永定", "hide", "tag-time", "中国", "557年十月", "559年"
        // 陈蒨（在位：559年", "566年）"
        "天嘉", "hide", "tag-time", "中国", "560年正月", "566年二月"
        "天康", "hide", "tag-time", "中国", "566年二月", "十二月"
        // 陈伯宗（在位：566年", "568年）"
        "光大", "hide", "tag-time", "中国", "567年", "568年"
        // 陈顼（在位：568年", "582年）"
        "太建", "hide", "tag-time", "中国", "569年", "582年"
        // 陈叔宝（在位：582年", "589年）"
        "至德", "hide", "tag-time", "中国", "583年", "586年"
        "祯明", "hide", "tag-time", "中国", "587年", "589年正月"
        
        // 北魏
        // 代国年号
        // 拓跋什翼犍（在位：338年", "376年）"
        "建国", "hide", "tag-time", "中国", "338年十一月", "376年"
        // 拓跋圭（在位：386年", "409年）"
        "登国", "hide", "tag-time", "中国", "386年", "396年六月"
        "皇始", "hide", "tag-time", "中国", "396年七月", "398年"
        "天兴", "hide", "tag-time", "中国", "398年十二月", "404年十月"
        "天赐", "hide", "tag-time", "中国", "404年十月", "409年十月"
        // 拓跋嗣（在位：409年", "423年）"
        "永兴", "hide", "tag-time", "中国", "409年闰十月", "413年"
        "神瑞", "hide", "tag-time", "中国", "414年", "416年四月"
        "泰常", "hide", "tag-time", "中国", "416年四月", "423年"
        // 拓跋焘（在位：423年", " 452年）"
        "始光", "hide", "tag-time", "中国", "424年", "428年正月"
        "神䴥", "hide", "tag-time", "中国", "428年二月", "431年"
        "延和", "hide", "tag-time", "中国", "432年", "435年正月"
        "太延", "hide", "tag-time", "中国", "435年正月", "440年六月"
        "太平真君", "hide", "tag-time", "中国", "440年六月", "451年六月"
        "正平", "hide", "tag-time", "中国", "451年六月", "452年二月"
        // 拓跋余（在位：452年）"
        "承平", "hide", "tag-time", "中国", "452年二月", "十月"
        // 拓跋濬（在位：452年", "465年）"
        "兴安", "hide", "tag-time", "中国", "452年十月", "454年七月"
        "兴光", "hide", "tag-time", "中国", "454年七月", "455年六月"
        "太安", "hide", "tag-time", "中国", "455年六月", "459年"
        "和平", "hide", "tag-time", "中国", "460年", "465年"
        // 拓跋弘（在位：465年", "471年）"
        "天安", "hide", "tag-time", "中国", "466年", "467年八月"
        "皇兴", "hide", "tag-time", "中国", "467年八月", "471年八月"
        // 元宏（在位：471年", "499年）"
        "延兴", "hide", "tag-time", "中国", "471年八月", "476年六月"
        "承明", "hide", "tag-time", "中国", "476年六月", "十二月"
        "太和", "hide", "tag-time", "中国", "477年", "499年"
        // 元恪（在位：499年", "515年）"
        "景明", "hide", "tag-time", "中国", "500年", "504年正月"
        "正始", "hide", "tag-time", "中国", "504年正月", "508年八月"
        "永平", "hide", "tag-time", "中国", "508年八月", "512年四月"
        "延昌", "hide", "tag-time", "中国", "512年四月", "515年"
        // 元诩（在位：515年", "528年）"
        "熙平", "hide", "tag-time", "中国", "516年", "518年二月"
        "神龟", "hide", "tag-time", "中国", "518年二月", "520年七月"
        "正光", "hide", "tag-time", "中国", "520年七月", "525年六月"
        "孝昌", "hide", "tag-time", "中国", "525年六月", "528年正月"
        "武泰", "hide", "tag-time", "中国", "528年正月", "四月"
        // 元子攸（在位：528年", "530年）"
        "建义", "hide", "tag-time", "中国", "528年四月", "九月"
        "永安", "hide", "tag-time", "中国", "528年九月", "530年十月"
        // 元晔（在位：530年", "531年）"
        "建明", "hide", "tag-time", "中国", "530年十月", "531年二月"
        // 元恭（在位：531年）"
        "普泰", "hide", "tag-time", "中国", "531年二月", "十月"
        // 元朗（在位：531年", "532年）"
        "中兴", "hide", "tag-time", "中国", "531年十月", "532年四月"
        // 元修（在位：532年", "534年）"
        "太昌", "hide", "tag-time", "中国", "532年四月", "十二月"
        "永兴", "hide", "tag-time", "中国", "532年十二月"
        "永熙", "hide", "tag-time", "中国", "532年十二月", "534年十二月"
        
        // 东魏
        // 元善见（在位：534年", "550年）"
        "天平", "hide", "tag-time", "中国", "534年十月", "537年"
        "元象", "hide", "tag-time", "中国", "538年", "539年十一月"
        "兴和", "hide", "tag-time", "中国", "539年十一月", "542年"
        "武定", "hide", "tag-time", "中国", "543年", "550年五月"
        
        // 西魏
        // 元宝炬（在位：535年", "551年）"
        "大统", "hide", "tag-time", "中国", "535年", "551年"

        // 北齐
        // 高洋（在位：550年", "559年）"
        "天保", "hide", "tag-time", "中国", "550年五月", "559年"
        // 高殷（在位：559年", "560年）"
        "乾明", "hide", "tag-time", "中国", "560年正月", "八月"
        // 高演（在位：560年", "561年）"
        "皇建", "hide", "tag-time", "中国", "560年八月", "561年十一月"
        // 高湛（在位：561年", "565年）"
        "太宁", "hide", "tag-time", "中国", "561年十一月", "562年四月"
        "河清", "hide", "tag-time", "中国", "562年四月", "565年四月"
        // 高纬（在位：565年", "577年）"
        "天统", "hide", "tag-time", "中国", "565年四月", "569年"
        "武平", "hide", "tag-time", "中国", "570年", "576年"
        "隆化", "hide", "tag-time", "中国", "576年十二月"
        // 高延宗（在位：576年）"
        "德昌", "hide", "tag-time", "中国", "576年十二月"
        // 高恒（在位：577年）"
        "承光", "hide", "tag-time", "中国", "577年正月", "三月"

        // 北周
        // 宇文毓（在位：557年", "560年）"
        "武成", "hide", "tag-time", "中国", "559年八月", "560年"
        // 宇文邕（在位：560年", "578年）"
        "保定", "hide", "tag-time", "中国", "561年", "565年"
        "天和", "hide", "tag-time", "中国", "566年", "572年三月"
        "建德", "hide", "tag-time", "中国", "572年三月", "578年三月"
        "宣政", "hide", "tag-time", "中国", "578年三月", "十二月"
        // 宇文赟（在位：578年", "579年）"
        "大成", "hide", "tag-time", "中国", "579年正月", "二月"
        // 宇文衍（在位：579年", "581年）"
        "大象", "hide", "tag-time", "中国", "579年二月", "580年"
        "大定", "hide", "tag-time", "中国", "581年正月", "二月"

        // 柔然. 柔然可考年号只有57年。
        // 予成（在位：464年", "485年）"
        "永康", "hide", "tag-time", "中国", "464年", "484年"
        // 豆仑（在位：485年", "492年）"
        "太平", "hide", "tag-time", "中国", "485年", "491年"
        // 那盖（在位：492年", "506年）"
        "太安", "hide", "tag-time", "中国", "492年", "505年"
        // 伏图（在位：506年", "508年）"
        "始平", "hide", "tag-time", "中国", "506年", "507年"
        // 丑奴（在位：508年", "520年）"
        "建昌", "hide", "tag-time", "中国", "508年", "520年"
        
        // 高昌
        // 阚首归（在位：478年", "488年）"
        "建初", "hide", "tag-time", "中国", "489年", "491年"
        // 曲嘉（在位：501年", "525年）"
        "承平", "hide", "tag-time", "中国", "502年", "510年"
        "义熙", "hide", "tag-time", "中国", "511年", "523年"
        // 曲光（在位：525年", "530年）"
        "甘露", "hide", "tag-time", "中国", "525年", "530年"
        // 曲坚（在位：531年", "548年）"
        "章和", "hide", "tag-time", "中国", "531年", "548年"
        // 曲玄喜（在位：548年", "550年）"
        "永平", "hide", "tag-time", "中国", "549年", "550年"
        // 高昌和平王（在位：550年", "555年）"
        "和平", "hide", "tag-time", "中国", "551年", "554年"
        // 曲宝茂（在位：555年", "561年）"
        "建昌", "hide", "tag-time", "中国", "555年", "560年"
        // 曲乾固（在位：561年", "601年）"
        "延昌", "hide", "tag-time", "中国", "561年", "601年"
        // 曲伯雅（在位：601年", "623年）"
        "延和", "hide", "tag-time", "中国", "602年", "613年"
        "义和", "hide", "tag-time", "中国", "614年", "619年"
        "重光", "hide", "tag-time", "中国", "620年", "623年"
        // 曲文泰（在位：623年", "640年）"
        "延寿", "hide", "tag-time", "中国", "624年", "640年"

        
        array("隋朝", "normal", "tag-time", "中国", "581", "618"),
        // 隋文帝杨坚
        "开皇", "hide", "tag-time", "中国", "581", "600"
        "仁寿", "hide", "tag-time", "中国", "601", "604"
        // 隋炀帝杨广
        "大业", "hide", "tag-time", "中国", "605", "618"
        
        array("唐朝", "super", "tag-time", "中国", "618", "907"),
        // 唐高祖李渊（在位：618年", "626年）"
        "武德", "hide", "tag-time", "中国", "618年五月", "626年"
        // 唐太宗（在位：626年", "649年）"
        "贞观", "hide", "tag-time", "中国", "627年", "649年"
        // 唐高宗（在位：649年", "683年）"
        "永徽", "hide", "tag-time", "中国", "650年", "655年"
        "显庆", "hide", "tag-time", "中国", "656年", "661年二月"
        "龙朔", "hide", "tag-time", "中国", "661年三月", "663年"
        "麟德", "hide", "tag-time", "中国", "664年", "665年"
        "乾封", "hide", "tag-time", "中国", "666年正月", "668年二月"
        "总章", "hide", "tag-time", "中国", "668年二月", "670年二月"
        "咸亨", "hide", "tag-time", "中国", "670年三月", "674年八月"
        "上元", "hide", "tag-time", "中国", "674年八月", "676年十一月"
        "仪凤", "hide", "tag-time", "中国", "676年十一月", "679年六月"
        "调露", "hide", "tag-time", "中国", "679年六月", "680年八月"
        "永隆", "hide", "tag-time", "中国", "680年八月", "681年九月"
        "开耀", "hide", "tag-time", "中国", "681年九月", "682年二月"
        "永淳", "hide", "tag-time", "中国", "682年二月", "683年"
        "弘道", "hide", "tag-time", "中国", "683年十二月", "683年十二月"
        // 唐中宗（在位：683年", "684年）"
        "嗣圣", "hide", "tag-time", "中国", "684年正月", "二月"
        // 唐睿宗（在位：684年", "690年，684年九月后，武则天临朝称制）"
        "文明", "hide", "tag-time", "中国", "684年二月", "八月"
        "光宅", "hide", "tag-time", "中国", "684年九月", "十二月"
        "垂拱", "hide", "tag-time", "中国", "685年", "688年"
        "永昌", "hide", "tag-time", "中国", "689年正月", "十一月"
        "载初", "hide", "tag-time", "中国", "689年十一月", "690年八月"
        // 武周
        // 武则天（在位：683年", "705年）"
        "天授", "hide", "tag-time", "中国", "690年九月", "692年三月"
        "如意", "hide", "tag-time", "中国", "692年四月", "九月"
        "长寿", "hide", "tag-time", "中国", "692年九月", "694年五月"
        "延载", "hide", "tag-time", "中国", "694年五月", "十二月"
        "证圣", "hide", "tag-time", "中国", "695年正月", "九月"
        "天册万岁", "hide", "tag-time", "中国", "695年九月", "十一月"
        "万岁登封", "hide", "tag-time", "中国", "695年十二月", "696年三月"
        "万岁通天", "hide", "tag-time", "中国", "696年三月", "697年九月"
        "神功", "hide", "tag-time", "中国", "697年九月", "十二月"
        "圣历", "hide", "tag-time", "中国", "698年", "700年五月"
        "久视", "hide", "tag-time", "中国", "700年五月", "701年正月"
        "大足", "hide", "tag-time", "中国", "701年正月", "十月"
        "长安", "hide", "tag-time", "中国", "701年十月", "704年"
        "神龙", "hide", "tag-time", "中国", "705年", "707年九月"
        // 唐中宗（在位：705年", "710年）"
        "景龙", "hide", "tag-time", "中国", "707年九月", "710年六月"
        // 李重茂（在位：710年）"
        "唐隆", "hide", "tag-time", "中国", "710年六月", "七月"
        // 唐睿宗（在位：710年", "712年）"
        "景云", "hide", "tag-time", "中国", "710年七月", "712年正月"
        "太极", "hide", "tag-time", "中国", "712年正月", "四月"
        "延和", "hide", "tag-time", "中国", "712年五月", "八月"
        // 唐玄宗（在位：712年", "756年）"
        "先天", "hide", "tag-time", "中国", "712年八月", "713年十一月"
        "开元", "hide", "tag-time", "中国", "713年十二月", "741年"
        "天宝", "hide", "tag-time", "中国", "742年", "756年七月"
        // 唐肃宗（在位：756年", "762年）"
        "至德", "hide", "tag-time", "中国", "756年七月", "758年二月"
        "乾元", "hide", "tag-time", "中国", "758年二月", "760年闰四月"
        "上元", "hide", "tag-time", "中国", "760年闰四月", "761年九月"
        "宝应", "hide", "tag-time", "中国", "762年四月", "763年六月"
        // 唐代宗（在位：762年", "779年）"
        "广德", "hide", "tag-time", "中国", "763年七月", "764年"
        "永泰", "hide", "tag-time", "中国", "765年", "766年十一月"
        "大历", "hide", "tag-time", "中国", "766年十一月", "779年"
        // 唐德宗（在位：779年", " 805年）"
        "建中", "hide", "tag-time", "中国", "780年", "783年"
        "兴元", "hide", "tag-time", "中国", "784年"
        "贞元", "hide", "tag-time", "中国", "785年", "805年八月"
        // 唐顺宗（在位：805年）"
        "永贞", "hide", "tag-time", "中国", "805年八月", "十二月"
        // 唐宪宗（在位：805年", "820年）"
        "元和", "hide", "tag-time", "中国", "806年", "820年"
        // 唐穆宗（在位：820年", "824年）"
        "永新", "hide", "tag-time", "中国", "820年二月"
        "长庆", "hide", "tag-time", "中国", "821年", "824年"
        // 唐敬宗（在位：824年", "826年）"
        "宝历", "hide", "tag-time", "中国", "825年", "827年二月"
        // 唐文宗（在位：826年", "840年）"
        "大和", "hide", "tag-time", "中国", "827年二月", "835年"
        "开成", "hide", "tag-time", "中国", "836年", "840年"
        // 唐武宗（在位：840年", " 846年）"
        "会昌", "hide", "tag-time", "中国", "841年", "846年"
        // 唐宣宗（在位：846年", "859年）"
        "大中", "hide", "tag-time", "中国", "847年", "860年十月"
        // 唐懿宗（在位：859年", "873年）"
        "咸通", "hide", "tag-time", "中国", "860年十一月", "874年十一月"
        // 唐僖宗（在位：873年", "888年）"
        "乾符", "hide", "tag-time", "中国", "874年十一月", "879年"
        "广明", "hide", "tag-time", "中国", "880年", "881年七月"
        "中和", "hide", "tag-time", "中国", "881年七月", "885年三月"
        "光启", "hide", "tag-time", "中国", "885年三月", "888年正月"
        "文德", "hide", "tag-time", "中国", "888年二月", "十二月"
        // 唐昭宗（在位：888年", "904年）"
        "龙纪", "hide", "tag-time", "中国", "889年"
        "大顺", "hide", "tag-time", "中国", "890年", "891年"
        "景福", "hide", "tag-time", "中国", "892年", "893年"
        "乾宁", "hide", "tag-time", "中国", "894年", "898年八月"
        "光化", "hide", "tag-time", "中国", "898年八月", "901年三月"
        "天复", "hide", "tag-time", "中国", "901年四月", "904年闰四月"
        "天祐", "hide", "tag-time", "中国", "904年闰四月", "907年三月"
        
        
        array("五代十国", "normal", "tag-time", "中国", "907", "960"),
        // 后梁
        // 朱温（在位907年", "912年）"
        "开平", "hide", "tag-time", "中国", "907年四月", "911年4月"
        "乾化", "hide", "tag-time", "中国", "911年5月", "913年正月"
        // 朱友珪（在位912年", "913年）"
        "凤历", "hide", "tag-time", "中国", "913年正月", "二月"
        // 朱友贞（在位913年", "923年）
        "乾化", "hide", "tag-time", "中国", "913年二月", "915年十月"
        "贞明", "hide", "tag-time", "中国", "915年11月", "921年4月"
        "龙德", "hide", "tag-time", "中国", "921年五月", "923年十月"

        // 后唐
        // 庄宗李存勖
        "同光", "hide", "tag-time", "中国", "923", "926"
        // 明宗李嗣源
        "天成", "hide", "tag-time", "中国", "926", "930"
        "长兴", "hide", "tag-time", "中国", "930", "933"
        // 闵帝李从厚
        "应顺", "hide", "tag-time", "中国", "934", "934"
        // 末帝李从珂
        "清泰", "hide", "tag-time", "中国", "934", "936"
        
        // 后晋
        // 高祖石敬瑭
        "天福", "hide", "tag-time", "中国", "936", "942"
        // 出帝石重贵
        "天福", "hide", "tag-time", "中国", "942", "944"
        "开运", "hide", "tag-time", "中国", "944", "946"
        
        // 后汉 
        // 高祖刘知远, 隐帝刘承祐
        "天福", "hide", "tag-time", "中国", "947", "947"
        "乾祐", "hide", "tag-time", "中国", "948", "950"
        
        // 后周
        // 太祖郭威
        "广顺", "hide", "tag-time", "中国", "951", "953"
        "显德", "hide", "tag-time", "中国", "954", "954"
        // 世宗柴荣
        "显德", "hide", "tag-time", "中国", "954", "959"
        // 恭帝柴宗训
        "显德", "hide", "tag-time", "中国", "959", "960"
        
        // 南吴
        // 太祖杨行密-使用唐朝年号
        // "天复", "hide", "tag-time", "中国", "902", "904"
        // "天祐", "hide", "tag-time", "中国", "904", "905"
        // 烈祖杨渥
        // "天祐", "hide", "tag-time", "中国", "905", "908"
        // 高祖杨隆演
        // "天祐", "hide", "tag-time", "中国", "908", "919"
        "武义", "hide", "tag-time", "中国", "919", "920"
        // 睿帝杨溥
        "武义", "hide", "tag-time", "中国", "920", "921"
        "顺义", "hide", "tag-time", "中国", "921", "927"
        "乾贞", "hide", "tag-time", "中国", "927", "929"
        "大和", "hide", "tag-time", "中国", "929", "935"
        "天祚", "hide", "tag-time", "中国", "935", "937"
        
        // 南唐
        // 烈祖李昪
        "昇元", "hide", "tag-time", "中国", "937", "943"
        // 元宗李璟
        "保大", "hide", "tag-time", "中国", "943", "957"
        "中兴", "hide", "tag-time", "中国", "958年1月", "958年3月"
        "交泰", "hide", "tag-time", "中国", "958年3月", "958年5月"
        // 使用后周显德年号
        // "显德", "hide", "tag-time", "中国", "958年5月", "960"
        // 后使用宋年号
        // 后主李煜
        
        // 吴越
        // 武肃王钱缪
        "天宝", "hide", "tag-time", "中国", "908", "912"
        "宝大", "hide", "tag-time", "中国", "924", "925"
        "宝正", "hide", "tag-time", "中国", "926", "931"
        
        // 南楚
        
        // 闽国
        // 太祖王审知
        // 嗣主王延翰
        // 太宗王延钧
        "龙启", "hide", "tag-time", "中国", "933", "934"
        "永和", "hide", "tag-time", "中国", "935", "936"
        // 康宗王继鹏
        "通文", "hide", "tag-time", "中国", "936", "939"
        // 景宗王延曦
        "永隆", "hide", "tag-time", "中国", "939", "943"
        // 恭懿王王延政
        "天德", "hide", "tag-time", "中国", "943", "945"
        
        // 南汉
        // 高祖刘龑
        "乾亨", "hide", "tag-time", "中国", "917", "925年12月"
        "白龙", "hide", "tag-time", "中国", "925年12月", "928年3月"
        "大有", "hide", "tag-time", "中国", "928年3月", "942年4月"
        // 殇帝刘玢
        "光天", "hide", "tag-time", "中国", "942年4月", "943年3月"
        // 中宗刘晟
        "应乾", "hide", "tag-time", "中国", "943年3月", "943年11月"
        "乾和", "hide", "tag-time", "中国", "943年11月", "958年8月"
        // 后主刘鋹
        "大宝", "hide", "tag-time", "中国", "958年8月", "971"
        
        // 前蜀
        // 高祖王建
        "武成", "hide", "tag-time", "中国", "908", "910"
        "永平", "hide", "tag-time", "中国", "911", "915"
        "通正", "hide", "tag-time", "中国", "916", "916"
        "天汉", "hide", "tag-time", "中国", "917", "917"
        "光天", "hide", "tag-time", "中国", "918", "918"
        // 后主王衍
        "乾德", "hide", "tag-time", "中国", "919", "924"
        "咸康", "hide", "tag-time", "中国", "925", "925"
        
        // 后蜀
        // 高祖孟知祥
        "明德", "hide", "tag-time", "中国", "934", "937"
        // 后主孟昶
        "广政", "hide", "tag-time", "中国", "938", "965"
        
        // 荆南
        // 武信王高季兴
        // 文献王高从诲
        // 贞懿王高保融
        // 贞安王高保勖
        // 德仁王高继冲
        
        // 北汉
        // 世祖刘旻
        "乾祐", "hide", "tag-time", "中国", "951", "954"
        // 睿宗刘钧
        "乾祐", "hide", "tag-time", "中国", "954", "956"
        "天会", "hide", "tag-time", "中国", "957", "968"
        // 少主刘继恩
        // 英武帝刘继元
        "天会", "hide", "tag-time", "中国", "968", "973"
        "广运", "hide", "tag-time", "中国", "974", "979"
        
        array("宋朝", "super", "tag-time", "中国", "960", "1127"),
        
        // 辽朝
        // 太祖耶律阿保机
        "神册", "hide", "tag-time", "中国", "916", "922-12"
        "天赞", "hide", "tag-time", "中国", "922-12", "926-2"
        "天显", "hide", "tag-time", "中国", "926-2", "938-11"
        // 太宗耶律德光
        "会同", "hide", "tag-time", "中国", "938-11", "947-2"
        "大同", "hide", "tag-time", "中国", "947-2", "947-9"
        // 世宗耶律阮
        "天禄", "hide", "tag-time", "中国", "947-9", "951-9"
        // 穆宗耶律璟
        "应历", "hide", "tag-time", "中国", "951-9", "969-2"
        // 景宗耶律贤
        "保宁", "hide", "tag-time", "中国", "969-2", "979-11"
        "乾亨", "hide", "tag-time", "中国", "979-11", "982-9"
        // 圣宗耶律隆绪
        "乾亨", "hide", "tag-time", "中国", "982-9", "983-6"
        "统和", "hide", "tag-time", "中国", "983-6", "1012-11"
        "开泰", "hide", "tag-time", "中国", "1012-11", "1021-11"
        "太平", "hide", "tag-time", "中国", "1021-11", "1031-6"
        // 兴宗耶律宗真
        "景福", "hide", "tag-time", "中国", "1031-6", "1032-11"
        "重熙", "hide", "tag-time", "中国", "1032-11", "1055-8"
        // 道宗耶律洪基
        "清宁", "hide", "tag-time", "中国", "1055-8", "1064"
        "咸雍", "hide", "tag-time", "中国", "1065", "1074"
        "大康", "hide", "tag-time", "中国", "1075", "1084"
        "大安", "hide", "tag-time", "中国", "1085", "1094"
        "寿昌", "hide", "tag-time", "中国", "1095", "1101-2"
        // 天祚帝耶律延禧
        "乾统", "hide", "tag-time", "中国", "1101-2", "1110"
        "天庆", "hide", "tag-time", "中国", "1111", "1120"
        "保大", "hide", "tag-time", "中国", "1121", "1125"
        
        // 西辽
        // 德宗耶律大石
        "延庆", "hide", "tag-time", "中国", "1124", "1133"
        "康国", "hide", "tag-time", "中国", "1134", "1143"
        // 感天后萧塔不烟
        "咸清", "hide", "tag-time", "中国", "1144", "1150"
        // 仁宗耶律夷列
        "绍兴", "hide", "tag-time", "中国", "1151", "1163"
        // 承天后耶律普速完
        "崇福", "hide", "tag-time", "中国", "1164", "1177"
        // 末主耶律直鲁古
        "天禧", "hide", "tag-time", "中国", "1178", "1211"
        
        // 东辽
        // 耶律留哥
        "元统", "hide", "tag-time", "中国", "1213", "1216"
        
        // 西夏
        
        
        
        
        
        
        array("南宋", "normal", "tag-time", "中国", "1127", "1279"),
        array("元朝", "normal", "tag-time", "中国", "1279", "1368"),
        array("明朝", "normal", "tag-time", "中国", "1368", "1644"),
        array("清朝", "normal", "tag-time", "中国", "1644", "1912"),
        
        
        
        
        array("中华民国", "super", "tag-time", "中国", "1911", "1949"),
        array("中华人民共和国", "super", "tag-time", "中国", "1949", "2100"),
        array("台湾", "super"),
        array("香港", "super", "multe-key", "香港", "香港岛", "九龙", "新界", "特首", "行政长官", "立法会"),
    ),
    array
    (
        // 春秋战国列国
        array("鲁国"),
        array("齐国", "super", "multe-key", "齐国", "田齐"),
        array("晋国", "super", "multe-key", "晋国", "曲沃", "三家分晋"),
        array("秦国"),
        array("楚国"),
        array("燕国"),
        array("宋国"),
        array("卫国"),
        array("陈国"),
        array("蔡国"),
        array("曹国"),
        array("郑国"),
        array("吴国"),
        array("越国"),
        array("赵国"),
        array("魏国"),
        array("韩国", "normal", "key-time", "韩国", "-700", "200"),
        array("杞国", "hide"),
        array("中山国", "hide"), 
        array("蜀国", "hide"),
        array("巴国", "hide"),
        array("郕国", "hide"), 
        array("邓国", "hide"),
        array("虢国", "hide"),
        array("霍国", "hide"),
        array("滑国", "hide"),
        array("罗国", "hide"),
        array("莒国", "hide"),
        array("随国", "hide"),
        array("许国", "hide"),
        array("虞国", "hide"),
    ),
    array
    (
        // 少数民族和地方政权
        array("戎"),
        array("匈奴", "super", "multe-key", "匈奴","前赵", "汉赵", "胡夏", "北凉", "沮渠"),
        array("突厥"),
        array("氐", "super", "multe-key", "氐", "前秦", "前仇池", "后仇池", "武都国", "武兴国", 
            "阴平国", "后凉"),
        array("前秦", "super", "multe-key", "前秦", "王猛"),
        array("成汉"),
        array("羯", "normal", "multe-key", "羯", "后赵"),
        array("沙陀", "super", "multe-key", "沙陀", "后唐", "后晋", "后汉", "北汉"),
        
        array("东胡"),
        array("乌桓"),
        array("鲜卑", "super", "multe-key", "鲜卑", "前燕", "后燕", "西燕", "南燕", "北燕", "段部", 
                "慕容部", "宇文部", "拓跋部", "北魏", "东魏", "西魏", "乞伏部", "西秦", "秃发氏", 
                "南凉", "北周"),
        array("吐谷浑"),
        array("柔然"),
        array("辽朝", "super", "multe-key", "契丹", "辽朝", "大辽", "西辽", "后西辽"),
        array("蒙古", "super", "key-time", "蒙古", "室韦", "蒙兀", "忽里勒台", 
            "钦察汗国", "伊儿汗国", "木华黎", "速不台", "916", "1644"),
        array("鞑靼", "normal", "multe-key", "瓦剌", "鞑靼", "达延汗", "准噶尔", "喀尔喀", "兀良哈", 
            "鄂尔多斯", "土默特", "察哈尔", "喀剌沁", "喀尔喀", "厄鲁特", "俺答汗"),
        
        array("敕勒", "normal", "multe-key", "敕勒", "丁零", "赤勒", "铁勒", "高车", "翟魏", "翟斌", "翟辽"),
        array("回鹘"),
        array("维吾尔"),
        
        array("东北少数民族", "super", "multe-key", "肃慎", "挹娄", "勿吉", "靺鞨", "濊貊", "扶余", 
                "沃沮", "辽东郡", "乐浪郡", "玄菟郡", "真番郡"),
        array("高句丽", "super", "multe-key", "高句丽", "高句骊", "句丽", "句骊"),
        array("渤海国", "normal", "multe-key", "渤海国", "粟末靺鞨", "大祚荣", "靺鞨国"),
        array("古朝鲜", "super", "multe-key", "箕子朝鲜", "卫满朝鲜", "弁韩", "马韩", "辰韩", 
                "百济", "新罗", "高丽"),
        array("金国", "super", "multe-key", "女真", "女直", "会宁府", "大兴府", "猛安谋克"),
        array("满族", "normal", "multe-key", "满洲", "后金"),
        array("满洲国"),
        
        array("羌", "normal", "multe-key", "羌", "后秦", "邓至"),
        array("西夏", "normal", "multe-key", "党项", "西夏"),
        array("吐蕃"),
        
        array("西南少数民族", "normal", "multe-key", "苗人", "壮人", "黎人"),
        array("西域少数民族", "super", "multe-key", "西域", "月氏", "贵霜帝国", "乌孙", "鄯善", "楼兰", 
                "车师", "高昌", "疏勒", "于阗", "龟玆", "焉耆"),
        
        array("凉州", "normal", "multe-key", "前凉", "西凉"), 
        array("归义军"), 
        array("后梁"),
        array("后周"),
        array("北齐"),
        array("冉魏", "super", "multe-key", "冉魏", "冉闵", "杀胡令"),
        
        array("南方汉人割据", "normal", "multe-key", "谯蜀", "谯纵", "桓楚", "桓玄", "前蜀", 
                "后蜀", "荆南", "南楚", "南汉", "闽国"),
        array("吴越国"), 
        array("南唐"), 
        array("西梁"),
        
    ),
    array
    (
        // 官制
        // "共和"、"自治" 不宜做关键字。
        array("中央和地方关系", "super", "multe-key", "封建", "郡县", "集权", "分权", "分封", "行省", 
            "推恩令", "单一制", "联邦制"),
        array("宰相", "super", "key-time", "宰相", "丞相", "相权", "相国", "大学士", "三公", "九卿", 
            "中书省", "尚书省", "门下省", "尚书台", "司马", "司徒", "司空", "太傅", "太师", "太保", 
            "令尹", "仆射", "平章事", "参知政事", "首辅", "次辅", "内阁学士", "军机处", "-1500", "1911"),
        array("六部", "normal", "key-time", "六部", "尚书", "侍郎", "吏部", "户部", "礼部", "兵部", 
            "刑部", "工部", "台阁", "治粟内史", "太农令", "大司农", "司农寺", "运使司", "铁盐使司", 
            "度支使司", "国子监", "-1500", "1911"),
        array("司法监察", "normal", "key-time", "御史大夫", "廷尉", "御史台", "大理寺", "都察院", "审刑院", 
            "监察", "司法", "-1500", "1911"),
        // "宗正" 不宜为关键字。
        array("大内", "normal", "key-time", "大内", "奉常", "郎中令", "少府", "卫尉",  "太仆", 
            "太常", "太监", "宫女", "中大夫令", "光禄勋", "太府", "太常寺", "光禄寺", "卫尉寺", 
            "太仆寺", "宗人府", "内务府", "詹事府", "-1500", "1911"),
        array("地方官", "normal", "key-time", "诸候", "郡守", "县令", "县长", "刺史", "州牧", "通判", "行省", 
            "达鲁花赤", "里长", "布政司", "布政使", "按察司", "总督", "巡抚", "镇守", "-1500", "1911"),
        array("边臣", "normal", "key-time", "典客", "大行令", "大鸿胪", "鸿胪寺", "西域都护", "宣慰司", 
            "土司", "理藩院", "-1500", "1911"),
        array("世卿世禄制", "normal", "key-time", "世卿世禄", "世袭", "世职", "世官", "-1500", "1911"),
        array("九品中正制", "normal", "key-time", "九品中正", "察举", "征辟", "孝廉", "-1500", "1911"),
        // "明经"、"金榜"不宜为关键字。
        array("科举制", "super", "key-time", "科举", "分科取士", "县试", "童生", "院试", "生员", 
            "秀才", "茂才", "乡试", "解试", "秋闱", "桂榜", "举人", "解元", "会试", "省试", "春闱", 
            "贡士", "会元", "殿试", "进士", "状元", "榜眼", "探花", "投牒自试", "常科", "制科", 
            "帖经", "墨义", "进士及第", "进士出身", "同进士出身", "琼林宴", "糊名", "誊录", 
            "贡院", "科场", "监生", "贡监", "荫监", "举监", "例监", "鹿鸣宴", "座师", "传胪", 
            "连中三元", "庶吉士", "翰林院", "八股文", "-1500", "1911"),
        
        array("太子", "super", "multe-key", "太子", "废立", "立太子", "废太子", "废储", 
            "册封", "继承大统", "皇储", "立储"),
        array("权臣", "normal", "multe-key", "权臣", "篡", "权相", "自立", "弑", "九锡", "黄袍加身"),
        array("太监", "normal", "multe-key", "太监", "阉人", "寺人", "内监", "锦衣卫", "内书堂", "敬事房", 
            "东厂", "西厂", "内厂", "内务府"),
        array("外戚宗室", "normal", "multe-key", "外戚", "国舅", "戚畹", "外家", "后宫干政",
            "临朝", "宗室", "嫔妃", "贵妃", "皇后", "太后", "太皇太后", "老佛爷", "垂帘听政"),
        // "部曲"不宜为关键字。
        array("奴隶", "normal", "multe-key", "奴隶", "奴婢", "家生子", "隶臣", "隶妾"),
        
    ),
    array
    (
        // 政治问题
        array("改革", "super", "multe-key", "改革", "商鞅变法", "王安石变法", "庆历新政", "张居正变法", 
                "洋务运动", "百日维新", "戊戌变法", "清末新政", "制宪国民大会", "改革开放", 
                "台湾十大建设", "台湾民主转型"),
        
        array("太平天国"),
        array("义和团"),
        
        array("村民自治", "super", "multe-key", "村民", "农民", "村民选举", "村民直选", "村长", "村支书"),
        array("土地制度", "super", "multe-key", "土地制度", "平分土地",  "均分土地",  "分配土地", "土地面积", 
                "井田制", "初税亩", "摊丁入亩", "一条鞭法", "两税法", "租庸调", "均田", "土改", 
                "土地改革", "土地承包", "土地权", "圈地", "土地法", "土地问题", "土地征收", "地权"),
        array("水利"),
        array("拆迁", "normal", "multe-key", "拆迁", "强拆", "血拆", "土地征收"),

        array("民主", "super", "multe-key", "民主", "独裁", "选举", "专制"),
        array("宪政", "normal", "multe-key", "宪政", "宪政", "宪法", "制宪"),
        array("言论自由", "super", "multe-key", "言论自由", "新闻自由"),
        array("司法独立", "super", "multe-key", "司法独立", "司法改革", "律师"),
        array("食品安全", "super", "multe-key", "食品", "公共卫生", "毒奶粉", "地沟油", "毒大米", 
            "农药残留", "重金属", "致癌物", "有机农业", "转基因", "食材", "防腐剂", "速冻", "洗涤剂", 
            "消毒剂", "消毒卫生", "卫生标准", "添加剂"),
        array("权贵资本", "normal", "multe-key", "权贵资本", "红二代", "太子党", "反腐", "贪污", 
            "腐败", "腐化", "受贿", "行贿", "裙带", "双规"),
        array("财政税收", "super", "multe-key", "财政", "税收", "社会保障", "社保"),
        array("私人资本", "super", "multe-key", "私人资本", "民企", "私企", "私营企业", "私有企业"),
        array("公有制", "super", "multe-key", "公有制", "国企", "国有企业", "国家所有制", "集体所有制"),
        array("公民社会", "normal", "multe-key", "公民社会", "公益", "非营利", "NPO", "慈善", "群体事件", 
            "群体性事件"),
        array("户口"),
        array("法律犯罪", "normal", "multe-key", "法律", "犯罪"),
    ),
    array
    (
        // 中国共产党
        array("中国共产党", "super", "multe-key", "中国共产党", "中共", "总书记", "中央军委", "省委", "市委", 
            "县委", "乡镇党委", "政治局", "中央委员", "村书记", "纪委", "党委", "政法委", "组织部", 
            "中组部"),
        array("人民解放军", "super", "multe-key", "解放军", "红军", "八路军", "新四军", 
            "中央军委", "政委", "政治部"),
        array("中华苏维埃共和国"),
        array("延安整风运动", "super", "multe-key", "延安整风", "第一次整风运动"),
        array("土地改革", "super", "multe-key", "土地改革", "土地革命", "土改", "中国土地法"),
        array("镇反", "super", "multe-key", "镇反", "镇压反革命运动"),
        array("反右派", "super", "multe-key", "事情正在起变化", "反右", "右派分子", "引蛇出洞"),
        array("三年大饥荒", "super", "multe-key", "三年大饥荒", "三年自然灾害", "大跃进", "人民公社", 
            "农业学大寨", "社会主义建设总路线", "多快好省", "以钢为纲", "大炼钢铁", "共产风", "浮夸风", 
            "放卫星", "亩产万斤", "超英赶美", "三面红旗", "信阳事件", "吃饭不要钱", "大饥荒"),
        array("文化大革命", "super", "multe-key", "文化大革命", "文革", "姚文元", "五一六通知", "红卫兵", "造反派" ,
            "大字报", "江青", "陈伯达", "张春桥", "文攻武卫", "三支两军", "无产阶级专政下继续革命", "王洪文",
            "批林批孔", "四人帮", "反击右倾翻案风"),
        array("新时期", "super", "multe-key", "维稳", "邓小平理论", "三讲", "三个代表", "保先", 
            "科学发展观", "和谐社会", "社会主义荣辱观", "八荣八耻", "三个自信", "一带一路", 
            "习近平思想", "习近平理论", "之江新语", "四个全面", "中国梦", "新常态", "四个自信", "供给侧", 
            "统一战线", "群众路线", "统战"),
        
        array("奇言奇行", "super"),
        
        // 组织
        array("中国国民党", "normal", "multe-key", "国民党", "孙中山", "蒋介石", "蒋经国",  
            "李登辉", "连战", "马英九", "洪秀柱", "吴敦义", "宋楚瑜"),
        array("民主进步党", "normal", "multe-key", "民主进步党", "民进党", "林义雄", "施明德", "陈水扁", 
            "谢长廷", "苏贞昌", "蔡英文"),
        array("二二八事件", "normal", "multe-key", "二二八", "2·28"),
        array("美丽岛事件", "normal", "multe-key", "美丽岛", "高雄事件"),
    
    ),
    array
    (
        // 大城市
        array("北京", "super", "multe-key", "北京", "蓟", "燕京", "涿郡", "幽州", "北平"), // "大都"歧义太多.
        array("上海", "super", "multe-key", "上海"),
        array("天津"),
        array("重庆", "super", "multe-key", "重庆", "渝"),
        
        array("广州", "super", "multe-key", "广州", "番禺", "任嚣城"),
        array("深圳", "super", "multe-key", "深圳"),
        array("武汉", "super", "multe-key", "武汉", "武昌", "汉口", "汉阳"),
        array("西安", "super", "multe-key", "西安", "长安", "镐京", "西京", "大兴城"),
        array("南京", "super", "multe-key", "南京", "金陵", "建康", "江宁", "石头城"),
        
        array("杭州", "normal", "multe-key", "杭州", "临安", "武林", "余杭", "杭城"),
        array("沈阳", "normal", "multe-key", "沈阳", "盛京", "奉天"),
        array("郑州"),
        array("长沙"),
        array("成都"),
        array("大连"),
        array("合肥"),
        array("青岛"),
        
        array("苏州", "normal", "multe-key", "苏州", "姑苏", "吴都", "吴中", "吴郡", "平江", "吴门"),
        array("扬州", "normal", "multe-key", "扬州", "邗江", "广陵", "江都", "维扬"),
        array("宁波"),
        array("徐州"),
        array("温州"),
        array("绍兴", "normal", "multe-key", "绍兴", "会稽"),
        array("哈尔滨"),
        array("长春"),
        array("开封", "normal", "multe-key", "开封", "汴梁", "汴州", "汴京", "大梁"), // "东京"歧义太多.
        array("洛阳"),
        array("澳门"),
        array("台北"),
        array("高雄"),
        array("台南"),
        array("厦门"),
        array("兰州"),
        array("乌鲁木齐"),
        array("福州"),
        array("拉萨"),
    ),
    array
    (
        // 省份
        // 东北
        array("辽宁", "normal", "multe-key", "辽宁", "沈阳", "大连", "盘锦", "鞍山", "抚顺", "本溪", "铁岭"),
        array("黑龙江", "normal", "multe-key", "黑龙江", "哈尔滨", "伊春", "牡丹江", "大庆"),
        array("吉林", "normal", "multe-key", "吉林", "长春", "四平"),
        
        // 华北
        array("河南", "normal", "multe-key", "河南", "郑州", "开封", "洛阳", "商丘", "信阳", "南阳", "许昌"),
        array("山东", "normal", "multe-key", "山东", "济南", "青岛", "潍坊", "淄博", "烟台", "临沂", ),
        array("河北", "normal", "multe-key", "河北", "石家庄", "唐山", "邯郸", "承德", "保定", "邢台", "廊坊"),
        array("内蒙古", "normal", "multe-key", "内蒙古", "呼和浩特", "呼伦贝尔", "包头", "鄂尔多斯"),
        array("山西", "normal", "multe-key", "山西", "太原", "大同", "临汾", "吕梁", "晋中"),
        
        // 华东
        array("江苏", "normal", "multe-key", "江苏", "南京", "苏州", "扬州", "徐州", "无锡", 
                "盐城", "淮安", "宿迁", "镇江", "南通"),
        array("浙江", "normal", "multe-key", "浙江", "杭州", "宁波", "温州", "绍兴", "湖州", 
                "嘉兴", "金华", "舟山"),
        array("江西", "normal", "multe-key", "江西", "赣", "南昌", "赣州", "景德镇", "九江", 
                "鹰潭", "宜春"),
        
        // 中部
        array("湖北", "normal", "multe-key", "湖北", "鄂", "武汉", "黄石", "宜昌", "鄂州", "十堰", 
                "襄樊", "荆州", "随州", "孝感", "黄冈"),
        array("湖南", "normal", "multe-key", "湖南", "湘", "长沙", "岳阳", "衡阳", "株洲", "湘潭", 
                "常德", "邵阳", "怀化"),
        array("安徽", "normal", "multe-key", "安徽", "皖", "合肥", "安庆", "徽州", "芜湖", "淮南", 
                "蚌埠", "滁州", "阜阳", "巢湖"),
        array("四川", "normal", "multe-key", "四川", "蜀", "成都", "绵阳", "乐山", "泸州"),
        
        // 华南
        array("广东", "normal", "multe-key", "广东", "粤", "广州", "深圳", "东莞", "佛山", 
                "汕头", "中山", "珠海", "肇庆", "潮州"),
        array("福建", "normal", "multe-key", "福建", "闽", "厦门", "福州", "泉州", "汕头", "莆田", "南平"),
        array("云南", "normal", "multe-key", "云南", "昆明", "玉溪", "大理", "丽江"),
        array("广西", "normal", "multe-key", "广西", "南宁", "柳州", "桂林"),
        array("贵州", "normal", "multe-key", "贵州", "黔", "贵阳", "遵义"),
        array("海南", "normal", "multe-key", "海南", "海口", "三亚", "三沙"),
        
        // 西北
        array("陕西", "normal", "multe-key", "陕西", "陕", "西安", "咸阳", "榆林", "渭南", "汉中", 
                "安康", "延安", "宝鸡"),
        array("甘肃", "normal", "multe-key", "甘肃", "兰州", "武威", "金昌", "张掖", "嘉峪关", 
                "酒泉", "陇南", "天水", "平凉"),
        array("青海", "normal", "multe-key", "青海", "西宁"),
        array("宁夏", "normal", "multe-key", "宁夏", "银川", "固原"),
        
        array("新疆", "super", "multe-key", "新疆", "乌鲁木齐", "且末", "库尔勒", "石河子", 
                "喀什", "克拉玛依", "西域"),
        array("西藏", "super", "multe-key", "西藏", "拉萨", "阿里", "吐蕃", "藏传佛教", "达赖", "班禅"),
    ),
    array
    (
        // 山河湖海
        array("南海", "super", "multe-key", "南海", "南中国海", "九段线", "南沙群岛", 
                "中沙群岛", "西沙", "东沙群岛", "美济礁", "渚碧礁", "黄岩岛", "永兴岛", "三沙市"),
        array("东海", "super", "multe-key", "东海", "东中国海", "春晓油气田", "钓鱼岛"),
        array("黄海"),
        array("渤海"),
        
        array("长江", "super", "multe-key", "长江", "大江", "扬子江"),
        array("黄河"),
        array("京杭大运河", "super", "multe-key", "京杭大运河", "邗沟", "通济渠", "永济渠", 
            "广通渠", "通惠河", "江南河", "大运河"),
        array("辽河"),
        array("淮河"),
        array("珠江"),
        array("塔里木河"),
        array("雅鲁藏布江"),
        
        array("太湖", "super", "multe-key", "太湖", "震泽", "具区"),
        array("鄱阳湖"),
        array("洞庭湖"),
        array("青海湖"),
        
        array("万里长城", "super"),
        array("秦岭"),
        array("河西走廊"),
        array("长江三峡"),
        array("南岭", "normal", "multe-key", "南岭", "五岭", "越城岭", "都庞岭", "萌渚岭", 
                "骑田岭", "大庾岭"),
        array("太行八径", "normal", "multe-key", "太行八径", "军都陉", "蒲阴陉", "飞狐陉", "井陉", "滏口陉", 
                "白陉", "太行陉", "轵关陉"),
        
        array("天山"),
        array("泰山"),
        array("庐山"),
    ),
    array
    (
        // other
    )
);

?>