<?php
// created by duangan, 2015-4-19 -->
// support dynasty deal function.    -->

$dynasty_big = array
(
    "正朔朝代",
    "春秋战国列国",
    "地方政权",
    "周边少数民族",
    "官制",
    "历史与现状",
    "其它"
);

// 朝代数组
$dynasty = array
(
    array
    (
        // 正朔朝代
        array("中国"),
        
        array("夏朝", "normal", "tag-time", "中国", "-2070", "-1600"),
        array("商朝", "normal", "tag-time", "中国", "-1600", "-1046"),
        array("周朝", "super", "tag-time", "中国", "-1046", "-770"),
        array("东周", "super", "tag-time", "中国", "-770", "-221"),
        array("秦朝", "normal", "tag-time", "中国", "-221", "-206"),
        array("汉朝", "super", "tag-time", "中国", "-206", "8"),
        array("新朝", "normal", "tag-time", "中国", "8", "24"),
        array("东汉", "normal", "tag-time", "中国", "24", "220"),
        array("三国", "normal", "tag-time", "中国", "220", "280"),
        array("西晋", "normal", "tag-time", "中国", "280", "316"),
        array("东晋", "normal", "tag-time", "中国", "316", "420"),
        array("南北朝", "normal", "tag-time", "中国", "420", "581"),
        array("隋朝", "normal", "tag-time", "中国", "581", "618"),
        array("唐朝", "super", "tag-time", "中国", "618", "907"),
        array("五代十国", "normal", "tag-time", "中国", "907", "960"),
        array("宋朝", "super", "tag-time", "中国", "960", "1127"),
        array("南宋", "normal", "tag-time", "中国", "1127", "1279"),
        array("元朝", "normal", "tag-time", "中国", "1279", "1368"),
        array("明朝", "normal", "tag-time", "中国", "1368", "1644"),
        array("清朝", "normal", "tag-time", "中国", "1644", "1912"),
        array("中华民国", "super", "tag-time", "中国", "1911", "1949"),
        array("中华人民共和国", "normal", "tag-time", "中国", "1949", "2100"),
        
        array("中华民国台湾", "super", "multe-key", "台湾", "台北", "高雄", "台南", "台中", 
                "蒋经国", "李登辉", "陈水扁", "马英九"),
        array("香港", "normal", "multe-key", "九龙", "新界", "特首"),
    ),
    array
    (
        // 春秋战国列国
        array("鲁国"),
        array("齐国"),
        array("田齐"),
        array("晋国"),
        array("曲沃"),
        array("秦国"),
        array("楚国"),
        array("燕国"),
        array("宋国"),
        array("卫国"),
        array("陈国"),
        array("蔡国"),
        array("曹国"),
        array("郑国"),
        array("吴国"),
        array("越国"),
        array("杞国"),
        array("赵国"),
        array("魏国"),
        array("韩国", "normal", "key-time", "韩国", "-700", "200"),
        array("其它候国", "normal", "key-time", "中山国", "蜀国", "巴国", "郕国", "邓国", "虢国", 
                "霍国", "滑国", "罗国", "莒国", "随国", "许国", "虞国", "-700", "200"),
    ),
    array
    (
        // 地方政权
        array("辽东郡"),
        array("乐浪郡"),
        array("前赵"),
        array("成汉"),
        array("前凉"),
        array("后赵"),
        array("前燕"),
        array("前秦"),
        array("后燕"),
        array("后秦"),
        array("西秦"),
        array("后凉"),
        array("南凉"),
        array("南燕"),
        array("西凉"),
        array("北凉"),
        array("胡夏"),
        array("北燕"),
        array("前仇池"),
        array("后仇池"),
        array("邓至"),
        array("冉魏"),
        array("谯蜀"),
        array("桓楚"),
        array("翟魏"),
        array("西燕"),
        array("宇文部"),
        array("段部"),
        array("北魏", "normal", "key-time", "拓跋代", "代国", "258", "534"),
        array("东魏"),
        array("西魏"),
        array("北齐"),
        array("北周"),
        array("南朝宋"),
        array("南朝齐"),
        array("南朝梁"),
        array("南朝陈"),
        array("辽"),
        array("西夏"),
        array("金国"),
        array("后梁"),
        array("后唐"),
        array("后晋"),
        array("后汉"),
        array("后周"),
        array("南唐"),
        array("吴越"),
        array("闽"),
        array("北汉"),
        array("前蜀"),
        array("后蜀"),
        array("荆南"),
        array("南楚"),
        array("南汉"),
        array("中华苏维埃共和国"),
        array("伪满洲国"),
    ),
    array
    (
        // 周边少数民族
        // 和中原有重大纠葛的
        
        // 东北
        array("鲜卑"),
        array("东胡"),
        array("乌桓"),
        array("吐谷浑"),
        array("柔然"),
        array("契丹"),
        array("室韦"),
        array("蒙古"),
        array("准噶尔汗国"),
        array("女真"),
        array("满族"),
        
        array("濊貊"),
        array("扶余"),
        array("沃沮"),
        array("高句丽"),
        array("古朝鲜", "normal", "multe-key", "弁韩", "马韩", "辰韩", "百济", "新罗", "高丽"),
        
        array("粛慎"),
        
        // 北方
        array("匈奴"),
        array("羯"),
        array("氐"),
        array("鞑靼"),
        
        array("敕勒", "normal", "multe-key", "铁勒", "丁零", "高车"),
        array("回纥"),
        array("维吾尔人"),
        
        // 突厥民族
        array("突厥"),
        array("沙陀"),
        
        // 西方
        array("戎"),
        array("羌"),
        array("党项"),
        array("吐蕃"),
        
        // 南方
        array("苗人"),
        array("壮人"),
        array("黎人"),
        
        // 西域
        array("月氏"),
        array("贵霜帝国"),
        array("乌孙"),
        array("鄯善", "normal", "multe-key", "楼兰"),
        array("车师"),
        array("高昌"),
        array("疏勒"),
        array("于阗"),
        array("龟玆"),
        array("焉耆"),
        
        // 周边地区
        array("西藏", "super", "multe-key", "吐蕃", "藏传佛教", "达赖", "班禅", "拉萨"),
        array("新疆"),
    ),
    array
    (
        // 官制
        // "共和"、"自治" 不宜做关键字。
        array("中央和地方关系", "super", "multe-key", "封建", "郡县", "集权", "分权", "分封", "行省", 
            "推恩令", "单一制", "联邦制"),
        array("宰相", "super", "key-time", "宰相", "丞相", "相国", "大学士", "三公", "九卿", "中书省", "尚书省", 
            "门下省", "尚书台", "司马", "司徒", "司空", "太傅", "太师", "太保", "令尹", "仆射", "平章事", 
            "参知政事", "首辅", "次辅", "内阁学士", "军机处", "-1500", "1911"),
        array("六部", "super", "key-time", "尚书", "侍郎", "吏部", "户部", "礼部", "兵部", "刑部", "工部", "台阁", 
            "治粟内史", "太农令", "大司农", "司农寺", "运使司", "铁盐使司", "度支使司", "国子监", "-1500", "1911"),
        array("司法监察", "super", "key-time", "御史大夫", "廷尉", "御史台", "大理寺", "都察院", "审刑院", 
            "-1500", "1911"),
        array("军制", "super", "key-time", "兵制", "征兵", "募兵", "世兵", "军屯", "团练", "蕃兵", 
            "边军", "府兵", "义从", "禁兵", "卫所", "八旗", "绿营", "虎符", 
            "太尉", "大都督府", "五军都督府", "都指挥使", "大将军", "骠骑将军", "车骑将军", "卫将军", 
            "前后左右将军", "上柱国", "枢密院", "都指挥司", "校尉", "执金吾", "虎贲中郎将", "羽林中郎将",
            "都尉", "观军容使", "折冲府", "节度使", "千户", "百户", "总兵", "参将", "游击", "都司", "守备", "牛录", 
            "甲喇", "固山", "都统", "-1500", "1911"),
        // "宗正" 不宜为关键字。
        array("大内", "super", "key-time", "奉常", "郎中令", "少府", "卫尉",  "太仆", "太常", "太监", "宫女", 
            "中大夫令", "光禄勋", "太府", "太常寺", "光禄寺", "卫尉寺", "太仆寺", "宗人府", "内务府", "詹事府",
            "锦衣卫", "东厂", "西厂", "内厂", "宦官", "-1500", "1911"),
        array("地方官", "super", "key-time", "诸候", "郡守", "县令", "县长", "刺史", "州牧", "通判", "行省", 
            "达鲁花赤", "里长", "布政司", "布政使", "按察司", "总督", "巡抚", "镇守", "-1500", "1911"),
        array("边臣", "super", "key-time", "典客", "大行令", "大鸿胪", "鸿胪寺", "西域都护", "宣慰司", 
            "土司", "理藩院", "-1500", "1911"),
        array("世卿世禄制", "super", "key-time", "世卿世禄", "世袭", "-1500", "1911"),
        array("军功爵制", "super", "key-time", "军功", "斩一首爵一级", "-1500", "1911"),
        array("九品中正制", "super", "key-time", "九品中正", "察举", "征辟", "孝廉", "-1500", "1911"),
        // "明经"、"金榜"不宜为关键字。
        array("科举制", "super", "key-time", "科举", "分科取士", "县试", "童生", "院试", "生员", 
            "秀才", "茂才", "乡试", "解试", "秋闱", "桂榜", "举人", "解元", "会试", "省试", "春闱", 
            "贡士", "会元", "殿试", "进士", "状元", "榜眼", "探花", "投牒自试", "常科", "制科", 
            "帖经", "墨义", "进士及第", "进士出身", "同进士出身", "琼林宴", "糊名", "誊录", 
            "贡院", "科场", "监生", "贡监", "荫监", "举监", "例监", "鹿鸣宴", "座师", "传胪", 
            "连中三元", "庶吉士", "翰林院", "八股文", "-1500", "1911"),
        
        array("宦官问题", "super", "multe-key", "宦官", "太监", ""),
        array("权臣问题", "super", "multe-key", "权臣", "篡", "自立", "弑"),
        array("外戚问题", "super", "multe-key", "外戚"),
        array("宗室问题", "super", "multe-key", "宗室"),
        // "部曲"不宜为关键字。
        array("奴隶问题", "super", "multe-key", "奴隶", "奴婢", "家生子", "隶臣", "隶妾"),
    ),
    array
    (
        // 历史
        array("商鞅变法"),
        array("王安石变法"),
        array("庆历新政"),
        array("张居正变法"),
        array("清末新政"),
        
        // 现状
        array("延安整风运动"),
        array("制宪国民大会"),
        array("改革开放"),
        array("台湾十大建设"),
        array("台湾民主转型"),
        array("村民自治", "super", "multe-key", "村民", "农民", "村民选举", "村民直选", "村长", "村支书"),
        array("中国官员", "super", "multe-key", "中国官员"),
        array("拆迁", "super", "multe-key", "强拆", "血拆", "土地征收"),
        
        // 组织
        array("中国共产党", "super", "multe-key", "中共"),
        array("中国国民党", "super", "multe-key", "国民党", "孙中山", "蒋介石"),
        array("民主进步党", "normal", "multe-key", "民进党"),
        array("人民解放军", "super", "multe-key", "解放军", "红军", "八路军", "新四军", 
            "中央军委", "政委"),
    ),
    array
    (
        // other.
    )
);

?>