<?php
// created by duangan, 2015-4-19 -->
// support dynasty deal function.    -->

$dynasty_big = array
(
    "正朔朝代",
    "东周列国",
    "少数民族和地方政权",
    "古代政治",
    "现代政治",
    "中国共产党",
    "大城市",
    "省份",
    "山河湖海",
    "其它"
);

// 朝代数组
$dynasty = array
(
    array
    (
        // 正朔朝代
        array("中国", "super"),
        array("中国年号", "normal"),
        array("全国重点文物保护单位"),
        
        array("夏朝", "normal", "tag-time", "中国", "-2070", "-1600"),
        array("商朝", "normal", "tag-time", "中国", "-1600", "-1046"),
        array("周朝", "super", "tag-time", "中国", "-1046", "-770"),
        array("春秋战国", "super", "tag-time", "中国", "-770", "-221"),
        array("秦朝", "normal", "tag-time", "中国", "-221", "-206"),
        
        array("汉朝", "super", "tag-time", "中国", "-206", "8"),
        // 汉武帝（在位：前141年", "前87年二月）
        array("汉朝建元", "hide", "tag-time", "中国", "前140年", "前135年"),
        array("汉朝元光", "hide", "tag-time", "中国", "前134年", "前129年"),
        array("元朔", "hide", "tag-time", "中国", "前128年", "前123年"),
        array("元狩", "hide", "tag-time", "中国", "前122年", "前117年"),
        array("元鼎", "hide", "tag-time", "中国", "前116年", "前111年"),
        array("元封", "hide", "tag-time", "中国", "前110年", "前105年"),
        array("汉朝太初", "hide", "tag-time", "中国", "前104年", "前101年"),
        array("汉朝天汉", "hide", "tag-time", "中国", "前100年", "前97年"),
        array("太始", "hide", "tag-time", "中国", "前96年", "前93年"),
        array("征和", "hide", "tag-time", "中国", "前92年", "前89年"),
        array("后元", "hide", "tag-time", "中国", "前88年", "前87年"),
        // 汉昭帝（在位：前87年", "前74年四月）"
        array("始元", "hide", "tag-time", "中国", "前86年", "前80年七月"),
        array("元凤", "hide", "tag-time", "中国", "前80年八月", "前75年"),
        array("元平", "hide", "tag-time", "中国", "前74年"),
        /// 汉宣帝（在位：前74年", "前49年）"
        array("本始", "hide", "tag-time", "中国", "前73年", "前70年"),
        array("地节", "hide", "tag-time", "中国", "前69年", "前66年"),
        array("汉朝元康", "hide", "tag-time", "中国", "前65年", "前61年二月"),
        array("神爵", "hide", "tag-time", "中国", "前61年三月", "前58年"),
        array("汉朝五凤", "hide", "tag-time", "中国", "前57年", "前54年"),
        array("汉朝甘露", "hide", "tag-time", "中国", "前53年", "前50年"),
        array("黄龙", "hide", "tag-time", "中国", "前49年"),
        // 汉元帝（在位：前48年", "前33年）"
        array("初元", "hide", "tag-time", "中国", "前48年", "前44年"),
        array("汉朝永光", "hide", "tag-time", "中国", "前43年", "前39年"),
        array("建昭", "hide", "tag-time", "中国", "前38年", "前34年"),
        array("竟宁", "hide", "tag-time", "中国", "前33年"),
        // 汉成帝（在位：前33年", "前7年）"
        array("建始", "hide", "tag-time", "中国", "前32年", "前28年二月"),
        array("河平", "hide", "tag-time", "中国", "前28年三月", "前25年"),
        array("阳朔", "hide", "tag-time", "中国", "前24年", "前21年"),
        array("鸿嘉", "hide", "tag-time", "中国", "前20年", "前17年"),
        array("永始", "hide", "tag-time", "中国", "前16年", "前13年"),
        array("元延", "hide", "tag-time", "中国", "前12年", "前9年"),
        array("绥和", "hide", "tag-time", "中国", "前8年", "前7年"),
        // 汉哀帝（在位：前7年", "前1年）
        array("汉朝建平", "hide", "tag-time", "中国", "前6年", "前3年"),
        array("太初元将", "hide", "tag-time", "中国", "前5年六月", "前5年八月"),
        array("元寿", "hide", "tag-time", "中国", "前2年", "前1年"),
        // 汉平帝（在位：前1年", "5年）
        array("元始", "hide", "tag-time", "中国", "1年", "5年"),
        // 汉少帝（在位：6年", "8年十一月）
        array("居摄", "hide", "tag-time", "中国", "6年", "8年十一月"),
        array("初始", "hide", "tag-time", "中国", "8年十一月", "8年十一月"),
        
        array("新朝", "normal", "tag-time", "中国", "8", "24"),
        // 王莽（在位：9年", "23年）
        array("始建国", "hide", "tag-time", "中国", "9年", "13年"),
        array("天凤", "hide", "tag-time", "中国", "14年", "19年"),
        array("地皇", "hide", "tag-time", "中国", "20年", "23年九月"),
        
        // 汉更始帝（在位：23年二月", "25年九月）
        array("更始", "hide", "tag-time", "中国", "23年二月", "25年九月"),
        
        // 隗嚣
        array("汉复", "hide", "tag-time", "中国", "23年七月", "34年十月"),
        // 公孙述
        array("龙兴", "hide", "tag-time", "中国", "25年四月", "36年十一月"),
        
        array("东汉", "normal", "tag-time", "中国", "24", "220"),
        // 汉光武帝（在位：25年", "57年二月）
        array("东汉建武", "hide", "tag-time", "中国", "25年六月", "56年四月"),
        array("中元", "hide", "tag-time", "中国", "56年四月", "57年"),
        // 汉明帝（在位：57年", "75年）
        array("东汉永平", "hide", "tag-time", "中国", "58年", "75年"),
        // 汉章帝（在位：75年", "88年）
        array("东汉建初", "hide", "tag-time", "中国", "76年", "84年八月"),
        array("东汉元和", "hide", "tag-time", "中国", "84年八月", "87年七月"),
        array("东汉章和", "hide", "tag-time", "中国", "87年七月", "88年"),
        // 汉和帝（在位：88年", "105年）
        array("东汉永元", "hide", "tag-time", "中国", "89年", "105年三月"),
        array("东汉元兴", "hide", "tag-time", "中国", "105年四月", "105年十二月"),
        // 汉殇帝（在位：106年）
        array("延平", "hide", "tag-time", "中国", "106年", "106年"),
        // 汉安帝（在位：106年", "125年）
        array("东汉永初", "hide", "tag-time", "中国", "107年", "113年"),
        array("元初", "hide", "tag-time", "中国", "114年", "120年四月"),
        array("东汉永宁", "hide", "tag-time", "中国", "120年四月", "121年六月"),
        array("建光", "hide", "tag-time", "中国", "121年七月", "122年三月"),
        array("延光", "hide", "tag-time", "中国", "122年三月", "125年"),
        // 汉顺帝（在位：125年", "144年）
        array("东汉永建", "hide", "tag-time", "中国", "126年", "132年三月"),
        array("阳嘉", "hide", "tag-time", "中国", "132年三月", "135年"),
        array("东汉永和", "hide", "tag-time", "中国", "136年", "141年"),
        array("汉安", "hide", "tag-time", "中国", "142年", "144年四月"),
        array("建康", "hide", "tag-time", "中国", "144年四月", "144年十二月"),
        // 汉冲帝（在位：144年", "145年）
        array("永憙", "hide", "tag-time", "中国", "145年", "145年"),
        // 汉质帝（在位：145年", "146年）
        array("本初", "hide", "tag-time", "中国", "146年", "146年"),
        // 汉桓帝（在位：147年", "167年）"
        array("建和", "hide", "tag-time", "中国", "147年", "149年"),
        array("东汉和平", "hide", "tag-time", "中国", "150年"),
        array("东汉元嘉", "hide", "tag-time", "中国", "151年", "153年五月"),
        array("东汉永兴", "hide", "tag-time", "中国", "153年五月", "154年"),
        array("永寿", "hide", "tag-time", "中国", "155年", "158年六月"),
        array("延熹", "hide", "tag-time", "中国", "158年六月", "167年六月"),
        array("东汉永康", "hide", "tag-time", "中国", "167年六月", "167年十二月"),
        // 汉灵帝（在位：168年", "189年）
        array("建宁", "hide", "tag-time", "中国", "168年", "172年五月"),
        array("熹平", "hide", "tag-time", "中国", "172年五月", "178年三月"),
        array("光和", "hide", "tag-time", "中国", "178年三月", "184年十二月"),
        array("中平", "hide", "tag-time", "中国", "184年十二月", "189年三月"),
        // 汉少帝（在位：189年四月", "189年九月）
        array("光熹", "hide", "tag-time", "中国", "189年四月", "189年八月"),
        array("昭宁", "hide", "tag-time", "中国", "189年八月", "189年九月"),
        // 汉献帝（在位：189年", "220年）
        array("永汉", "hide", "tag-time", "中国", "189年九月", "189年十二月"),
        array("中平", "hide", "tag-time", "中国", "189年十二月", "189年十二月"),
        array("初平", "hide", "tag-time", "中国", "190年", "193年"),
        array("兴平", "hide", "tag-time", "中国", "194年", "195年"),
        array("建安", "hide", "tag-time", "中国", "196年", "220年二月"),
        array("延康", "hide", "tag-time", "中国", "220年三月", "220年十月"),
        
        
        array("三国", "normal", "tag-time", "中国", "220", "280"),
        
        array("曹魏", "hide", "tag-time", "中国", "220年12月10日", "266年2月4日"),
        // 曹丕（在位：220年", "226年）
        array("黄初", "hide", "tag-time", "中国", "220年十月", "226年"),
        // 曹睿（在位：226年", "239年）
        array("曹魏太和", "hide", "tag-time", "中国", "227年", "233年一月"),
        array("青龙", "hide", "tag-time", "中国", "233年二月", "237年二月"),
        array("景初", "hide", "tag-time", "中国", "237年三月", "239年"),
        // 曹芳（在位：239年", "254年）
        array("正始", "hide", "tag-time", "中国", "240年", "249年四月"),
        array("嘉平", "hide", "tag-time", "中国", "249年四月", "254年十月"),
        // 曹髦（在位：254年", "260年）
        array("正元", "hide", "tag-time", "中国", "254年十月", "256年五月"),
        array("曹魏甘露", "hide", "tag-time", "中国", "256年六月", "260年五月"),
        // 曹奂（在位：260年", "265年）
        array("景元", "hide", "tag-time", "中国", "260年六月", "264年五月"),
        array("咸熙", "hide", "tag-time", "中国", "264年五月", "265年"),
        
        // 公孙渊
        array("绍汉", "hide", "tag-time", "中国", "237年七月", "238年八月"),
        
        array("蜀汉", "hide", "tag-time", "中国", "222年5月23日", "280年5月1日"),
        // 刘备（在位：221年", "223年）
        array("章武", "hide", "tag-time", "中国", "221年四月", "223年四月"),
        // 刘禅（在位：223年", "263年）
        array("建兴", "hide", "tag-time", "中国", "223年五月", "237年"),
        array("延熙", "hide", "tag-time", "中国", "238年", "257年"),
        array("景耀", "hide", "tag-time", "中国", "258年", "263年七月"),
        array("炎兴", "hide", "tag-time", "中国", "263年八月", "263年十一月"),
        
        
        array("孙吴", "hide", "tag-time", "中国", "222年5月23日", "280年5月1日"),
        // 孙权（在位：229年", "252年）
        array("黄武", "hide", "tag-time", "中国", "222年十月", "229年四月"),
        array("黄龙", "hide", "tag-time", "中国", "229年四月", "231年"),
        array("嘉禾", "hide", "tag-time", "中国", "232年", "238年八月"),
        array("赤乌", "hide", "tag-time", "中国", "238年八月", "251年四月"),
        array("太元", "hide", "tag-time", "中国", "251年五月", "252年一月"),
        array("神凤", "hide", "tag-time", "中国", "252年二月", "252年四月"),
        // 孙亮（在位：252年", "258年）
        array("建兴", "hide", "tag-time", "中国", "252年四月", "253年"),
        array("五凤", "hide", "tag-time", "中国", "254年", "256年十月"),
        array("孙吴太平", "hide", "tag-time", "中国", "256年十月", "258年十月"),
        // "孙休（在位：258年", "264年）"
        array("孙吴永安", "hide", "tag-time", "中国", "258年十月", "264年六月"),
        // "孙皓（在位：264年", "280年）"
        array("孙吴元兴", "hide", "tag-time", "中国", "264年七月", "265年三月"),
        array("孙吴甘露", "hide", "tag-time", "中国", "265年四月", "266年七月"),
        array("宝鼎", "hide", "tag-time", "中国", "266年八月", "269年九月"),
        array("建衡", "hide", "tag-time", "中国", "269年十月", "271年"),
        array("凤凰", "hide", "tag-time", "中国", "272年", "274年"),
        array("天册", "hide", "tag-time", "中国", "275年", "276年六月"),
        array("天玺", "hide", "tag-time", "中国", "276年七月", "276年十二月"),
        array("天纪", "hide", "tag-time", "中国", "277年", "280年三月"),
        
        array("晋朝", "normal", "tag-time", "中国", "280", "316"),
        // 晋武帝（在位：266年", "290年）"
        array("晋朝泰始", "hide", "tag-time", "中国", "265年十二月", "274年"),
        array("咸宁", "hide", "tag-time", "中国", "275年", "280年四月"),
        array("太康", "hide", "tag-time", "中国", "280年四月", "289年"),
        array("太熙", "hide", "tag-time", "中国", "290年一月", "290年四月"),
        // "晋惠帝（在位：290年", "306年）"
        array("永熙", "hide", "tag-time", "中国", "290年四月", "290年十二月"),
        array("晋朝永平", "hide", "tag-time", "中国", "291年一月", "291年三月"),
        array("晋朝元康", "hide", "tag-time", "中国", "291年三月", "299年"),
        array("晋朝永康", "hide", "tag-time", "中国", "300年", "301年四月"),
        array("晋朝永宁", "hide", "tag-time", "中国", "301年四月", "302年十一月"),
        array("晋朝太安", "hide", "tag-time", "中国", "302年十二月", "303年"),
        array("晋朝永安", "hide", "tag-time", "中国", "304年一月", "304年十一月"),
        array("晋朝永兴", "hide", "tag-time", "中国", "304年十二月", "306年六月"),
        array("光熙", "hide", "tag-time", "中国", "306年六月", "306年十二月"),
        // "晋怀帝（在位：306年", "313年）"
        array("晋朝永嘉", "hide", "tag-time", "中国", "307年", "313年四月"),
        // "晋愍帝（在位：313年", "316年）"
        array("建兴", "hide", "tag-time", "中国", "313年四月", "317年三月"),
        
        
        array("东晋", "normal", "tag-time", "中国", "316", "420"),
        // 晋元帝（在位：318年", "322年）"
        array("东晋建武", "hide", "tag-time", "中国", "317年三月", "318年三月"),
        array("大兴", "hide", "tag-time", "中国", "318年三月", "321年"),
        array("东晋永昌", "hide", "tag-time", "中国", "322年", "323年二月"),
        // 晋明帝（在位：322年", "325年）"
        array("东晋太宁", "hide", "tag-time", "中国", "323年三月", "326年一月"),
        // 晋成帝（在位：325年", "342年）"
        array("咸和", "hide", "tag-time", "中国", "326年二月", "334年"),
        array("东晋咸康", "hide", "tag-time", "中国", "335年", "342年"),
        // 晋康帝（在位：342年", "344年）"
        array("东晋建元", "hide", "tag-time", "中国", "343年", "344年"),
        // 晋穆帝（在位：344年", "361年）"
        array("东晋永和", "hide", "tag-time", "中国", "345年", "356年"),
        array("升平", "hide", "tag-time", "中国", "357年", "361年"),
        // 晋哀帝（在位：361年", "365年）"
        array("隆和", "hide", "tag-time", "中国", "362年", "363年二月"),
        array("兴宁", "hide", "tag-time", "中国", "363年二月", "365年"),
        // 晋废帝（在位：365年", "371年）"
        array("东晋太和", "hide", "tag-time", "中国", "366年", "371年十一月"),
        // 晋简文帝（在位：371年", "372年）"
        array("咸安", "hide", "tag-time", "中国", "371年十一月", "372年"),
        // 晋孝武帝（在位：372年", "396年）"
        array("宁康", "hide", "tag-time", "中国", "373年", "375年"),
        array("太元", "hide", "tag-time", "中国", "376年", "396年"),
        // 晋安帝（在位：397年", "418年）"
        array("隆安", "hide", "tag-time", "中国", "397年", "401年"),
        array("东晋元兴", "hide", "tag-time", "中国", "402年", "404年三月"),
        array("大亨", "hide", "tag-time", "中国", "402年三月", "402年十二月"),
        array("义熙", "hide", "tag-time", "中国", "405年", "418年"),
        // 晋恭帝（在位：419年", "420年）"
        array("元熙", "hide", "tag-time", "中国", "419年", "420年六月"),
        
        
        array("前赵", "hide", "tag-time", "中国", "304", "329"),
        // 刘渊（在位：304年", "310年）"
        array("元熙", "hide", "tag-time", "中国", "304年十月", "308年九月"),
        array("永凤", "hide", "tag-time", "中国", "308年十月", "309年四月"),
        array("河瑞", "hide", "tag-time", "中国", "309年五月", "310年六月"),
        // 刘聪（在位：310年", "318年）"
        array("光兴", "hide", "tag-time", "中国", "310年七月", "311年五月"),
        array("嘉平", "hide", "tag-time", "中国", "311年六月", "315年二月"),
        array("前赵建元", "hide", "tag-time", "中国", "315年三月", "316年十月"),
        array("麟嘉", "hide", "tag-time", "中国", "316年十一月", "318年六月"),
        // 刘粲（在位：318年）"
        array("汉昌", "hide", "tag-time", "中国", "318年七月", "318年九月"),
        // 刘曜（在位：318年", "328年）"
        array("光初", "hide", "tag-time", "中国", "318年十月", "329年八月"),
        
        
        array("成汉", "hide", "tag-time", "中国", "303", "349"),
        // 李特（在位：303年）"
        array("成汉建初", "hide", "tag-time", "中国", "303年", "304年九月"),
        // 李雄（在位：304年", "334年）"
        array("建兴", "hide", "tag-time", "中国", "304年十月", "306年六月"),
        array("晏平", "hide", "tag-time", "中国", "306年六月", "310年"),
        array("玉衡", "hide", "tag-time", "中国", "311年", "334年"),
        // 李期（在位：334年", "338年）"
        array("玉恒", "hide", "tag-time", "中国", "335年", "338年三月"),
        // 李寿（在位：338年", "343年）"
        array("汉兴", "hide", "tag-time", "中国", "338年四月", "343年"),
        //李势（在位：343年", "347年）"
        array("成汉太和", "hide", "tag-time", "中国", "344年", "346年九月"),
        array("嘉宁", "hide", "tag-time", "中国", "346年十月", "347年三月"),
        
        
        array("前凉", "hide", "tag-time", "中国", "320", "376"),
        // 张寔（在位：314年", "320年）使用西晋年号建兴
        // 张茂（在位：320年", "324年）使用西晋年号建兴
        // 张骏（在位：324年", "346年）使用西晋年号建兴
        // 张重华（在位：346年", "353年）使用西晋年号建兴
        // 张祚（在位：353年", "355年）"
        array("前凉和平", "hide", "tag-time", "中国", "354年", "355年九月"),
        // 张玄靓（在位：355年", "363年）
        // 张天锡（在位：363年", "376年）
        // array("建兴", "hide", "tag-time", "中国", "355年九月", "361年十一月"
        array("升平", "hide", "tag-time", "中国", "361年十二月", "376年八月"),


        array("后赵", "hide", "tag-time", "中国", "319", "351"),
        // 石勒（在位：319年", "333年）"
        array("后赵太和", "hide", "tag-time", "中国", "328年二月", "330年八月"),
        array("后赵建平", "hide", "tag-time", "中国", "330年九月", "333年"),
        // 石弘（在位：333年", "334年）"
        array("延熙", "hide", "tag-time", "中国", "334年", "334年"),
        // 石虎（在位：334年", "349年）"
        array("后赵建武", "hide", "tag-time", "中国", "335年", "348年"),
        array("后赵太宁", "hide", "tag-time", "中国", "349年", "349年"),
        // 石鉴（在位：349年", "350年）"
        array("青龙", "hide", "tag-time", "中国", "350年一月", "350年二月"),
        // 石祗（在位：350年", "351年）"
        array("后赵永宁", "hide", "tag-time", "中国", "350年", "351年"),
        
        
        array("冉魏", "hide", "tag-time", "中国", "350", "352"),
        // 冉闵（在位：350年", "352年）"
        array("冉魏永兴", "hide", "tag-time", "中国", "350年二月", "352年四月"),
        
        
        array("前燕", "hide", "tag-time", "中国", "337", "370"),
        // 慕容皝（在位：337年", "348年）
        // 慕容俊（在位：348年", "359年）"
        array("元玺", "hide", "tag-time", "中国", "352年十一月", "357年一月"),
        array("光寿", "hide", "tag-time", "中国", "357年二月", "359年"),
        // 慕容暐（在位：360年", "370年）"
        array("建熙", "hide", "tag-time", "中国", "360年", "370年十一月"),
        
        
        array("前秦", "hide", "tag-time", "中国", "350", "394"),
        // 苻健（在位：351年", "355年）"
        array("前秦皇始", "hide", "tag-time", "中国", "351年", "355年五月"),
        // 苻生（在位：355年", "357年）"
        array("寿光", "hide", "tag-time", "中国", "355年六月", "357年五月"),
        // 苻坚（在位：357年", "385年）"
        array("前秦永兴", "hide", "tag-time", "中国", "357年六月", "359年五月"),
        array("前秦甘露", "hide", "tag-time", "中国", "359年六月", "364年"),
        array("前秦建元", "hide", "tag-time", "中国", "365年", "385年七月"),
        // 苻丕（在位：385年", "386年）"
        array("前秦太安", "hide", "tag-time", "中国", "385年八月", "386年十月"),
        // 苻登（在位：386年", "394年）"
        array("前秦太初", "hide", "tag-time", "中国", "386年十一月", "394年六月"),
        // 苻崇（在位：394年）"
        array("延初", "hide", "tag-time", "中国", "394年七月", "394年十月"),
        
        
        array("后秦", "hide", "tag-time", "中国", "384", "417"),
        // 姚苌（在位：384年", "394年）
        array("白雀", "hide", "tag-time", "中国", "384年四月", "386年四月"),
        array("后秦建初", "hide", "tag-time", "中国", "386年四月", "394年四月"),
        // 姚兴（在位：394年", "416年）
        array("皇初", "hide", "tag-time", "中国", "394年五月", "399年九月"),
        array("弘始", "hide", "tag-time", "中国", "399年九月", "416年一月"),
        // 姚泓（在位：416年", "417年）
        array("后秦永和", "hide", "tag-time", "中国", "416年二月", "417年八月"),
        
        
        array("后燕", "hide", "tag-time", "中国", "384", "409"),
        // 慕容垂（在位：384年", "396年）"
        array("燕元", "hide", "tag-time", "中国", "384年一月", "386年二月"),
        array("建兴", "hide", "tag-time", "中国", "386年二月", "396年四月"),
        // 慕容宝（在位：396年", "398年）"
        array("后燕永康", "hide", "tag-time", "中国", "396年四月", "398年四月"),
        // 慕容盛（在位：398年", "401年）"
        array("后燕建平", "hide", "tag-time", "中国", "398年十月", "398年十二月"),
        array("长乐", "hide", "tag-time", "中国", "399年一月", "401年七月"),
        // 慕容熙（在位：401年", "407年）"
        array("光始", "hide", "tag-time", "中国", "401年八月", "406年十二月"),
        array("建始", "hide", "tag-time", "中国", "407年一月", "407年七月"),
        
        
        array("翟魏", "hide", "tag-time", "中国", "388", "392"),
        // 翟辽
        array("建光", "hide", "tag-time", "中国", "388年二月", "391年十月"),
        array("定鼎", "hide", "tag-time", "中国", "391年十月", "392年六月"),
        
        
        array("西燕", "hide", "tag-time", "中国", "384", "394"),
        // 慕容泓
        array("燕兴", "hide", "tag-time", "中国", "384年四月", "384年十二月"),
        // 慕容冲（在位：385年", "386年）"
        array("更始", "hide", "tag-time", "中国", "385年一月", "386年二月"),
        // 段随（在位：386年）"
        array("昌平", "hide", "tag-time", "中国", "386年二月", "386年三月"),
        // 慕容顗（在位：386年）"
        array("建明", "hide", "tag-time", "中国", "386年三月", "386年三月"),
        // 慕容瑶（在位：386年）"
        array("西燕建平", "hide", "tag-time", "中国", "386年三月", "386年三月"),
        // 慕容忠（在位：386年）"
        array("西燕建武", "hide", "tag-time", "中国", "386年三月", "386年九月"),
        // 慕容永（在位：386年", "394年）"
        array("西燕中兴", "hide", "tag-time", "中国", "386年十月", "394年八月"),
        
        
        array("西秦", "hide", "tag-time", "中国", "385", "431"),
        // 乞伏国仁（在位：385年", "388年）"
        array("建义", "hide", "tag-time", "中国", "385年九月", "388年六月"),
        // 乞伏乾归（在位：388年", "400年；409年", "412年）"
        array("西秦太初", "hide", "tag-time", "中国", "388年六月", "400年七月"),
        array("更始", "hide", "tag-time", "中国", "409年七月", "412年八月"),
        // 乞伏炽磐（在位：412年", "428年）
        array("西秦永康", "hide", "tag-time", "中国", "412年八月", "419年"),
        array("建弘", "hide", "tag-time", "中国", "420年", "428年五月"),
        // 乞伏暮末（在位：428年", "431年）"
        array("永弘", "hide", "tag-time", "中国", "428年五月", "431年一月"),
        
        
        array("后凉", "hide", "tag-time", "中国", "386", "403"),
        // 吕光（在位：386年", "399年）"
        array("后凉太安", "hide", "tag-time", "中国", "386年十月", "389年一月"),
        array("麟嘉", "hide", "tag-time", "中国", "389年二月", "396年六月"),
        array("龙飞", "hide", "tag-time", "中国", "396年六月", "399年"),
        // 吕纂（在位：399年", "401年）"
        array("咸宁", "hide", "tag-time", "中国", "399年十二月", "401年一月"),
        // 吕隆（在位：401年", "403年）"
        array("神鼎", "hide", "tag-time", "中国", "401年二月", "403年八月"),
        
        
        array("南凉", "hide", "tag-time", "中国", "397", "414"),
        // 秃发乌孤（在位：397年", "399年）"
        array("南凉太初", "hide", "tag-time", "中国", "397年", "399年"),
        // 秃发利鹿孤（在位：399年", "402年）"
        array("建和", "hide", "tag-time", "中国", "400年", "402年三月"),
        // 秃发傉檀（在位：402年", "414年）"
        array("弘昌", "hide", "tag-time", "中国", "402年三月", "404年二月"),
        array("嘉平", "hide", "tag-time", "中国", "408年十一月", "414年七月"),
        
        
        array("南燕", "hide", "tag-time", "中国", "398", "410"),
        // 慕容德（在位：398年", "405年）"
        array("燕平", "hide", "tag-time", "中国", "398年", "399年"),
        array("南燕建平", "hide", "tag-time", "中国", "400年", "405年九月"),
        // 慕容超（在位：405年", "410年）"
        array("太上", "hide", "tag-time", "中国", "405年九月", "410年二月"),


        array("西凉", "hide", "tag-time", "中国", "400", "421"),
        // 李皓（在位：400年", "417年）"
        array("庚子", "hide", "tag-time", "中国", "400年十一月", "404年"),
        array("西凉建初", "hide", "tag-time", "中国", "405年", "417年二月"),
        // 李歆（在位：417年", "420年）"
        array("嘉兴", "hide", "tag-time", "中国", "417年二月", "420年七月"),
        // 李恂（在位：420年", "421年）"
        array("西凉永建", "hide", "tag-time", "中国", "420年十月", "421年三月"),
        

        array("大夏", "hide", "tag-time", "中国", "407", "431"),
        // 赫连勃勃（在位：407年", "425年）"
        array("龙升", "hide", "tag-time", "中国", "407年六月", "413年二月"),
        array("凤翔", "hide", "tag-time", "中国", "413年三月", "418年十月"),
        array("昌武", "hide", "tag-time", "中国", "418年十一月", "419年一月"),
        array("真兴", "hide", "tag-time", "中国", "419年二月", "425年七月"),
        // 赫连昌（在位：425年", "428年）"
        array("承光", "hide", "tag-time", "中国", "425年八月", "428年二月"),
        // 赫连定（在位：428年", "431年）"
        array("胜光", "hide", "tag-time", "中国", "428年二月", "431年六月"),
        
        
        array("北燕", "hide", "tag-time", "中国", "407", "436"),
        // 慕容云（在位：407年", "409年）
        array("正始", "hide", "tag-time", "中国", "407年七月", "409年十月"),
        // 冯跋（在位：409年", "430年）"
        array("北燕太平", "hide", "tag-time", "中国", "409年十月", "430年"),
        // 冯弘（在位：430年", "436年）"
        array("太兴", "hide", "tag-time", "中国", "431年", "436年五月"),
        
        
        array("北凉", "hide", "tag-time", "中国", "397", "460"),
        // 段业（在位：397年", "399年）"
        array("神玺", "hide", "tag-time", "中国", "397年五月", "399年一月"),
        array("天玺", "hide", "tag-time", "中国", "399年二月", "401年五月"),
        // 沮渠蒙逊（在位：401年", "433年）"
        array("北凉永安", "hide", "tag-time", "中国", "401年六月", "412年十月"),
        array("玄始", "hide", "tag-time", "中国", "412年十一月", "428年六月"),
        array("承玄", "hide", "tag-time", "中国", "428年六月", "431年六月"),
        array("义和", "hide", "tag-time", "中国", "431年六月", "433年四月"),
        // 沮渠牧犍（在位：433年", "439年）"
        array("承和", "hide", "tag-time", "中国", "433年四月", "439年九月"),
        // 沮渠无讳若干人
        array("承平", "hide", "tag-time", "中国", "443年", "460年"),
        
        
        array("南北朝", "normal", "tag-time", "中国", "420", "589"),
        
        array("刘宋", "hide", "tag-time", "中国", "420", "479"),
        // 刘裕（在位：420年", "422年）"
        array("刘宋永初", "hide", "tag-time", "中国", "420年六月", "422年"),
        // 刘义符（在位：422年", "424年）"
        array("景平", "hide", "tag-time", "中国", "423年", "424年八月"),
        // 刘义隆（在位：424年", "453年）"
        array("刘宋元嘉", "hide", "tag-time", "中国", "424年八月", "453年"),
        // 刘骏（在位：453年", "464年）"
        array("孝建", "hide", "tag-time", "中国", "454年", "456年"),
        array("大明", "hide", "tag-time", "中国", "457年", "464年"),
        // 刘子业（在位：464年", "465年）"
        array("刘宋永光", "hide", "tag-time", "中国", "465年一月", "465年八月"),
        array("景和", "hide", "tag-time", "中国", "465年八月", "465年十一月"),
        // 刘彧（在位：465年", "472年）"
        array("刘宋泰始", "hide", "tag-time", "中国", "465年十二月", "471年"),
        array("泰豫", "hide", "tag-time", "中国", "472年", "472年"),
        // 刘昱（在位：472年", "477年）"
        array("元徽", "hide", "tag-time", "中国", "473年", "477年七月"),
        // 刘准（在位：477年", "479年）"
        array("升明", "hide", "tag-time", "中国", "477年七月", "479年四月"),
        

        array("南齐", "hide", "tag-time", "中国", "479", "502"),
        // 萧道成（在位：479年", "482年）"
        array("南齐建元", "hide", "tag-time", "中国", "479年四月", "482年"),
        // 萧赜（在位：482年", "493年）"
        array("永明", "hide", "tag-time", "中国", "483年", "493年"),
        // 萧昭业（在位：493年", "494年）
        array("隆昌", "hide", "tag-time", "中国", "494年一月", "494年七月"),
        // 萧昭文（在位：494年）"
        array("南齐延兴", "hide", "tag-time", "中国", "494年七月", "494年十月"),
        // 萧鸾（在位：494年", "498年）
        array("南齐建武", "hide", "tag-time", "中国", "494年十月", "498年四月"),
        array("南齐永泰", "hide", "tag-time", "中国", "498年四月", "498年十二月"),
        // 萧宝卷（在位：498年", "501年）"
        array("南齐永元", "hide", "tag-time", "中国", "499年", "501年三月"),
        // 萧宝融（在位：501年", "502年）"
        array("南齐中兴", "hide", "tag-time", "中国", "501年三月", "502年三月"),
        
        
        array("南梁", "hide", "tag-time", "中国", "502", "560"),
        // 萧衍（在位：502年", "549年）"
        array("天监", "hide", "tag-time", "中国", "502年四月", "519年"),
        array("普通", "hide", "tag-time", "中国", "520年", "527年三月"),
        array("大通", "hide", "tag-time", "中国", "527年三月", "529年九月"),
        array("中大通", "hide", "tag-time", "中国", "529年十月", "534年"),
        array("南梁大同", "hide", "tag-time", "中国", "535年", "546年四月"),
        array("中大同", "hide", "tag-time", "中国", "546年四月", "547年四月"),
        array("太清", "hide", "tag-time", "中国", "547年四月", "549年"),
        // 萧纲（在位：549年", "551年）"
        array("大宝", "hide", "tag-time", "中国", "550年", "551年"),
        // 萧栋（在位：551年）"
        array("天正", "hide", "tag-time", "中国", "551年八月", "551年十一月"),
        // 萧绎（在位：552年", "554年）"
        array("承圣", "hide", "tag-time", "中国", "552年十一月", "555年四月"),
        // 萧渊明（在位：555年）"
        array("南梁天成", "hide", "tag-time", "中国", "555年五月", "555年十月"),
        // 萧方智（在位：555年", "557年）"
        array("绍泰", "hide", "tag-time", "中国", "555年十月", "556年八月"),
        array("南梁太平", "hide", "tag-time", "中国", "556年九月", "557年十月"),
        
        array("西梁", "hide", "tag-time", "中国", "555", "587"),
        // 萧察（在位：555年", "562年）"
        array("西梁大定", "hide", "tag-time", "中国", "555年", "562年一月"),
        // 萧岿（在位：562年", "585年）"
        array("天保", "hide", "tag-time", "中国", "562年二月", "585年"),
        // 萧琮（在位：585年", "587年）"
        array("广运", "hide", "tag-time", "中国", "586年", "587年九月"),
        
        
        array("南陈", "hide", "tag-time", "中国", "557", "589"),
        // 陈霸先（在位：557年", "559年）"
        array("永定", "hide", "tag-time", "中国", "557年十月", "559年"),
        // 陈蒨（在位：559年", "566年）"
        array("天嘉", "hide", "tag-time", "中国", "560年一月", "566年二月"),
        array("天康", "hide", "tag-time", "中国", "566年二月", "566年十二月"),
        // 陈伯宗（在位：566年", "568年）"
        array("光大", "hide", "tag-time", "中国", "567年", "568年"),
        // 陈顼（在位：568年", "582年）"
        array("太建", "hide", "tag-time", "中国", "569年", "582年"),
        // 陈叔宝（在位：582年", "589年）"
        array("南陈至德", "hide", "tag-time", "中国", "583年", "586年"),
        array("祯明", "hide", "tag-time", "中国", "587年", "589年一月"),
        

        array("北魏", "hide", "tag-time", "中国", "386", "534"),
        // 拓跋什翼犍（在位：338年", "376年）"
        array("建国", "hide", "tag-time", "中国", "338年十一月", "376年"),
        // 拓跋圭（在位：386年", "409年）"
        array("登国", "hide", "tag-time", "中国", "386年", "396年六月"),
        array("北魏皇始", "hide", "tag-time", "中国", "396年七月", "398年十二月"),
        array("北魏天兴", "hide", "tag-time", "中国", "398年十二月", "404年十月"),
        array("天赐", "hide", "tag-time", "中国", "404年十月", "409年十月"),
        // 拓跋嗣（在位：409年", "423年）"
        array("北魏永兴", "hide", "tag-time", "中国", "409年十月", "413年"),
        array("神瑞", "hide", "tag-time", "中国", "414年", "416年四月"),
        array("泰常", "hide", "tag-time", "中国", "416年四月", "423年"),
        // 拓跋焘（在位：423年", " 452年）"
        array("始光", "hide", "tag-time", "中国", "424年", "428年一月"),
        array("神䴥", "hide", "tag-time", "中国", "428年二月", "431年"),
        array("北魏延和", "hide", "tag-time", "中国", "432年", "435年一月"),
        array("太延", "hide", "tag-time", "中国", "435年一月", "440年六月"),
        array("太平真君", "hide", "tag-time", "中国", "440年六月", "451年六月"),
        array("正平", "hide", "tag-time", "中国", "451年六月", "452年二月"),
        // 拓跋余（在位：452年）"
        array("承平", "hide", "tag-time", "中国", "452年二月", "452年十月"),
        // 拓跋濬（在位：452年", "465年）"
        array("兴安", "hide", "tag-time", "中国", "452年十月", "454年七月"),
        array("兴光", "hide", "tag-time", "中国", "454年七月", "455年六月"),
        array("北魏太安", "hide", "tag-time", "中国", "455年六月", "459年"),
        array("北魏和平", "hide", "tag-time", "中国", "460年", "465年"),
        // 拓跋弘（在位：465年", "471年）"
        array("天安", "hide", "tag-time", "中国", "466年", "467年八月"),
        array("皇兴", "hide", "tag-time", "中国", "467年八月", "471年八月"),
        // 元宏（在位：471年", "499年）"
        array("北魏延兴", "hide", "tag-time", "中国", "471年八月", "476年六月"),
        array("承明", "hide", "tag-time", "中国", "476年六月", "476年十二月"),
        array("北魏太和", "hide", "tag-time", "中国", "477年", "499年"),
        // 元恪（在位：499年", "515年）"
        array("景明", "hide", "tag-time", "中国", "500年", "504年一月"),
        array("正始", "hide", "tag-time", "中国", "504年一月", "508年八月"),
        array("北魏永平", "hide", "tag-time", "中国", "508年八月", "512年四月"),
        array("北魏延昌", "hide", "tag-time", "中国", "512年四月", "515年"),
        // 元诩（在位：515年", "528年）"
        array("熙平", "hide", "tag-time", "中国", "516年", "518年二月"),
        array("神龟", "hide", "tag-time", "中国", "518年二月", "520年七月"),
        array("正光", "hide", "tag-time", "中国", "520年七月", "525年六月"),
        array("孝昌", "hide", "tag-time", "中国", "525年六月", "528年一月"),
        array("武泰", "hide", "tag-time", "中国", "528年一月", "528年四月"),
        // 元子攸（在位：528年", "530年）"
        array("建义", "hide", "tag-time", "中国", "528年四月", "528年九月"),
        array("北魏永安", "hide", "tag-time", "中国", "528年九月", "530年十月"),
        // 元晔（在位：530年", "531年）"
        array("建明", "hide", "tag-time", "中国", "530年十月", "531年二月"),
        // 元恭（在位：531年）"
        array("普泰", "hide", "tag-time", "中国", "531年二月", "531年十月"),
        // 元朗（在位：531年", "532年）"
        array("北魏中兴", "hide", "tag-time", "中国", "531年十月", "532年四月"),
        // 元修（在位：532年", "534年）"
        array("太昌", "hide", "tag-time", "中国", "532年四月", "532年十二月"),
        array("北魏永兴", "hide", "tag-time", "中国", "532年十二月"),
        array("永熙", "hide", "tag-time", "中国", "532年十二月", "534年十二月"),
        
        
        array("东魏", "hide", "tag-time", "中国", "534", "550"),
        // 元善见（在位：534年", "550年）"
        array("天平", "hide", "tag-time", "中国", "534年十月", "537年"),
        array("元象", "hide", "tag-time", "中国", "538年", "539年十一月"),
        array("兴和", "hide", "tag-time", "中国", "539年十一月", "542年"),
        array("武定", "hide", "tag-time", "中国", "543年", "550年五月"),
        
        
        array("西魏", "hide", "tag-time", "中国", "535", "556"),
        // 元宝炬（在位：535年", "551年）"
        array("大统", "hide", "tag-time", "中国", "535年", "551年"),
        
        
        array("北齐", "hide", "tag-time", "中国", "550", "577"),
        // 高洋（在位：550年", "559年）"
        array("天保", "hide", "tag-time", "中国", "550年五月", "559年"),
        // 高殷（在位：559年", "560年）"
        array("乾明", "hide", "tag-time", "中国", "560年一月", "560年八月"),
        // 高演（在位：560年", "561年）"
        array("皇建", "hide", "tag-time", "中国", "560年八月", "561年十一月"),
        // 高湛（在位：561年", "565年）"
        array("北齐太宁", "hide", "tag-time", "中国", "561年十一月", "562年四月"),
        array("河清", "hide", "tag-time", "中国", "562年四月", "565年四月"),
        // 高纬（在位：565年", "577年）"
        array("天统", "hide", "tag-time", "中国", "565年四月", "569年"),
        array("武平", "hide", "tag-time", "中国", "570年", "576年十二月"),
        array("隆化", "hide", "tag-time", "中国", "576年十二月", "576年十二月"),
        // 高延宗（在位：576年）"
        array("德昌", "hide", "tag-time", "中国", "576年十二月", "576年十二月"),
        // 高恒（在位：577年）"
        array("承光", "hide", "tag-time", "中国", "577年一月", "577年三月"),


        array("北周", "hide", "tag-time", "中国", "557", "581"),
        // 宇文毓（在位：557年", "560年）"
        array("北周武成", "hide", "tag-time", "中国", "559年八月", "560年"),
        // 宇文邕（在位：560年", "578年）"
        array("北周保定", "hide", "tag-time", "中国", "561年", "565年"),
        array("天和", "hide", "tag-time", "中国", "566年", "572年三月"),
        array("建德", "hide", "tag-time", "中国", "572年三月", "578年三月"),
        array("宣政", "hide", "tag-time", "中国", "578年三月", "578年十二月"),
        // 宇文赟（在位：578年", "579年）"
        array("大成", "hide", "tag-time", "中国", "579年一月", "579年二月"),
        // 宇文衍（在位：579年", "581年）"
        array("大象", "hide", "tag-time", "中国", "579年二月", "580年"),
        array("北周大定", "hide", "tag-time", "中国", "581年一月", "581年二月"),


        array("柔然", "hide", "tag-time", "中国", "450", "555"),
        // 予成（在位：464年", "485年）"
        array("柔然永康", "hide", "tag-time", "中国", "464年", "484年"),
        // 豆仑（在位：485年", "492年）"
        array("柔然太平", "hide", "tag-time", "中国", "485年", "491年"),
        // 那盖（在位：492年", "506年）"
        array("柔然太安", "hide", "tag-time", "中国", "492年", "505年"),
        // 伏图（在位：506年", "508年）"
        array("始平", "hide", "tag-time", "中国", "506年", "507年"),
        // 丑奴（在位：508年", "520年）"
        array("柔然建昌", "hide", "tag-time", "中国", "508年", "520年"),
        
        
        array("高昌", "hide", "tag-time", "中国", "489", "640"),
        // 阚首归（在位：478年", "488年）"
        array("高昌建初", "hide", "tag-time", "中国", "489年", "491年"),
        // 曲嘉（在位：501年", "525年）"
        array("承平", "hide", "tag-time", "中国", "502年", "510年"),
        array("义熙", "hide", "tag-time", "中国", "511年", "524年"),
        // 曲光（在位：525年", "530年）"
        array("高昌甘露", "hide", "tag-time", "中国", "525年", "530年"),
        // 曲坚（在位：531年", "548年）"
        array("高昌章和", "hide", "tag-time", "中国", "531年", "548年"),
        // 曲玄喜（在位：548年", "550年）"
        array("高昌永平", "hide", "tag-time", "中国", "549年", "550年"),
        // 高昌和平王（在位：550年", "555年）"
        array("高昌和平", "hide", "tag-time", "中国", "551年", "554年"),
        // 曲宝茂（在位：555年", "561年）"
        array("高昌建昌", "hide", "tag-time", "中国", "555年", "560年"),
        // 曲乾固（在位：561年", "601年）"
        array("高昌延昌", "hide", "tag-time", "中国", "561年", "601年"),
        // 曲伯雅（在位：601年", "623年）"
        array("高昌延和", "hide", "tag-time", "中国", "602年", "613年"),
        array("义和", "hide", "tag-time", "中国", "614年", "619年"),
        array("重光", "hide", "tag-time", "中国", "620年", "623年"),
        // 曲文泰（在位：623年", "640年）"
        array("延寿", "hide", "tag-time", "中国", "624年", "640年"),

        
        array("隋朝", "normal", "tag-time", "中国", "581", "618"),
        // 隋文帝杨坚
        array("开皇", "hide", "tag-time", "中国", "581", "600"),
        array("仁寿", "hide", "tag-time", "中国", "601", "604"),
        // 隋炀帝杨广
        array("大业", "hide", "tag-time", "中国", "605", "618"),
        
        
        array("唐朝", "super", "tag-time", "中国", "618", "907"),
        // 唐高祖李渊（在位：618年", "626年）"
        array("武德", "hide", "tag-time", "中国", "618年五月", "626年"),
        // 唐太宗（在位：626年", "649年）"
        array("唐朝贞观", "hide", "tag-time", "中国", "627年", "649年"),
        // 唐高宗（在位：649年", "683年）"
        array("永徽", "hide", "tag-time", "中国", "650年", "655年"),
        array("显庆", "hide", "tag-time", "中国", "656年", "661年二月"),
        array("龙朔", "hide", "tag-time", "中国", "661年三月", "663年"),
        array("麟德", "hide", "tag-time", "中国", "664年", "665年"),
        array("乾封", "hide", "tag-time", "中国", "666年", "668年二月"),
        array("总章", "hide", "tag-time", "中国", "668年二月", "670年二月"),
        array("咸亨", "hide", "tag-time", "中国", "670年三月", "674年八月"),
        array("唐朝上元", "hide", "tag-time", "中国", "674年八月", "676年十一月"),
        array("仪凤", "hide", "tag-time", "中国", "676年十一月", "679年六月"),
        array("调露", "hide", "tag-time", "中国", "679年六月", "680年八月"),
        array("永隆", "hide", "tag-time", "中国", "680年八月", "681年九月"),
        array("开耀", "hide", "tag-time", "中国", "681年九月", "682年二月"),
        array("永淳", "hide", "tag-time", "中国", "682年二月", "683年十二月"),
        array("弘道", "hide", "tag-time", "中国", "683年十二月", "683年十二月"),
        // 唐中宗（在位：683年", "684年）"
        array("嗣圣", "hide", "tag-time", "中国", "684年一月", "684年二月"),
        // 唐睿宗（在位：684年", "690年，684年九月后，武则天临朝称制）"
        array("文明", "hide", "tag-time", "中国", "684年二月", "684年八月"),
        array("光宅", "hide", "tag-time", "中国", "684年九月", "684年十二月"),
        array("垂拱", "hide", "tag-time", "中国", "685年", "688年"),
        array("唐朝永昌", "hide", "tag-time", "中国", "689年一月", "689年十一月"),
        array("载初", "hide", "tag-time", "中国", "689年十一月", "690年八月"),
        // 武周
        // 武则天（在位：683年", "705年）"
        array("唐朝天授", "hide", "tag-time", "中国", "690年九月", "692年三月"),
        array("如意", "hide", "tag-time", "中国", "692年四月", "692年九月"),
        array("长寿", "hide", "tag-time", "中国", "692年九月", "694年五月"),
        array("延载", "hide", "tag-time", "中国", "694年五月", "694年十二月"),
        array("证圣", "hide", "tag-time", "中国", "695年一月", "695年九月"),
        array("天册万岁", "hide", "tag-time", "中国", "695年九月", "695年十一月"),
        array("万岁登封", "hide", "tag-time", "中国", "695年十二月", "696年三月"),
        array("万岁通天", "hide", "tag-time", "中国", "696年三月", "697年九月"),
        array("神功", "hide", "tag-time", "中国", "697年九月", "697年十二月"),
        array("圣历", "hide", "tag-time", "中国", "698年", "700年五月"),
        array("久视", "hide", "tag-time", "中国", "700年五月", "701年一月"),
        array("大足", "hide", "tag-time", "中国", "701年一月", "701年十月"),
        array("长安", "hide", "tag-time", "中国", "701年十月", "704年"),
        array("神龙", "hide", "tag-time", "中国", "705年", "707年九月"),
        // 唐中宗（在位：705年", "710年）"
        array("景龙", "hide", "tag-time", "中国", "707年九月", "710年六月"),
        // 唐殇帝, 李重茂（在位：710年）"
        array("唐隆", "hide", "tag-time", "中国", "710年六月", "710年七月"),
        // 唐睿宗（在位：710年", "712年）"
        array("景云", "hide", "tag-time", "中国", "710年七月", "712年一月"),
        array("太极", "hide", "tag-time", "中国", "712年一月", "712年四月"),
        array("唐朝延和", "hide", "tag-time", "中国", "712年五月", "712年八月"),
        // 唐玄宗（在位：712年", "756年）"
        array("先天", "hide", "tag-time", "中国", "712年八月", "713年十一月"),
        array("开元", "hide", "tag-time", "中国", "713年十二月", "741年"),
        array("天宝", "hide", "tag-time", "中国", "742年", "756年七月"),
        // 唐肃宗（在位：756年", "762年）"
        array("唐朝至德", "hide", "tag-time", "中国", "756年七月", "758年二月"),
        array("乾元", "hide", "tag-time", "中国", "758年二月", "760年四月"),
        array("唐朝上元", "hide", "tag-time", "中国", "760年四月", "762年四月"),
        array("宝应", "hide", "tag-time", "中国", "762年四月", "763年六月"),
        // 唐代宗（在位：762年", "779年）"
        array("广德", "hide", "tag-time", "中国", "763年七月", "764年"),
        array("唐朝永泰", "hide", "tag-time", "中国", "765年", "766年十一月"),
        array("大历", "hide", "tag-time", "中国", "766年十一月", "779年"),
        // 唐德宗（在位：779年", " 805年）"
        array("建中", "hide", "tag-time", "中国", "780年", "783年"),
        array("兴元", "hide", "tag-time", "中国", "784年", "784年"),
        array("唐朝贞元", "hide", "tag-time", "中国", "785年", "805年八月"),
        // 唐顺宗（在位：805年）"
        array("唐朝永贞", "hide", "tag-time", "中国", "805年八月", "805年十二月"),
        // 唐宪宗（在位：805年", "820年）"
        array("唐朝元和", "hide", "tag-time", "中国", "806年", "820年二月"),
        // 唐穆宗（在位：820年", "824年）"
        array("永新", "hide", "tag-time", "中国", "820年二月", "820年"),
        array("长庆", "hide", "tag-time", "中国", "821年", "824年"),
        // 唐敬宗（在位：824年", "826年）"
        array("宝历", "hide", "tag-time", "中国", "825年", "827年二月"),
        // 唐文宗（在位：826年", "840年）"
        array("唐朝大和", "hide", "tag-time", "中国", "827年二月", "835年"),
        array("开成", "hide", "tag-time", "中国", "836年", "840年"),
        // 唐武宗（在位：840年", " 846年）"
        array("会昌", "hide", "tag-time", "中国", "841年", "846年"),
        // 唐宣宗（在位：846年", "859年）"
        array("大中", "hide", "tag-time", "中国", "847年", "860年十月"),
        // 唐懿宗（在位：859年", "873年）"
        array("咸通", "hide", "tag-time", "中国", "860年十一月", "874年十一月"),
        // 唐僖宗（在位：873年", "888年）"
        array("乾符", "hide", "tag-time", "中国", "874年十一月", "879年"),
        array("广明", "hide", "tag-time", "中国", "880年", "881年七月"),
        array("中和", "hide", "tag-time", "中国", "881年七月", "885年三月"),
        array("光启", "hide", "tag-time", "中国", "885年三月", "888年一月"),
        array("文德", "hide", "tag-time", "中国", "888年二月", "888年十二月"),
        // 唐昭宗（在位：888年", "904年）"
        array("龙纪", "hide", "tag-time", "中国", "889年", "889年"),
        array("大顺", "hide", "tag-time", "中国", "890年", "891年"),
        array("唐朝景福", "hide", "tag-time", "中国", "892年", "893年"),
        array("乾宁", "hide", "tag-time", "中国", "894年", "898年八月"),
        array("光化", "hide", "tag-time", "中国", "898年八月", "901年三月"),
        array("天复", "hide", "tag-time", "中国", "901年四月", "904年四月"),
        array("天祐", "hide", "tag-time", "中国", "904年四月", "907年三月"),
        
        
        array("五代十国", "normal", "tag-time", "中国", "907", "960"),
        array("后梁", "hide", "tag-time", "中国", "907", "923"),
        // 朱温（在位907年", "912年）"
        array("开平", "hide", "tag-time", "中国", "907年四月", "911年4月"),
        array("乾化", "hide", "tag-time", "中国", "911年5月", "913年1月"),
        // 朱友珪（在位912年", "913年）"
        array("凤历", "hide", "tag-time", "中国", "913年1月", "913年2月"),
        // 朱友贞（在位913年", "923年）
        array("乾化", "hide", "tag-time", "中国", "913年二月", "915年十月"),
        array("贞明", "hide", "tag-time", "中国", "915年11月", "921年4月"),
        array("龙德", "hide", "tag-time", "中国", "921年五月", "923年十月"),

        
        array("后唐", "hide", "tag-time", "中国", "923", "936"),
        // 庄宗李存勖
        array("同光", "hide", "tag-time", "中国", "923年4月", "926年4月"),
        // 明宗李嗣源
        array("后唐天成", "hide", "tag-time", "中国", "926年4月", "930年2月"),
        array("长兴", "hide", "tag-time", "中国", "930年2月", "933"),
        // 闵帝李从厚
        array("应顺", "hide", "tag-time", "中国", "934年1月", "934年4月"),
        // 末帝李从珂
        array("清泰", "hide", "tag-time", "中国", "934年4月", "936年11月"),
        

        array("后晋", "hide", "tag-time", "中国", "936", "947"),
        // 高祖石敬瑭
        array("后晋天福", "hide", "tag-time", "中国", "936年11月", "944年6月"),
        // 出帝石重贵
        array("后晋开运", "hide", "tag-time", "中国", "944年7月", "946"),
        
        
        array("后汉", "hide", "tag-time", "中国", "947", "951"),
        // 高祖刘知远, 隐帝刘承祐
        array("后汉天福", "hide", "tag-time", "中国", "947", "947"),
        array("乾祐", "hide", "tag-time", "中国", "948", "950"),
        
        
        array("后周", "hide", "tag-time", "中国", "951", "960"),
        // 太祖郭威
        array("广顺", "hide", "tag-time", "中国", "951", "953"),
        array("显德", "hide", "tag-time", "中国", "954", "960"),
        // 世宗柴荣
        // 恭帝柴宗训
        
        
        array("南吴", "hide", "tag-time", "中国", "902", "937"),
        // 太祖杨行密-使用唐朝年号
        // 烈祖杨渥-使用唐朝年号
        // 高祖杨隆演
        array("武义", "hide", "tag-time", "中国", "919年4月", "921年1月"),
        // 睿帝杨溥
        array("顺义", "hide", "tag-time", "中国", "921年1月", "927年10月"),
        array("乾贞", "hide", "tag-time", "中国", "927年10月", "929"),
        array("南吴大和", "hide", "tag-time", "中国", "929", "935"),
        array("天祚", "hide", "tag-time", "中国", "935", "937"),
        

        array("南唐", "hide", "tag-time", "中国", "384", "394"),
        // 烈祖李昪
        array("昇元", "hide", "tag-time", "中国", "937", "943"),
        // 元宗李璟
        array("保大", "hide", "tag-time", "中国", "943", "957"),
        array("南唐中兴", "hide", "tag-time", "中国", "958年1月", "958年3月"),
        array("交泰", "hide", "tag-time", "中国", "958年3月", "958年5月"),
        // 使用后周显德年号
        // 后使用宋年号
        // 后主李煜
        
        
        array("吴越", "hide", "tag-time", "中国", "907", "978"),
        
        array("南楚", "hide", "tag-time", "中国", "907", "951"),
        
        array("闽国", "hide", "tag-time", "中国", "909", "945"),
        // 太祖王审知
        // 嗣主王延翰
        // 太宗王延钧
        array("龙启", "hide", "tag-time", "中国", "933", "934"),
        array("闽国永和", "hide", "tag-time", "中国", "935", "936"),
        // 康宗王继鹏
        array("通文", "hide", "tag-time", "中国", "936", "939"),
        // 景宗王延曦
        array("永隆", "hide", "tag-time", "中国", "939", "943"),
        // 恭懿王王延政
        array("闽国天德", "hide", "tag-time", "中国", "943", "945"),
        
        
        array("南汉", "hide", "tag-time", "中国", "917", "971"),
        // 高祖刘龑
        array("乾亨", "hide", "tag-time", "中国", "917", "925年12月"),
        array("白龙", "hide", "tag-time", "中国", "925年12月", "928年3月"),
        array("大有", "hide", "tag-time", "中国", "928年3月", "942年4月"),
        // 殇帝刘玢
        array("光天", "hide", "tag-time", "中国", "942年4月", "943年3月"),
        // 中宗刘晟
        array("应乾", "hide", "tag-time", "中国", "943年3月", "943年11月"),
        array("乾和", "hide", "tag-time", "中国", "943年11月", "958年8月"),
        // 后主刘鋹
        array("大宝", "hide", "tag-time", "中国", "958年8月", "971"),
        
        
        array("前蜀", "hide", "tag-time", "中国", "907", "925"),
        // 高祖王建
        array("前蜀武成", "hide", "tag-time", "中国", "908", "910"),
        array("前蜀永平", "hide", "tag-time", "中国", "911", "915"),
        array("通正", "hide", "tag-time", "中国", "916", "916"),
        array("前蜀天汉", "hide", "tag-time", "中国", "917", "917"),
        array("光天", "hide", "tag-time", "中国", "918", "918"),
        // 后主王衍
        array("乾德", "hide", "tag-time", "中国", "919", "924"),
        array("前蜀咸康", "hide", "tag-time", "中国", "925", "925"),
        
        
        array("后蜀", "hide", "tag-time", "中国", "933", "966"),
        // 高祖孟知祥
        array("明德", "hide", "tag-time", "中国", "934", "937"),
        // 后主孟昶
        array("广政", "hide", "tag-time", "中国", "938", "965"),
        
        
        array("南平", "hide", "tag-time", "中国", "924", "963"),
        // 武信王高季兴
        // 文献王高从诲
        // 贞懿王高保融
        // 贞安王高保勖
        // 德仁王高继冲
        

        array("北汉", "hide", "tag-time", "中国", "951", "979"),
        // 世祖刘旻
        array("乾祐", "hide", "tag-time", "中国", "951", "954"),
        // 睿宗刘钧
        array("乾祐", "hide", "tag-time", "中国", "954", "956"),
        array("天会", "hide", "tag-time", "中国", "957", "968"),
        // 少主刘继恩
        // 英武帝刘继元
        array("天会", "hide", "tag-time", "中国", "968", "973"),
        array("广运", "hide", "tag-time", "中国", "974", "979"),
        
        
        array("宋朝", "super", "tag-time", "中国", "960", "1127"),
        // 太祖赵匡胤
        array("建隆", "hide", "tag-time", "中国", "960", "963"),
        array("乾德", "hide", "tag-time", "中国", "963", "968"),
        array("开宝", "hide", "tag-time", "中国", "968", "976"),
        // 太宗赵匡义
        array("太平兴国", "hide", "tag-time", "中国", "976", "984"),
        array("雍熙", "hide", "tag-time", "中国", "984", "987"),
        array("端拱", "hide", "tag-time", "中国", "988", "989"),
        array("淳化", "hide", "tag-time", "中国", "990", "994"),
        array("至道", "hide", "tag-time", "中国", "995", "997"),
        // 真宗赵恒
        array("咸平", "hide", "tag-time", "中国", "998", "1003"),
        array("景德", "hide", "tag-time", "中国", "1004", "1007"),
        array("大中祥符", "hide", "tag-time", "中国", "1008", "1016"),
        array("天禧", "hide", "tag-time", "中国", "1017", "1021"),
        array("乾兴", "hide", "tag-time", "中国", "1022", "1022"),
        // 仁宗赵祯
        array("天圣", "hide", "tag-time", "中国", "1023", "1032"),
        array("明道", "hide", "tag-time", "中国", "1032", "1033"),
        array("景祐", "hide", "tag-time", "中国", "1034", "1038"),
        array("宝元", "hide", "tag-time", "中国", "1038", "1040"),
        array("康定", "hide", "tag-time", "中国", "1040", "1041"),
        array("庆历", "hide", "tag-time", "中国", "1041", "1048"),
        array("皇祐", "hide", "tag-time", "中国", "1049", "1054"),
        array("至和", "hide", "tag-time", "中国", "1054", "1056"),
        array("嘉祐", "hide", "tag-time", "中国", "1056", "1063"),
        // 英宗赵曙
        array("治平", "hide", "tag-time", "中国", "1064", "1067"),
        // 神宗赵顼
        array("熙宁", "hide", "tag-time", "中国", "1068", "1077"),
        array("元丰", "hide", "tag-time", "中国", "1078", "1085"),
        // 哲宗赵煦
        array("元祐", "hide", "tag-time", "中国", "1086", "1094"),
        array("绍圣", "hide", "tag-time", "中国", "1094", "1098"),
        array("元符", "hide", "tag-time", "中国", "1098", "1100"),
        // 徽宗赵佶
        array("建中靖国", "hide", "tag-time", "中国", "1101", "1101"),
        array("崇宁", "hide", "tag-time", "中国", "1102", "1106"),
        array("大观", "hide", "tag-time", "中国", "1107", "1110"),
        array("政和", "hide", "tag-time", "中国", "1111", "1118"),
        array("重和", "hide", "tag-time", "中国", "1118", "1119"),
        array("宣和", "hide", "tag-time", "中国", "1119", "1125"),
        // 钦宗赵桓
        array("靖康", "hide", "tag-time", "中国", "1126", "1127"),
        
        
        array("辽朝", "hide", "tag-time", "中国", "916", "1125"),
        // 太祖耶律阿保机
        array("神册", "hide", "tag-time", "中国", "916", "922-12"),
        array("天赞", "hide", "tag-time", "中国", "922-12", "926-2"),
        array("天显", "hide", "tag-time", "中国", "926-2", "938-11"),
        // 太宗耶律德光
        array("会同", "hide", "tag-time", "中国", "938-11", "947-2"),
        array("辽朝大同", "hide", "tag-time", "中国", "947-2", "947-9"),
        // 世宗耶律阮
        array("天禄", "hide", "tag-time", "中国", "947-9", "951-9"),
        // 穆宗耶律璟
        array("应历", "hide", "tag-time", "中国", "951-9", "969-2"),
        // 景宗耶律贤
        array("保宁", "hide", "tag-time", "中国", "969-2", "979-11"),
        array("乾亨", "hide", "tag-time", "中国", "979-11", "982-9"),
        // 圣宗耶律隆绪
        array("乾亨", "hide", "tag-time", "中国", "982-9", "983-6"),
        array("统和", "hide", "tag-time", "中国", "983-6", "1012-11"),
        array("开泰", "hide", "tag-time", "中国", "1012-11", "1021-11"),
        array("辽朝太平", "hide", "tag-time", "中国", "1021-11", "1031-6"),
        // 兴宗耶律宗真
        array("辽朝景福", "hide", "tag-time", "中国", "1031-6", "1032-11"),
        array("重熙", "hide", "tag-time", "中国", "1032-11", "1055-8"),
        // 道宗耶律洪基
        array("清宁", "hide", "tag-time", "中国", "1055-8", "1064"),
        array("咸雍", "hide", "tag-time", "中国", "1065", "1074"),
        array("大康", "hide", "tag-time", "中国", "1075", "1084"),
        array("大安", "hide", "tag-time", "中国", "1085", "1094"),
        array("寿昌", "hide", "tag-time", "中国", "1095", "1101-2"),
        // 天祚帝耶律延禧
        array("乾统", "hide", "tag-time", "中国", "1101-2", "1110"),
        array("天庆", "hide", "tag-time", "中国", "1111", "1120"),
        array("保大", "hide", "tag-time", "中国", "1121", "1125"),
        
        
        array("西辽", "hide", "tag-time", "中国", "1124", "1218"),
        // 德宗耶律大石
        array("延庆", "hide", "tag-time", "中国", "1124", "1133"),
        array("康国", "hide", "tag-time", "中国", "1134", "1143"),
        // 感天后萧塔不烟
        array("咸清", "hide", "tag-time", "中国", "1144", "1150"),
        // 仁宗耶律夷列
        array("绍兴", "hide", "tag-time", "中国", "1151", "1163"),
        // 承天后耶律普速完
        array("崇福", "hide", "tag-time", "中国", "1164", "1177"),
        // 末主耶律直鲁古
        array("天禧", "hide", "tag-time", "中国", "1178", "1211"),
        

        array("东辽", "hide", "tag-time", "中国", "1212", "1269"),
        // 耶律留哥
        array("元统", "hide", "tag-time", "中国", "1213", "1216"),
        
        
        array("西夏", "hide", "tag-time", "中国", "1038", "1227"),
        // 景宗李元昊
        array("显道", "hide", "tag-time", "中国", "1032", "1034"),
        array("西夏开运", "hide", "tag-time", "中国", "1034", "1034"),
        array("应运", "hide", "tag-time", "中国", "1034", "1036"),
        array("西夏大庆", "hide", "tag-time", "中国", "1036", "1038"),
        array("天授礼法延祚", "hide", "tag-time", "中国", "1038", "1048"),
        // 毅宗李谅祚
        array("建嗣宁国", "hide", "tag-time", "中国", "1049", "1049"),
        array("天祐垂圣", "hide", "tag-time", "中国", "1050", "1052"),
        array("福圣承道", "hide", "tag-time", "中国", "1053", "1056"),
        array("奲都", "hide", "tag-time", "中国", "1056", "1062"),
        array("拱化", "hide", "tag-time", "中国", "1063", "1067"),
        // 惠宗李秉常
        array("乾道", "hide", "tag-time", "中国", "1067", "1068"),
        array("天赐礼盛国庆", "hide", "tag-time", "中国", "1069", "1074"),
        array("大安", "hide", "tag-time", "中国", "1075", "1085"),
        array("天安礼定", "hide", "tag-time", "中国", "1086", "1086"),
        // 崇宗李乾顺
        array("天仪治平", "hide", "tag-time", "中国", "1086", "1089"),
        array("天祐民安", "hide", "tag-time", "中国", "1090", "1097"),
        array("西夏永安", "hide", "tag-time", "中国", "1098", "1100"),
        array("西夏贞观", "hide", "tag-time", "中国", "1101", "1113"),
        array("雍宁", "hide", "tag-time", "中国", "1114", "1118"),
        array("元德", "hide", "tag-time", "中国", "1119", "1127"),
        array("西夏正德", "hide", "tag-time", "中国", "1127", "1134"),
        array("西夏大德", "hide", "tag-time", "中国", "1135", "1139"),
        // 仁宗李仁孝
        array("西夏大庆2", "hide", "tag-time", "中国", "1140", "1143"),
        array("人庆", "hide", "tag-time", "中国", "1144", "1148"),
        array("天盛", "hide", "tag-time", "中国", "1149", "1169"),
        array("乾祐", "hide", "tag-time", "中国", "1170", "1193"),
        // 桓宗李纯祐
        array("天庆", "hide", "tag-time", "中国", "1194", "1206"),
        // 襄宗李安全
        array("应天", "hide", "tag-time", "中国", "1206", "1209"),
        array("皇建", "hide", "tag-time", "中国", "1210", "1211"),
        // 神宗李遵顼
        array("光定", "hide", "tag-time", "中国", "1211", "1223"),
        // 献宗李德旺
        array("乾定", "hide", "tag-time", "中国", "1223", "1226"),
        // 末主李睍
        array("宝义", "hide", "tag-time", "中国", "1226", "1227"),
        
/*
        array("大理国", "hide", "tag-time", "中国", "937", "1253"),
        // 段思平
        array("文德", "hide", "tag-time", "中国", "938", "941"),
        array("神武", "hide", "tag-time", "中国", "941", "944"),
        // 段思英
        array("文经", "hide", "tag-time", "中国", "945", "945"),
        // 段思良
        array("至治", "hide", "tag-time", "中国", "946", "951"),
        // 段思聪
        array("明德", "hide", "tag-time", "中国", "952", "953"),
        array("广德", "hide", "tag-time", "中国", "954", "968"),
        array("顺德", "hide", "tag-time", "中国", "968", "968"),
        // 段素顺
        array("明政", "hide", "tag-time", "中国", "969", "985"),
        // 段素英
        array("广明", "hide", "tag-time", "中国", "986", "1004"),
        array("明应", "hide", "tag-time", "中国", "1005", "1006"),
        array("明统", "hide", "tag-time", "中国", "1006", "1006"),
        array("明圣", "hide", "tag-time", "中国", "1007", "1007"),
        array("明治", "hide", "tag-time", "中国", "1008", "1009"),
        // 段素廉
        array("明启", "hide", "tag-time", "中国", "1010", "1022"),
        // 段素隆
        array("明通", "hide", "tag-time", "中国", "1023", "1026"),
        // 段素真
        array("正治", "hide", "tag-time", "中国", "1027", "1041"),
        // 段素兴
        array("圣明", "hide", "tag-time", "中国", "1041", "1044"),
        array("天明", "hide", "tag-time", "中国", "1044", "1044"),
        // 段思廉
        array("保安", "hide", "tag-time", "中国", "1045", "1052"),
        array("正安", "hide", "tag-time", "中国", "1053", "1059"),
        array("正德", "hide", "tag-time", "中国", "1059", "1064"),
        array("保德", "hide", "tag-time", "中国", "1064", "1074"),
        array("明侯", "hide", "tag-time", "中国", "1075", "1075"),
        // 段廉义
        array("上德", "hide", "tag-time", "中国", "1075", "1076"),
        array("广安", "hide", "tag-time", "中国", "1077", "1080"),
        // 段寿辉
        array("上明", "hide", "tag-time", "中国", "1081", "1081"),
        // 段正明
        array("保定", "hide", "tag-time", "中国", "1082", "1094"),
        // 高升泰
        array("上治", "hide", "tag-time", "中国", "1094", "1096"),
        // 段正淳
        array("天授", "hide", "tag-time", "中国", "1096", "1096"),
        array("开明", "hide", "tag-time", "中国", "1097", "1102"),
        array("天政", "hide", "tag-time", "中国", "1103", "1104"),
        array("文安", "hide", "tag-time", "中国", "1105", "1108"),
        // 段正严
        array("日新", "hide", "tag-time", "中国", "1108", "1109"),
        array("文治", "hide", "tag-time", "中国", "1110", "1119"),
        array("永嘉", "hide", "tag-time", "中国", "1120", "1128"),
        array("保天", "hide", "tag-time", "中国", "1129", "1138"),
        array("广运", "hide", "tag-time", "中国", "1139", "1147"),
        // 段正兴
        array("永贞", "hide", "tag-time", "中国", "1147", "1148"),
        array("大宝", "hide", "tag-time", "中国", "1149", "1155"),
        array("龙兴", "hide", "tag-time", "中国", "1155", "1161"),
        array("盛明", "hide", "tag-time", "中国", "1162", "1162"),
        array("建德", "hide", "tag-time", "中国", "1163", "1171"),
        // 段智兴
        array("利贞", "hide", "tag-time", "中国", "1172", "1175"),
        array("盛德", "hide", "tag-time", "中国", "1176", "1180"),
        array("嘉会", "hide", "tag-time", "中国", "1181", "1184"),
        array("元亨", "hide", "tag-time", "中国", "1185", "1195"),
        array("安定", "hide", "tag-time", "中国", "1195", "1200"),
        // 段智廉
        array("凤历", "hide", "tag-time", "中国", "1201", "1202"),
        array("元寿", "hide", "tag-time", "中国", "1203", "1204"),
        // 段智祥
        array("天开", "hide", "tag-time", "中国", "1205", "1225"),
        array("天辅", "hide", "tag-time", "中国", "1226", "1229"),
        array("仁寿", "hide", "tag-time", "中国", "1230", "1238"),
        // 段祥兴
        array("道隆", "hide", "tag-time", "中国", "1239", "1251"),
        // 段兴智
        array("利正", "hide", "tag-time", "中国", "1252", "1252"),
        array("兴正", "hide", "tag-time", "中国", "1252", "1252"),
        array("天定", "hide", "tag-time", "中国", "1252", "1154"),
*/

        
        array("南宋", "normal", "tag-time", "中国", "1127", "1279"),
        // 高宗赵构
        array("建炎", "hide", "tag-time", "中国", "1127", "1130"),
        array("绍兴", "hide", "tag-time", "中国", "1131", "1162"),
        // 孝宗赵昚
        array("隆兴", "hide", "tag-time", "中国", "1163", "1164"),
        array("乾道", "hide", "tag-time", "中国", "1165", "1173"),
        array("淳熙", "hide", "tag-time", "中国", "1174", "1189"),
        // 光宗赵惇
        array("绍熙", "hide", "tag-time", "中国", "1190", "1194"),
        // 宁宗赵扩
        array("庆元", "hide", "tag-time", "中国", "1195", "1200"),
        array("嘉泰", "hide", "tag-time", "中国", "1201", "1204"),
        array("开禧", "hide", "tag-time", "中国", "1205", "1207"),
        array("嘉定", "hide", "tag-time", "中国", "1208", "1224"),
        // 理宗赵昀
        array("宝庆", "hide", "tag-time", "中国", "1225", "1227"),
        array("绍定", "hide", "tag-time", "中国", "1228", "1233"),
        array("端平", "hide", "tag-time", "中国", "1234", "1236"),
        array("嘉熙", "hide", "tag-time", "中国", "1237", "1240"),
        array("淳祐", "hide", "tag-time", "中国", "1241", "1252"),
        array("宝祐", "hide", "tag-time", "中国", "1253", "1258"),
        array("开庆", "hide", "tag-time", "中国", "1259", "1259"),
        array("景定", "hide", "tag-time", "中国", "1260", "1264"),
        // 度宗赵禥
        array("咸淳", "hide", "tag-time", "中国", "1265", "1274"),
        // 法宗赵㬎
        array("德祐", "hide", "tag-time", "中国", "1275", "1276"),
        // 端宗赵昰
        array("景炎", "hide", "tag-time", "中国", "1276", "1278"),
        // 末帝赵昺
        array("祥兴", "hide", "tag-time", "中国", "1278", "1279"),
        
        
        array("金朝", "hide", "tag-time", "中国", "1114", "1234"),
        // 太祖完颜阿骨打
        array("收国", "hide", "tag-time", "中国", "1115", "1116"),
        array("天辅", "hide", "tag-time", "中国", "1117", "1123"),
        // 太宗完颜晟
        array("天会", "hide", "tag-time", "中国", "1123", "1137"),
        // 熙宗完颜亶
        array("天眷", "hide", "tag-time", "中国", "1138", "1140"),
        array("皇统", "hide", "tag-time", "中国", "1141", "1149"),
        // 海陵王完颜亮
        array("金朝天德", "hide", "tag-time", "中国", "1149", "1153"),
        array("金朝贞元", "hide", "tag-time", "中国", "1153", "1156"),
        array("正隆", "hide", "tag-time", "中国", "1156", "1161"),
        // 世宗完颜雍
        array("金朝大定", "hide", "tag-time", "中国", "1161", "1189"),
        // 章宗完颜璟
        array("明昌", "hide", "tag-time", "中国", "1190", "1196"),
        array("承安", "hide", "tag-time", "中国", "1196", "1200"),
        array("泰和", "hide", "tag-time", "中国", "1201", "1208"),
        // 卫绍王完颜永济
        array("大安", "hide", "tag-time", "中国", "1209", "1211"),
        array("崇庆", "hide", "tag-time", "中国", "1212", "1213-5"),
        array("至宁", "hide", "tag-time", "中国", "1213-5", "1213-9"),
        // 宣宗完颜珣
        array("贞祐", "hide", "tag-time", "中国", "1213-9", "1217-9"),
        array("兴定", "hide", "tag-time", "中国", "1217-9", "1222-8"),
        array("金朝元光", "hide", "tag-time", "中国", "1222-8", "1223"),
        // 哀宗完颜守绪
        array("正大", "hide", "tag-time", "中国", "1224", "1231"),
        array("开兴", "hide", "tag-time", "中国", "1232", "1232-4"),
        array("金朝天兴", "hide", "tag-time", "中国", "1232-4", "1234"),
        
        
        array("元朝", "normal", "tag-time", "中国", "1279", "1368"),
        // 世祖孛儿只斤忽必烈
        array("元朝至元", "hide", "tag-time", "中国", "1271", "1294"),
        // 成宗孛儿只斤铁穆耳
        array("元贞", "hide", "tag-time", "中国", "1295", "1297"),
        array("元朝大德", "hide", "tag-time", "中国", "1297", "1307"),
        // 武宗孛儿只斤海山
        array("至大", "hide", "tag-time", "中国", "1308", "1311"),
        // 仁宗孛儿只斤爱育黎拔力八达
        array("皇庆", "hide", "tag-time", "中国", "1312", "1313"),
        array("延祐", "hide", "tag-time", "中国", "1314", "1320"),
        // 英宗孛儿只斤硕德八剌
        array("至治", "hide", "tag-time", "中国", "1321", "1323"),
        // 泰定帝孛儿只斤也孙铁木儿
        array("泰定", "hide", "tag-time", "中国", "1324", "1328-2"),
        array("致和", "hide", "tag-time", "中国", "1328-2", "1328-9"),
        // 天顺帝孛儿只斤阿速吉八
        array("元朝天顺", "hide", "tag-time", "中国", "1328-9", "1328-9"),
        // 文宗孛儿只斤图帖睦尔
        // 明宗孛儿只斤和世瓎
        array("天历", "hide", "tag-time", "中国", "1328-9", "1330-5"),
        // 文宗孛儿只斤图帖睦尔
        // 宁宗孛儿只斤懿璘质班
        array("至顺", "hide", "tag-time", "中国", "1330-5", "1333-10"),
        // 惠宗孛儿只斤妥欢帖睦尔
        array("元统", "hide", "tag-time", "中国", "1333-10", "1335-11"),
        array("元朝至元2", "hide", "tag-time", "中国", "1335-11", "1340"),
        array("至正", "hide", "tag-time", "中国", "1341", "1368"),
        

        array("天完", "hide", "tag-time", "中国", "1351", "1360"),
        // 徐寿辉
        array("治平", "hide", "tag-time", "中国", "1351-10", "1355-12"),
        array("天完太平", "hide", "tag-time", "中国", "1356-1", "1358-7"),
        array("天启", "hide", "tag-time", "中国", "1358-8", "1359-3"),
        array("天定", "hide", "tag-time", "中国", "1359-4", "1360-5"),
        // 张士诚 
        array("天佑", "hide", "tag-time", "中国", "1353", "1366"),
        // 韩林儿
        array("龙凤", "hide", "tag-time", "中国", "1355", "1366"),
        
        
        array("明朝", "normal", "tag-time", "中国", "1368", "1644"),
        // 太祖朱元璋
        array("洪武", "hide", "tag-time", "中国", "1368", "1398"),
        // 惠宗朱允炆
        array("建文", "hide", "tag-time", "中国", "1399", "1402"),
        // 成祖朱棣
        array("永乐", "hide", "tag-time", "中国", "1403", "1424"), 
        // 仁宗朱高炽
        array("洪熙", "hide", "tag-time", "中国", "1425", "1426"),
        // 宣宗朱瞻基
        array("宣德", "hide", "tag-time", "中国", "1426", "1435"),
        // 英宗朱祁镇
        array("正统", "hide", "tag-time", "中国", "1436", "1449"),
        // 代宗朱祁钰
        array("景泰", "hide", "tag-time", "中国", "1450", "1457-8"),
        // 英宗朱祁镇
        array("明朝天顺", "hide", "tag-time", "中国", "1457-8", "1464"),
        // 宪宗朱见深
        array("成化", "hide", "tag-time", "中国", "1465", "1487"),
        // 孝宗朱祐樘
        array("弘治", "hide", "tag-time", "中国", "1488", "1505"),
        // 武宗朱厚燳
        array("明朝正德", "hide", "tag-time", "中国", "1506", "1521"),
        // 世宗朱厚熜
        array("嘉靖", "hide", "tag-time", "中国", "1522", "1566"),
        // 穆宗朱载垕
        array("隆庆", "hide", "tag-time", "中国", "1567", "1572"),
        // 神宗朱翊钧
        array("万历", "hide", "tag-time", "中国", "1573", "1620-8"),
        // 光宗朱常洛
        array("泰昌", "hide", "tag-time", "中国", "1620-8", "1620-12"),
        // 熹宗朱由校
        array("天启", "hide", "tag-time", "中国", "1621", "1627"),
        // 思宗朱由检
        array("崇祯", "hide", "tag-time", "中国", "1628", "1644"),
        // 安宗朱由崧
        array("弘光", "hide", "tag-time", "中国", "1645", "1645"),
        // 绍宗朱聿键
        array("隆武", "hide", "tag-time", "中国", "1645", "1646"),
        // 昭宗朱由榔. 永历十六年昭宗被杀，台湾郑氏沿用该年号至三十七年
        array("永历", "hide", "tag-time", "中国", "1647", "1683"),
        
        
        array("清朝", "normal", "tag-time", "中国", "1616", "1912"),
        // 太祖爱新觉罗努尔哈赤
        array("天命", "hide", "tag-time", "中国", "1616", "1626"),
        // 太宗爱新觉罗皇太极
        array("天聪", "hide", "tag-time", "中国", "1627", "1636-4"),
        array("崇德", "hide", "tag-time", "中国", "1636-4", "1643"),
        // 世祖爱新觉罗福临
        array("顺治", "hide", "tag-time", "中国", "1644", "1661"),
        // 圣祖爱新觉罗玄烨
        array("康熙", "hide", "tag-time", "中国", "1662", "1722"),
        // 世宗爱新觉罗胤禛
        array("雍正", "hide", "tag-time", "中国", "1723", "1735"),
        // 高宗爱新觉罗弘历
        array("乾隆", "hide", "tag-time", "中国", "1736", "1795"),
        // 仁宗爱新觉罗顒琰
        array("嘉庆", "hide", "tag-time", "中国", "1796", "1820"),
        // 宣宗爱新觉罗旻宁
        array("道光", "hide", "tag-time", "中国", "1821", "1850"),
        // 文宗爱新觉罗奕詝
        array("咸丰", "hide", "tag-time", "中国", "1851", "1861"),
        // 穆宗爱新觉罗载淳
        array("同治", "hide", "tag-time", "中国", "1862", "1874"),
        // 德宗爱新觉罗载湉
        array("光绪", "hide", "tag-time", "中国", "1875", "1908"),
        // 废帝爱新觉罗溥仪
        array("宣统", "hide", "tag-time", "中国", "1909", "1911"),
        
        
        array("南周", "hide", "tag-time", "中国", "1674", "1681"),
        // 吴三桂
        array("昭武", "hide", "tag-time", "中国", "1678-3", "1678-8"),
        // 吴世璠
        array("洪化", "hide", "tag-time", "中国", "1678-8", "1681-10"),
        
        
        array("中华民国", "super", "tag-time", "中国", "1911", "1949"),
        array("中华人民共和国", "super", "tag-time", "中国", "1949", "2100"),
        array("台湾", "super"),
        array("香港", "super", "multe-key", "香港", "香港岛", "九龙", "新界", "特首", "行政长官", "立法会"),
    ),
    array
    (
        // 春秋战国列国
        array("鲁国"),
        array("齐国", "super", "multe-key", "齐国", "田齐"),
        array("晋国", "super", "multe-key", "晋国", "曲沃", "三家分晋"),
        array("秦国"),
        array("楚国"),
        array("燕国"),
        array("宋国"),
        array("卫国"),
        array("陈国"),
        array("蔡国"),
        array("曹国"),
        array("郑国"),
        array("吴国"),
        array("越国"),
        array("赵国"),
        array("魏国"),
        array("韩国", "normal", "key-time", "韩国", "-700", "200"),
        array("杞国", "hide"),
        array("中山国", "hide"), 
        array("蜀国", "hide"),
        array("巴国", "hide"),
        array("郕国", "hide"), 
        array("邓国", "hide"),
        array("虢国", "hide"),
        array("霍国", "hide"),
        array("滑国", "hide"),
        array("罗国", "hide"),
        array("莒国", "hide"),
        array("随国", "hide"),
        array("许国", "hide"),
        array("虞国", "hide"),
    ),
    array
    (
        // 少数民族和地方政权
        array("戎"),
        array("匈奴", "super", "multe-key", "匈奴","前赵", "汉赵", "胡夏", "北凉", "沮渠"),
        array("突厥"),
        array("氐", "super", "multe-key", "氐", "前秦", "前仇池", "后仇池", "武都国", "武兴国", 
            "阴平国", "后凉"),
        array("前秦", "super", "multe-key", "前秦", "王猛"),
        array("成汉"),
        array("羯", "normal", "multe-key", "羯", "后赵"),
        array("沙陀", "super", "multe-key", "沙陀", "后唐", "后晋", "后汉", "北汉"),
        
        array("东胡"),
        array("乌桓"),
        array("鲜卑", "super", "multe-key", "鲜卑", "前燕", "后燕", "西燕", "南燕", "北燕", "段部", 
                "慕容部", "宇文部", "拓跋部", "北魏", "东魏", "西魏", "乞伏部", "西秦", "秃发氏", 
                "南凉", "北周"),
        array("吐谷浑"),
        array("柔然"),
        array("辽朝", "super", "multe-key", "契丹", "辽朝", "大辽", "西辽", "后西辽"),
        array("蒙古", "super", "key-time", "蒙古", "室韦", "蒙兀", "忽里勒台", 
            "钦察汗国", "伊儿汗国", "木华黎", "速不台", "916", "1644"),
        array("鞑靼", "normal", "multe-key", "瓦剌", "鞑靼", "达延汗", "准噶尔", "喀尔喀", "兀良哈", 
            "鄂尔多斯", "土默特", "察哈尔", "喀剌沁", "喀尔喀", "厄鲁特", "俺答汗"),
        
        array("敕勒", "normal", "multe-key", "敕勒", "丁零", "赤勒", "铁勒", "高车", "翟魏", "翟斌", "翟辽"),
        array("回鹘"),
        array("维吾尔"),
        
        array("东北少数民族", "super", "multe-key", "肃慎", "挹娄", "勿吉", "靺鞨", "濊貊", "扶余", 
                "沃沮", "辽东郡", "乐浪郡", "玄菟郡", "真番郡"),
        array("高句丽", "super", "multe-key", "高句丽", "高句骊", "句丽", "句骊"),
        array("渤海国", "normal", "multe-key", "渤海国", "粟末靺鞨", "大祚荣", "靺鞨国"),
        array("古朝鲜", "super", "multe-key", "箕子朝鲜", "卫满朝鲜", "弁韩", "马韩", "辰韩", 
                "百济", "新罗", "高丽"),
        array("金国", "super", "multe-key", "女真", "女直", "会宁府", "大兴府", "猛安谋克"),
        array("满族", "normal", "multe-key", "满洲", "后金"),
        array("满洲国"),
        
        array("羌", "normal", "multe-key", "羌", "后秦", "邓至"),
        array("西夏", "normal", "multe-key", "党项", "西夏"),
        array("吐蕃"),
        
        array("西南少数民族", "normal", "multe-key", "苗人", "壮人", "黎人"),
        array("西域少数民族", "super", "multe-key", "西域", "月氏", "贵霜帝国", "乌孙", "鄯善", "楼兰", 
                "车师", "高昌", "疏勒", "于阗", "龟玆", "焉耆"),
        
        array("凉州", "normal", "multe-key", "前凉", "西凉"), 
        array("归义军"), 
        array("后梁"),
        array("后周"),
        array("北齐"),
        array("冉魏", "super", "multe-key", "冉魏", "冉闵", "杀胡令"),
        
        array("南方汉人割据", "normal", "multe-key", "谯蜀", "谯纵", "桓楚", "桓玄", "前蜀", 
                "后蜀", "荆南", "南楚", "南汉", "闽国"),
        array("吴越国"), 
        array("南唐"), 
        array("西梁"),
        
    ),
    array
    (
        // 官制
        // "共和"、"自治" 不宜做关键字。
        array("中央和地方关系", "super", "multe-key", "封建", "郡县", "集权", "分权", "分封", "行省", 
            "推恩令", "单一制", "联邦制"),
        array("宰相", "super", "key-time", "宰相", "丞相", "相权", "相国", "大学士", "三公", "九卿", 
            "中书省", "尚书省", "门下省", "尚书台", "司马", "司徒", "司空", "太傅", "太师", "太保", 
            "令尹", "仆射", "平章事", "参知政事", "首辅", "次辅", "内阁学士", "军机处", "-1500", "1911"),
        array("六部", "normal", "key-time", "六部", "尚书", "侍郎", "吏部", "户部", "礼部", "兵部", 
            "刑部", "工部", "台阁", "治粟内史", "太农令", "大司农", "司农寺", "运使司", "铁盐使司", 
            "度支使司", "国子监", "-1500", "1911"),
        array("司法监察", "normal", "key-time", "御史大夫", "廷尉", "御史台", "大理寺", "都察院", "审刑院", 
            "监察", "司法", "-1500", "1911"),
        // "宗正" 不宜为关键字。
        array("大内", "normal", "key-time", "大内", "奉常", "郎中令", "少府", "卫尉",  "太仆", 
            "太常", "太监", "宫女", "中大夫令", "光禄勋", "太府", "太常寺", "光禄寺", "卫尉寺", 
            "太仆寺", "宗人府", "内务府", "詹事府", "-1500", "1911"),
        array("地方官", "normal", "key-time", "诸候", "郡守", "县令", "县长", "刺史", "州牧", "通判", "行省", 
            "达鲁花赤", "里长", "布政司", "布政使", "按察司", "总督", "巡抚", "镇守", "-1500", "1911"),
        array("边臣", "normal", "key-time", "典客", "大行令", "大鸿胪", "鸿胪寺", "西域都护", "宣慰司", 
            "土司", "理藩院", "-1500", "1911"),
        array("世卿世禄制", "normal", "key-time", "世卿世禄", "世袭", "世职", "世官", "-1500", "1911"),
        array("九品中正制", "normal", "key-time", "九品中正", "察举", "征辟", "孝廉", "-1500", "1911"),
        // "明经"、"金榜"不宜为关键字。
        array("科举制", "super", "key-time", "科举", "分科取士", "县试", "童生", "院试", "生员", 
            "秀才", "茂才", "乡试", "解试", "秋闱", "桂榜", "举人", "解元", "会试", "省试", "春闱", 
            "贡士", "会元", "殿试", "进士", "状元", "榜眼", "探花", "投牒自试", "常科", "制科", 
            "帖经", "墨义", "进士及第", "进士出身", "同进士出身", "琼林宴", "糊名", "誊录", 
            "贡院", "科场", "监生", "贡监", "荫监", "举监", "例监", "鹿鸣宴", "座师", "传胪", 
            "连中三元", "庶吉士", "翰林院", "八股文", "-1500", "1911"),
        
        array("太子", "super", "multe-key", "太子", "废立", "立太子", "废太子", "废储", 
            "册封", "继承大统", "皇储", "立储"),
        array("权臣", "normal", "multe-key", "权臣", "篡", "权相", "自立", "弑", "九锡", "黄袍加身"),
        array("太监", "normal", "multe-key", "太监", "阉人", "寺人", "内监", "锦衣卫", "内书堂", "敬事房", 
            "东厂", "西厂", "内厂", "内务府"),
        array("外戚宗室", "normal", "multe-key", "外戚", "国舅", "戚畹", "外家", "后宫干政",
            "临朝", "宗室", "嫔妃", "贵妃", "皇后", "太后", "太皇太后", "老佛爷", "垂帘听政"),
        // "部曲"不宜为关键字。
        array("奴隶", "normal", "multe-key", "奴隶", "奴婢", "家生子", "隶臣", "隶妾"),
        
    ),
    array
    (
        // 政治问题
        array("改革", "super", "multe-key", "改革", "商鞅变法", "王安石变法", "庆历新政", "张居正变法", 
                "洋务运动", "百日维新", "戊戌变法", "清末新政", "制宪国民大会", "改革开放", 
                "台湾十大建设", "台湾民主转型"),
        
        array("太平天国"),
        array("义和团"),
        
        array("村民自治", "super", "multe-key", "村民", "农民", "村民选举", "村民直选", "村长", "村支书"),
        array("土地制度", "super", "multe-key", "土地制度", "平分土地",  "均分土地",  "分配土地", "土地面积", 
                "井田制", "初税亩", "摊丁入亩", "一条鞭法", "两税法", "租庸调", "均田", "土改", 
                "土地改革", "土地承包", "土地权", "圈地", "土地法", "土地问题", "土地征收", "地权"),
        array("水利"),
        array("拆迁", "normal", "multe-key", "拆迁", "强拆", "血拆", "土地征收"),

        array("民主", "super", "multe-key", "民主", "独裁", "选举", "专制"),
        array("宪政", "normal", "multe-key", "宪政", "宪政", "宪法", "制宪"),
        array("言论自由", "super", "multe-key", "言论自由", "新闻自由"),
        array("司法独立", "super", "multe-key", "司法独立", "司法改革", "律师"),
        array("食品安全", "super", "multe-key", "食品", "公共卫生", "毒奶粉", "地沟油", "毒大米", 
            "农药残留", "重金属", "致癌物", "有机农业", "转基因", "食材", "防腐剂", "速冻", "洗涤剂", 
            "消毒剂", "消毒卫生", "卫生标准", "添加剂"),
        array("权贵资本", "normal", "multe-key", "权贵资本", "红二代", "太子党", "反腐", "贪污", 
            "腐败", "腐化", "受贿", "行贿", "裙带", "双规"),
        array("财政税收", "super", "multe-key", "财政", "税收", "社会保障", "社保"),
        array("私人资本", "super", "multe-key", "私人资本", "民企", "私企", "私营企业", "私有企业"),
        array("公有制", "super", "multe-key", "公有制", "国企", "国有企业", "国家所有制", "集体所有制"),
        array("公民社会", "normal", "multe-key", "公民社会", "公益", "非营利", "NPO", "慈善", "群体事件", 
            "群体性事件"),
        array("户口"),
        array("法律犯罪", "normal", "multe-key", "法律", "犯罪"),
    ),
    array
    (
        // 中国共产党
        array("中国共产党", "super", "multe-key", "中国共产党", "中共", "总书记", "中央军委", "省委", "市委", 
            "县委", "乡镇党委", "政治局", "中央委员", "村书记", "纪委", "党委", "政法委", "组织部", 
            "中组部"),
        array("人民解放军", "super", "multe-key", "解放军", "红军", "八路军", "新四军", 
            "中央军委", "政委", "政治部"),
        array("中华苏维埃共和国"),
        array("延安整风运动", "super", "multe-key", "延安整风", "第一次整风运动"),
        array("土地改革", "super", "multe-key", "土地改革", "土地革命", "土改", "中国土地法"),
        array("镇反", "super", "multe-key", "镇反", "镇压反革命运动"),
        array("反右派", "super", "multe-key", "事情正在起变化", "反右", "右派分子", "引蛇出洞"),
        array("三年大饥荒", "super", "multe-key", "三年大饥荒", "三年自然灾害", "大跃进", "人民公社", 
            "农业学大寨", "社会主义建设总路线", "多快好省", "以钢为纲", "大炼钢铁", "共产风", "浮夸风", 
            "放卫星", "亩产万斤", "超英赶美", "三面红旗", "信阳事件", "吃饭不要钱", "大饥荒"),
        array("文化大革命", "super", "multe-key", "文化大革命", "文革", "姚文元", "五一六通知", "红卫兵", "造反派" ,
            "大字报", "江青", "陈伯达", "张春桥", "文攻武卫", "三支两军", "无产阶级专政下继续革命", "王洪文",
            "批林批孔", "四人帮", "反击右倾翻案风"),
        array("新时期", "super", "multe-key", "维稳", "邓小平理论", "三讲", "三个代表", "保先", 
            "科学发展观", "和谐社会", "社会主义荣辱观", "八荣八耻", "三个自信", "一带一路", 
            "习近平思想", "习近平理论", "之江新语", "四个全面", "中国梦", "新常态", "四个自信", "供给侧", 
            "统一战线", "群众路线", "统战"),
        
        array("奇言奇行", "super"),
        
        // 组织
        array("中国国民党", "normal", "multe-key", "国民党", "孙中山", "蒋介石", "蒋经国",  
            "李登辉", "连战", "马英九", "洪秀柱", "吴敦义", "宋楚瑜"),
        array("民主进步党", "normal", "multe-key", "民主进步党", "民进党", "林义雄", "施明德", "陈水扁", 
            "谢长廷", "苏贞昌", "蔡英文"),
        array("二二八事件", "normal", "multe-key", "二二八", "2·28"),
        array("美丽岛事件", "normal", "multe-key", "美丽岛", "高雄事件"),
    
    ),
    array
    (
        // 大城市
        array("北京", "super", "multe-key", "北京", "蓟", "燕京", "涿郡", "幽州", "北平"), // "大都"歧义太多.
        array("上海", "super", "multe-key", "上海"),
        array("天津"),
        array("重庆", "super", "multe-key", "重庆", "渝"),
        
        array("广州", "super", "multe-key", "广州", "番禺", "任嚣城"),
        array("深圳", "super", "multe-key", "深圳"),
        array("武汉", "super", "multe-key", "武汉", "武昌", "汉口", "汉阳"),
        array("西安", "super", "multe-key", "西安", "长安", "镐京", "西京", "大兴城"),
        array("南京", "super", "multe-key", "南京", "金陵", "建康", "江宁", "石头城"),
        
        array("杭州", "normal", "multe-key", "杭州", "临安", "武林", "余杭", "杭城"),
        array("沈阳", "normal", "multe-key", "沈阳", "盛京", "奉天"),
        array("郑州"),
        array("长沙"),
        array("成都"),
        array("大连"),
        array("合肥"),
        array("青岛"),
        
        array("苏州", "normal", "multe-key", "苏州", "姑苏", "吴都", "吴中", "吴郡", "平江", "吴门"),
        array("扬州", "normal", "multe-key", "扬州", "邗江", "广陵", "江都", "维扬"),
        array("宁波"),
        array("徐州"),
        array("温州"),
        array("绍兴", "normal", "multe-key", "绍兴", "会稽"),
        array("哈尔滨"),
        array("长春"),
        array("开封", "normal", "multe-key", "开封", "汴梁", "汴州", "汴京", "大梁"), // "东京"歧义太多.
        array("洛阳"),
        array("澳门"),
        array("台北"),
        array("高雄"),
        array("台南"),
        array("厦门"),
        array("兰州"),
        array("乌鲁木齐"),
        array("福州"),
        array("拉萨"),
    ),
    array
    (
        // 省份
        // 东北
        array("辽宁", "normal", "multe-key", "辽宁", "沈阳", "大连", "盘锦", "鞍山", "抚顺", "本溪", "铁岭"),
        array("黑龙江", "normal", "multe-key", "黑龙江", "哈尔滨", "伊春", "牡丹江", "大庆"),
        array("吉林", "normal", "multe-key", "吉林", "长春", "四平"),
        
        // 华北
        array("河南", "normal", "multe-key", "河南", "郑州", "开封", "洛阳", "商丘", "信阳", "南阳", "许昌"),
        array("山东", "normal", "multe-key", "山东", "济南", "青岛", "潍坊", "淄博", "烟台", "临沂", ),
        array("河北", "normal", "multe-key", "河北", "石家庄", "唐山", "邯郸", "承德", "保定", "邢台", "廊坊"),
        array("内蒙古", "normal", "multe-key", "内蒙古", "呼和浩特", "呼伦贝尔", "包头", "鄂尔多斯"),
        array("山西", "normal", "multe-key", "山西", "太原", "大同", "临汾", "吕梁", "晋中"),
        
        // 华东
        array("江苏", "normal", "multe-key", "江苏", "南京", "苏州", "扬州", "徐州", "无锡", 
                "盐城", "淮安", "宿迁", "镇江", "南通"),
        array("浙江", "normal", "multe-key", "浙江", "杭州", "宁波", "温州", "绍兴", "湖州", 
                "嘉兴", "金华", "舟山"),
        array("江西", "normal", "multe-key", "江西", "赣", "南昌", "赣州", "景德镇", "九江", 
                "鹰潭", "宜春"),
        
        // 中部
        array("湖北", "normal", "multe-key", "湖北", "鄂", "武汉", "黄石", "宜昌", "鄂州", "十堰", 
                "襄樊", "荆州", "随州", "孝感", "黄冈"),
        array("湖南", "normal", "multe-key", "湖南", "湘", "长沙", "岳阳", "衡阳", "株洲", "湘潭", 
                "常德", "邵阳", "怀化"),
        array("安徽", "normal", "multe-key", "安徽", "皖", "合肥", "安庆", "徽州", "芜湖", "淮南", 
                "蚌埠", "滁州", "阜阳", "巢湖"),
        array("四川", "normal", "multe-key", "四川", "蜀", "成都", "绵阳", "乐山", "泸州"),
        
        // 华南
        array("广东", "normal", "multe-key", "广东", "粤", "广州", "深圳", "东莞", "佛山", 
                "汕头", "中山", "珠海", "肇庆", "潮州"),
        array("福建", "normal", "multe-key", "福建", "闽", "厦门", "福州", "泉州", "汕头", "莆田", "南平"),
        array("云南", "normal", "multe-key", "云南", "昆明", "玉溪", "大理", "丽江"),
        array("广西", "normal", "multe-key", "广西", "南宁", "柳州", "桂林"),
        array("贵州", "normal", "multe-key", "贵州", "黔", "贵阳", "遵义"),
        array("海南", "normal", "multe-key", "海南", "海口", "三亚", "三沙"),
        
        // 西北
        array("陕西", "normal", "multe-key", "陕西", "陕", "西安", "咸阳", "榆林", "渭南", "汉中", 
                "安康", "延安", "宝鸡"),
        array("甘肃", "normal", "multe-key", "甘肃", "兰州", "武威", "金昌", "张掖", "嘉峪关", 
                "酒泉", "陇南", "天水", "平凉"),
        array("青海", "normal", "multe-key", "青海", "西宁"),
        array("宁夏", "normal", "multe-key", "宁夏", "银川", "固原"),
        
        array("新疆", "super", "multe-key", "新疆", "乌鲁木齐", "且末", "库尔勒", "石河子", 
                "喀什", "克拉玛依", "西域"),
        array("西藏", "super", "multe-key", "西藏", "拉萨", "阿里", "吐蕃", "藏传佛教", "达赖", "班禅"),
    ),
    array
    (
        // 山河湖海
        array("南海", "super", "multe-key", "南海", "南中国海", "九段线", "南沙群岛", 
                "中沙群岛", "西沙", "东沙群岛", "美济礁", "渚碧礁", "黄岩岛", "永兴岛", "三沙市"),
        array("东海", "super", "multe-key", "东海", "东中国海", "春晓油气田", "钓鱼岛"),
        array("黄海"),
        array("渤海"),
        
        array("长江", "super", "multe-key", "长江", "大江", "扬子江"),
        array("黄河"),
        array("京杭大运河", "super", "multe-key", "京杭大运河", "邗沟", "通济渠", "永济渠", 
            "广通渠", "通惠河", "江南河", "大运河"),
        array("辽河"),
        array("淮河"),
        array("珠江"),
        array("塔里木河"),
        array("雅鲁藏布江"),
        
        array("太湖", "super", "multe-key", "太湖", "震泽", "具区"),
        array("鄱阳湖"),
        array("洞庭湖"),
        array("青海湖"),
        
        array("万里长城", "super"),
        array("秦岭"),
        array("河西走廊"),
        array("长江三峡"),
        array("南岭", "normal", "multe-key", "南岭", "五岭", "越城岭", "都庞岭", "萌渚岭", 
                "骑田岭", "大庾岭"),
        array("太行八径", "normal", "multe-key", "太行八径", "军都陉", "蒲阴陉", "飞狐陉", "井陉", "滏口陉", 
                "白陉", "太行陉", "轵关陉"),
        
        array("天山"),
        array("泰山"),
        array("庐山"),
    ),
    array
    (
        // other
    )
);

?>